ГНЧЭ-1

"ГНЧЭ-1"  – сложное электронное устройство, выдающее каждую секунду очередное число последовательности 1, 2, 2, 3, 3, 3, 4, 4, 4, 4, 5... Ввиду дороговизны электронных комплектующих вам поручено разработать эмулятор для этого устройства.

Входные данные
Дано количество секунд (от 1 до 1000000), которые работает генератор после включения.

Выходные данные
Результат работы генератора

Sample Input:
2

Sample Output:
1 2

Напишите программу. Тестируется через stdin → stdout
Верно решили 542 учащихся
Из всех попыток 48% верных


# ruby
a = gets.to_i

def create_m n
    cnt = 0    
    m=[]
    1.upto(n) do |i| 
        i.times do
            m.push(i)  
            cnt += 1
            if cnt>=n 
                return m
            end
        end 
    end
end         
   
m = create_m a        
print m.join(' ')  


# python
n = int(input())
ls = []
for i in range(1,n+1):
    for j in range(i):
        ls.append(i)
print(*ls[:n])


# JS
let n = +require('fs').readFileSync(0, 'utf8');

let [res, total] = [[], 0]
for (let i = 1;; i++) {
  res.push(...new Array(i).fill(i));
  total += i;
  if (total >= n)
    break;
}

console.log(res.slice(0, n).join(' '));


# C#
using System;

var n = int.Parse(Console.ReadLine());
var count = 0;
for (int i = 1; i <= n; i++)
    for (int j = 0; j < i && count < n; j++)
    {
        Console.Write(i + " ");
        count++;
    }


# java
import java.util.Scanner;
import java.util.function.Function;
import java.util.stream.IntStream;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int sec = scanner.nextInt();
        IntStream.rangeClosed(1, sec)
                .mapToObj(i -> IntStream.generate(() -> i).limit(i))
                .flatMapToInt(Function.identity())
                .limit(sec)
                .forEach(i -> System.out.print(i + " "));
    }
}


# C
#include <stdio.h>
int main() {
    for (int n; scanf("%d",&n)==1; )
        for (int i=0,j=1,q=1,s=q; i<n; ++i, printf("%d ",q), --s, s ? 0 : (++q,s=q));
    return 0;
}


# C++
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    for (int i = 0, j = 0, a = 1; i < n; i++) {
        std::cout << a << " ";
        if (i >= j) {
            j += a + 1;
            a++;
        }
    }
    return 0;
}








