Количество делителей

Подсчитайте количество натуральных делителей числа x (включая 1 и само число; x ≤ 2*10^9).


Входные данные
Вводится натуральное число x.

Выходные данные
Выведите единственное число - количество делителей числа x.

Sample Input:
32

Sample Output:
6

Напишите программу. Тестируется через stdin → stdout
Верно решили 785 учащихся
Из всех попыток 80% верных


# put your ruby code here
x = gets.to_i
m=[]

1.upto(x) do |i|  
    if x % i==0 
        m.push(i)
    end
end

print m.size


# put your python code here
n = int(input())
print(len([i for i in range(1, n + 1) if n % i == 0]))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let  n = +d;
    let result = 0;
    
    for (let i=1; i<=n/2; i++)
        if ( n%i === 0) result++;
    result++;
    
    console.log(result);
  });

  
# C#
using System;

var n = int.Parse(Console.ReadLine());
var count = 0;
for (int i = 1; i <= n; i++)
    if (n % i == 0)
        count++;
Console.Write(count);


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner scan=new Scanner(System.in);
        int x=scan.nextInt();
        int kol = 0;
        for(int i=1;i<=x;i++){
            if (x%i==0){
                kol++;
            }
        }
        System.out.print(kol);
    }
}



# C
#include <stdio.h>
int main() {
    for (int x,n=0; scanf("%d",&x)==1; printf("%d\n",n))
        for (int i=1; i<x+1; x%i ? 0 : (++n), ++i);
    return 0;
}


# C++
#include <iostream>

int main() {
    int x, C = 0;
    std::cin >> x;
    for (int i = 1; i <= x; i++) {
        if (x % i == 0) {
            C++; // На этом языке написана программа
        }
    }
    std::cout << C << "\n";
    return 0;
}



