Ревизия

В связи с визитом Императора Палпатина было решено обновить состав дроидов в ангаре 32. Из-за кризиса было решено новых дроидов не закупать, но выкинуть пару старых. Как известно, Палпатин не переносит дроидов с маленькими серийными номерами, так что все, что требуется - найти среди них двух, у которых серийные номера наименьшие.

Входные данные

Первая строка входного файла содержит целое число N – количество дроидов. (2 ≤ N ≤ 1000), вторая строка – N целых чисел, по модулю не превышающих 2*109 – номера дроидов

Выходные данные

Выведите два числа: первым – последний по величине из номеров дроидов (такого следует утилизировать в первую очередь), а вторым – предпоследний.

Sample Input:

5
10 2 3 1 5
Sample Output:

1 2
Напишите программу. Тестируется через stdin → stdout
Верно решил 401 учащийся
Из всех попыток 66% верных


# ruby
n = gets.to_i
a = gets.chomp.split(' ').map { |j| j.to_i }
a.sort!
print a[0..1].join(" ")


# python
_, l, = input(), input().split()
print(mn := min(l, key=int), min(l, key=lambda x: (x == mn, int(x))))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    str = str[1].split(' ');
    let [min, min2] = +str[0] > +str[1] ? [+str[1], +str[0]] : [+str[0], +str[1]];
    for (let i=2; i<str.length; i++) {
        if ( +str[i] < min) {
            min2 = min;
            min = +str[i]; 
        }
        if ( +str[i]<min2 && +str[i]>min )
            min2 = +str[i];        
     }
   console.log(min+' '+min2);
  });


# C#
using System;
using System.Collections.Generic;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        string non=Console.ReadLine();
        int[] arr=Array. ConvertAll(Console.ReadLine().Split(), int.Parse);
        var list=new List<int>(arr);
        int n1=list.Min();
        list.Remove(n1);
        int n2=list.Min();
                        Console.WriteLine(n1+" " +n2);
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int number = Integer.parseInt(input.nextLine());

        int[] array = new int[number];

        for (int a = 0; a < number; a++) {
            array[a] = input.nextInt();
        }

        for (int b = 0; b < number - 1; b++) {
            for (int e = 0; e < number - 1 - b; e++) {
                if (array[e] > array[e + 1]) {
                    int temporary = array[e];
                    array[e] = array[e + 1];
                    array[e + 1] = temporary;
                }
            }
        }

        System.out.printf("%d %d", array[0], array[1]);
    }
}


# C
#include <stdio.h>
#include <stdlib.h>

static int cmpr(const void *n1, const void *n2)
{
	const int *a = n1;
	const int *b = n2;

	return *a - *b;
}

int main(int argc, char **argv)
{
	size_t n;

	scanf("%zu", &n);

	int *a = malloc(n * sizeof (int));

	for (size_t i = 0; i < n; i++) {
		scanf("%d", &a[i]);
	}

	qsort(a, n, sizeof a[0], cmpr);

	printf("%d %d\n", a[0], a[1]);

	free(a);

	return 0;
}


# C++
#include <iostream>

using namespace std;

int main()
{
    int N, min = 1001, min_i = 0;
    cin >> N;
    int array[N];
    for(int i = 0; i < N; i++)
    {
        cin >> array[i];
        if(array[i] < min)
        {
            min = array[i];
            min_i = i;
        }
    }
    cout << min << " ";
    array[min_i] = 1001;
    min = 1001;
    for(int i = 0; i < N; i++)
        if(array[i] < min)
            min = array[i];
    cout << min;
    return 0;
}