Линейный поиск - 1

Напишите программу, которая определяет, сколько раз встречается заданное число x в данном массиве.

Входные данные
В первой строке задается одно натуральное число N, не превосходящее 1000 – размер массива.
Во второй строке вводятся N чисел – элементы массива (целые числа, не превосходящие по модулю 1000).
В третьей строке содержится одно целое число x , не превосходящее по модулю 1000.

Выходные данные
Вывести одно число – сколько раз встречается x в данном массиве.

Sample Input:
5
1 2 3 4 5
3

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 359 учащихся
Из всех попыток 62% верных


# ruby
n = gets.to_i
a = gets.chomp.split(' ').map { |j| j.to_i }
x = gets.to_i
print "#{a.count(x)}"


# python
n = int(input())
print(list(input().split()).count(input()))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let n = str[2];
    str = str[1].split(' ');
    let result =0; 
    for (let i of str)
        if (i === n) result++;     
    console.log(result);
  });


# C# 
using System;

public class MainClass
{
    public static void Main()
    {
        int n=int. Parse(Console.ReadLine());
        string[] arr=Console.ReadLine().Split();        
        string num=Console.ReadLine();
        int count=0;
        foreach(string s in arr)
        {
        if(num==s)
        count++;
        }
        Console.WriteLine(count);
    }
}


# java
import java.util.Arrays;
import java.util.List;
import java.util.Scanner;
import java.util.stream.Collectors;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        input.nextLine();

        List<Integer> list = Arrays
                .stream(input.nextLine().split("\\s+"))
                .map(Integer::parseInt)
                .collect(Collectors.toList());

        int number = Integer.parseInt(input.nextLine());

        System.out.println(list.stream().filter(x -> x == number).count());
    }
}


# C++
#include <bits/stdc++.h>
#define speed ios_base::sync_with_stdio(false); cin.tie(0); cout.tie(0)
using namespace std;
int32_t main (){
	int n; cin >> n;
	int a[n], q, count = 0;
	for (int i = 0; i < n; ++i) cin >> a[i]; //if (a[i] == q) count ++;
	cin >> q;
	for (int i = 0; i < n; ++i)  if (a[i] == q) count ++;
	cout << count << "\n";
}


# C
#include <stdio.h>

int main(void) 
{
  int time_var, array_size, number, times = 0;
  scanf("%d",&array_size);
  int array[array_size];
  for(int i = 0; i < array_size;i++)
    {
      scanf("%d",&time_var);
      array[i] = time_var;
    }
  scanf("%d",&number);
  for(int i = 0;i < array_size;i++)
    {
      if(array[i] == number)
      {
        times++;
      }
    }
  printf("%d",times);
}

