Серебряная медаль

Спортсмен Василий участвовал в соревнованиях по хоккейболу и получил в личном зачете серебряную медаль. Известно, что участники, получившие одинаковое количество очков, награждаются одинаковыми наградами. Известно, что были разыграны золотые серебряные и бронзовые медали. В задаче не спрашиваются правила хоккейбола. Необходимо только определить сколько очков набрал Василий.

Для решения данной задачи массив лучше не использовать.

Входные данные
На первой строке дано число N (2 ≤ N ≤ 1000) количество спортсменов, участвовавших в соревнованиях, на второй N целых чисел – результаты через пробел.

Выходные данные
Требуется вывести одно число – результат Василия

Sample Input:
5
4 3 3 1 2

Sample Output:
3

Напишите программу. Тестируется через stdin → stdout
Верно решили 275 учащихся
Из всех попыток 53% верных


# ruby
x = gets.to_i
a = gets.chomp.split(' ').map { |j| j.to_i }
a.delete(a.max)
print a.max


# python
n = int(input())
a = [int(i) for i in input().split()]
b = max(a)
for i in range(a.count(b)):
  a.remove(b)
print(max(a))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    str = str[1].split(' ');
    str.sort((a,b) => b-a);
    let i = 1;
    while (str[0] === str[i]) i++;
    console.log(str[i]);
  });

  
# C#
using System;
using System.Linq;
using System.Collections.Generic;


public class MainClass
{
    public static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        var arr=new List<int>(Array.ConvertAll(Console.ReadLine().Split(),int.Parse));
        int max = arr.Max();
        arr.RemoveAll(x => x == max);
        Console.WriteLine(arr.Max());
    }
}


# java
import java.util.Scanner;
import java.util.TreeSet;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int number = Integer.parseInt(input.nextLine());

        TreeSet<Integer> set = new TreeSet<>();

        for (int a = 0; a < number; a++) {
            set.add(input.nextInt());
        }

        System.out.println(set.subSet(0, set.last()).last());
    }
}



# C
#include <inttypes.h>
#include <stdio.h>
#include <limits.h>

int main() {
    size_t N;
    int64_t first = LLONG_MIN, second = LLONG_MIN, score;
    scanf("%zu", &N);
    for (size_t i = 0; i < N; i++) {
        scanf("%"SCNd64, &score);
        if (score > first) {
            second = first;
            first = score;
        } else if (score > second && score != first) {
            second = score;
        }
    }
    printf("%"PRId64, second);
    return 0;
}


# C++
#include <iostream>

using namespace std;

int main()
{
    int N, max_num = -1, numi;
    cin >> N;
    int array[N];
    for(int i = 0; i < N; i++)
        cin >> array[i];
    for(int i = 0; i < N; i++)
        if(array[i] > max_num)
            max_num = array[i];
    for(int i = 0; i < N; i++)
        if(array[i] == max_num)
            array[i] = -1;
    max_num = -1;
    for(int i = 0; i < N; i++)
        if(array[i] > max_num)
        {
            max_num = array[i];
            numi = i;
        }
    cout << array[numi];
    return 0;
}
