Ближайшее число

Напишите программу, которая находит в массиве элемент, самый близкий по величине к  данному числу.

Входные данные
В первой строке задается одно натуральное число N, не превосходящее 1000 – размер массива.
Во второй строке содержатся N чисел – элементы массива (целые числа, не превосходящие по модулю 1000).
В третьей строке вводится одно целое число x, не превосходящее по модулю 1000.

Выходные данные
Вывести значение элемента массива, ближайшее к x. Если таких чисел несколько, выведите любое из них.

Sample Input:
5
1 2 3 4 5
6

Sample Output:
5

Напишите программу. Тестируется через stdin → stdout
Верно решили 416 учащихся
Из всех попыток 38% верных


# ruby
n = gets.to_i
a = gets.chomp.split(' ').map { |j| j.to_i }
x = gets.to_i

d = (a[0]-x).abs 
y = a[0] 

a.each do |i|
    if (i-x).abs < d  
        d = (i-x).abs
        y = i
    end
end

puts y


# python
n = int(input())
lst = list(map(int,input().split()))
x = int(input())

mx = lst[0]
for el in lst:
    if abs(el - x) < abs(mx - x) :
        mx = el
print(mx)


# JS
// put your javascript (node.js) code here
const rl = require('readline').createInterface({
    input: process.stdin,
    output: process.stdout
})
rl.on('line', n => {
    rl.on('line', b => {
        rl.on('line', x => {
            let arr = b.split(' ').filter(el=> el !== '')
            let currentlyHighEl = +arr[0]  
            for (let i=0; i<n; i++) {
    // если элемент массива равен искомогу числу х
                if (arr[i] == x) {
                    currentlyHighEl = +arr[i]
                }
    // curHighEl меньше текущего элемнта массива, но меньше искомого элемента, перезаписываем текущий больший элемент
                if ( +currentlyHighEl < +arr[i] && +arr[i] < x ) {
                    currentlyHighEl = +arr[i]
                }
    // элемент массива больше искомого, но разность между ними меньше разности текущегомакс и элемента массива
                if (+arr[i] > x && (+arr[i] - x) < (x - currentlyHighEl)) {
                    currentlyHighEl = +arr[i] 
                }
                if (+arr[i] < currentlyHighEl && (x - +arr[i]) < ( currentlyHighEl - x)) {
                    currentlyHighEl = +arr[i]   
                }
                // console.log(arr[i])
            }
            console.log(currentlyHighEl.toString())
        })
    })
})


# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        string non=Console.ReadLine();
        int[] arr=Array.ConvertAll(Console.ReadLine().Split(),int.Parse);
        Array.Sort(arr);
        int n=int.Parse(Console.ReadLine());
       int min=2000;
       int near=n;
        
        foreach(int i in arr)
        {
        if(Math.Abs(n-i)<min)  
        {  
        near=i; 
        min=n-i;
        }
        }
        Console.WriteLine(near);               
    }
}


# java
import java.util.Arrays;
import java.util.Scanner;
import java.util.stream.IntStream;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        input.nextLine();

        int[] array = Arrays.stream(input.nextLine().split("\\s+")).mapToInt(Integer::parseInt).toArray();
        int number = Integer.parseInt(input.nextLine());

        int[] difference = Arrays.stream(array).map(x -> Math.abs(number - x)).toArray();
        int min = Arrays.stream(difference).min().getAsInt();

        IntStream.iterate(0, x -> x + 1)
                .limit(array.length)
                .filter(x -> difference[x] == min)
                .forEach(x -> System.out.print(array[x] + " "));
    }
}



# C++
#include <iostream>

using namespace std;

int main()
{
    int N, x, raz = 1001, max = 0;
    cin >> N;
    int array[N];
    for(int i = 0; i < N; i++)
        cin >> array[i];
    cin >> x;
    for(int i = 0; i < N; i++)
        if(abs(array[i] - x) < raz)
        {
            max = array[i];
            raz = abs(array[i] - x);
        }
    cout << max;
    return 0;
}



