Носки

Имеется стол длины L. На столе разложено N носков так, что никакой носок не вылезает за границы стола. Далее имеется умный мальчик Васька, который хочет (сугубо в корыстных целях) замерить толщину покрытия стола носками в M точках.

Входные данные
Во входном файле даны сначала L, N, M (1 ≤ L ≤ 10000, 1 ≤ N ≤ 10000, 1 ≤M ≤ 100000).
Далее идут N пар чисел l ≤ r от 1 до L – левые и правые концы носков.
Затем идут M чисел от 1 до L интересующие Васька точки.
Все числа целые.

Выходные данные
Выведите M чисел – толщину носкового покрытия в каждой точке.

Sample Input:
39 4 7
3 21
3 15
2 20
3 17
4
17
33
5
9
25
37

Sample Output:
4
3
0
4
4
0
0

Напишите программу. Тестируется через stdin → stdout
Верно решили 105 учащихся
Из всех попыток 85% верных


# ruby
l,n,m = gets.chomp.split().map{|j| j.to_i}
len = []

0.upto(n-1) do |i|
    len.push(gets.chomp.split().map{|j| j.to_i})
end 
#print len

0.upto(m-1) do |i|
    p = gets.to_i
    cnt = 0
    len.each do |j| 
        if p >= j[0] and p <= j[1]
            cnt += 1
        end            
    end
    print "#{cnt}\n" 
end 


# JS
var stdin = process.openStdin();

stdin.addListener("data", function (d) {
  let str = d.toString().split("\n");
  let amount = str[0].split(" ");
  amount = +amount[1];
  let arr = [];

  for (let i = 1; i < amount + 1; i++) arr.push(str[i].split(" "));
  for (let i = amount + 1; i < str.length; i++) {
    let a = +str[i];
    let count = 0;
    for (let j = 0; j < arr.length; j++)
      if (a >= +arr[j][0] && a <= +arr[j][1]) count++;
    console.log(count);
  }
});


# C#
using System;

int[] data = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
var (tableLength, socksCount, pointsCount) = (data[0], data[1], data[2]);
var tableProfile = new int[tableLength + 1];

for (int i = 0; i < socksCount; i++)
{
    int[] sock = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
    for (int point = sock[0]; point <= sock[1]; point++)
        tableProfile[point]++;
}

for (int i = 0; i < pointsCount; i++)
{
    var point = int.Parse(Console.ReadLine());
    Console.WriteLine(tableProfile[point]);
}


# java
import java.util.Scanner;
import java.util.stream.IntStream;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int[] data = IntStream.generate(input::nextInt).limit(3).toArray();

        int[] table = new int[data[0]];

        for (int a = 0; a < data[1]; a++) {
            int beginning = input.nextInt();
            int end = Integer.parseInt(input.nextLine().trim());

            for (int sock = beginning - 1; sock <= end - 1; sock++) {
                table[sock] += 1;
            }
        }

        for (int b = 0; b < data[2]; b++) {
            System.out.println(table[input.nextInt() - 1]);
        }
    }
}





