Форум

Клуб Юных Хакеров организовал на своем сайте форум. Форум имеет следующую структуру: каждое сообщение либо начинает новую тему, либо является ответом на какое-либо предыдущее сообщение и принадлежит той же теме. 

После нескольких месяцев использования своего форума юных хакеров заинтересовал вопрос - какая тема на их форуме наиболее популярна. Помогите им выяснить это.

Входные данные

В первой строке вводится целое число N - количество сообщений в форуме (1 <= N <= 1000). Следующие строки содержат описание сообщений в хронологическом порядке. 

Описание сообщения, которое представляет собой начало новой темы, состоит из трех строк. Первая строка содержит число 0. Вторая строка содержит название темы. Длина названия не превышает 30 символов. Третья строка содержит текст сообщения. 

Описание сообщения, которое является ответом на другое сообщение, состоит из двух строк. Первая строка содержит целое число - номер сообщения, ответом на которое оно является. Сообщения нумеруются, начиная с единицы. Ответ всегда появляется позже, чем сообщение, ответом на которое он является. Вторая строка содержит текст сообщения. 

Длина каждого из сообщений не превышает 100 символов.

Выходные данные
Выведите название темы, к которой относится наибольшее количество сообщений. Если таких тем несколько, то выведите первую в хронологическом порядке.

Sample Input:
2
0
topic 1
body of message 1
0
topic 2
body of message 2

Sample Output:
topic 1

Напишите программу. Тестируется через stdin → stdout
Верно решили 75 учащихся
Из всех попыток 61% верных


# ruby
n = gets.to_i
t = []   # themes, cnt messages
m = []   # messages
id_t = 0 # id theme

0.upto(n-1) do |i|
    k = gets.to_i 
    s = gets.chomp.to_s
    
    if k == 0
        s1 = gets.chomp.to_s # body themes' message
        t.push(s)         
        m.push(id_t)
        id_t +=1
    else
        m.push(m[k-1]) # id theme 
    end
end    

max, id_max = 0, 0
0.upto(t.size-1) do |i|
    cnt = 0
    m.each do |j|
        if j==i
            cnt += 1
        end             
    end 
    
    if max < cnt
        max = cnt
        id_max = i
    end 
end

print t[id_max]


# python
rows = (row.strip() for row in open(0).read().split('\n'))
n = int(next(rows))
count, *forum, subj = [0] * (n + 1) + [[]]
for _ in range(n):
    i, s = int(next(rows)), next(rows)
    if i:
        forum[i - 1] += 1
    else:
        subj.append(s)
        forum[count] += 1
        count += 1
        next(rows)
print(subj[forum.index(max(forum))])


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let arr = [];
    let index = 1;
    
    for (let i=1; i<str.length; i++) {
        if (str[i] === '0') {
            arr.push([str[i+1], arr.length+1]);
            i=i+2;
        } else { 
            for (j=0; j<arr.length; j++) 
                if (arr[j].includes(+str[i]))
                    arr[j][arr[j].length]=index;
            i=i+1;        
        }
        index++;
      }
    let max_index = 0;
    for (let i=1; i<arr.length; i++) 
        if ( arr[i].length  > arr[max_index].length )
            max_index = i;
    console.log(arr[max_index][0]);
  });



# C#
using System;

Message[] messages = ReadForum();
MessagesCounting(messages);
string theme = MostPopularTheme(messages);
Console.WriteLine(theme);

Message[] ReadForum()
{
    var messagesCount = int.Parse(Console.ReadLine());
    var array = new Message[messagesCount];
    
    for (int i = 0; i < messagesCount; i++)
    {
        var parentNumber = int.Parse(Console.ReadLine());
        var theme = string.Empty;
        if (parentNumber == 0) theme = Console.ReadLine();
        Console.ReadLine();
        array[i] = new() { ParentNumber = parentNumber, Number = i + 1,
                           MessagesCount = 1, Theme = theme };
    }
    return array;
}

void MessagesCounting(Message[] array)
{
    for (int i = array.Length - 1; i >= 0; i--)
    {
        var child = array[i];
        if (child.ParentNumber == 0) continue;
        for (int j = i - 1; j >= 0; j--)
        {
            ref var parent = ref array[j];
            if (parent.Number == child.ParentNumber)
            {
                parent.MessagesCount += child.MessagesCount;
                break;
            }
        }
    }
}

string MostPopularTheme(Message[] array)
{
    var mostPopular = (MessagesCount: 0, Theme: string.Empty);
    for (int i = 0; i < array.Length; i++)
    {
        var message = array[i];
        if (message.ParentNumber != 0) continue;
        if (message.MessagesCount > mostPopular.MessagesCount)
            mostPopular = (message.MessagesCount, message.Theme);
    }
    return mostPopular.Theme;
}

struct Message
{
    internal readonly int ParentNumber { get; init; }
    internal readonly int Number { get; init; }
    internal int MessagesCount { get; set; }
    internal readonly string Theme { get; init; }
}


# java
import java.util.*;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int amount = Integer.parseInt(input.nextLine());

        List<Topic> forumList = new ArrayList<>();
        String topic = "", text;

        for (int a = 0; a < amount; a++) {
            int number = Integer.parseInt(input.nextLine());

            if(number == 0) {
                topic = input.nextLine();
                text = input.nextLine();
                forumList.add(new Topic(topic, text));
            }
            else if(number > 0) {
                text = input.nextLine();
                if(number <= forumList.size()) {
                    forumList.get(number - 1).setMessages(text);
                }
            }
        }

        int max = forumList.get(0).getSize();
        topic = forumList.get(0).getTitle();

        for (Topic t : forumList) {
            if(t.getSize() > max) {
                max = t.getSize();
                topic = t.getTitle();
            }
        }

        System.out.println(topic);
    }
}

class Topic {
    private String title;
    List<String> messages = new ArrayList<>();

    Topic(String title, String text) {
        this.title = title;
        messages.add(text);
    }

    String getTitle() {
        return title;
    }

    void setMessages(String text) {
        messages.add(text);
    }

    int getSize() {
        return messages.size();
    }
}



