Сумма чисел

Напишите программу, которая вычисляет сумму двух целых неотрицательных чисел (длина каждого из чисел не превосходит 250 цифр)

Входные данные
Даны два числа, каждое записано на отдельной строке.

Выходные данные
Выведите сумму данных чисел.

Sample Input:
3
5

Sample Output:
8

Напишите программу. Тестируется через stdin → stdout
Верно решил 131 учащийся
Из всех попыток 87% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a+b


# JS
let transform = (n1, n2, res_len) => {
    n1.push(...new Array(res_len).fill(0));
    n1 = n1.slice(0, res_len);
    
    n2.push(...new Array(res_len).fill(0));
    n2 = n2.slice(0, res_len);
    return [n1, n2];
};

let sum = (n1, n2) => {
    res_len = Math.max(n1.length, n2.length) + 1;
    [n1, n2] = transform(n1, n2, res_len)
    
    let res = [];
    let to_mind = 0;
    for (let i = 0; i < res_len; i++) {
        let tmp = n1[i] + n2[i] + to_mind;
        res.push(tmp % 10);
        to_mind = Math.floor(tmp / 10);
    };
    return res.reverse().join('').replace(/^0+/, '');
};

const [n1, n2] = require('fs').readFileSync(0, 'utf8').split('\n').map(z => z.split('').map(Number).reverse());

console.log(sum(n1, n2));


# java
import java.util.Scanner;
import java.math.BigInteger;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        
        BigInteger a = new BigInteger(sc.next());
        BigInteger b = new BigInteger(sc.next());
        
        System.out.println(a.add(b));
    }
}

