Факториал

Напишите программу, вычисляющую факториал данного числа.

Входные данные
Дано чиcло n (n ≤ 3000)

Выходные данные
Выведите факториал данного числа.

Sample Input 1:
0

Sample Output 1:
1

Sample Input 2:
5

Sample Output 2:
120

Напишите программу. Тестируется через stdin → stdout
Верно решили 111 учащихся
Из всех попыток 72% верных


# ruby
def fact(n) (1..n).inject(1) {|r,i| r*i }end

n = gets.to_i
print fact(n)


# python
result = 1
for i in range(2,int(input())+1):
    result *= i
print(result)


# java
import java.util.Scanner;
import java.math.BigInteger;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        
        int n = sc.nextInt();
        
        BigInteger ans = new BigInteger("1");
        
        for (int i = 1; i <= n; i++) {
            ans = ans.multiply(BigInteger.valueOf(i));
        }
        
        System.out.println(ans);
    }
}

