Вычитание со знаком

Напишите программу, которая находит разность двух целых неотрицательных чисел. Длина каждого числа не превышает 250 знаков.

Входные данные
Даны два числа, каждое записано в отдельной строке

Выходные данные
Выведите разность чисел (учтите, что может получиться отрицательный результат).

Sample Input:
5
7

Sample Output:
-2

Напишите программу. Тестируется через stdin → stdout
Верно решил 121 учащийся
Из всех попыток 89% верных

# ruby
a, b = gets.to_i, gets.to_i
print  a-b


# python
a = int(input())
b = int(input())

print(a-b)


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
BigInteger chisl1=new BigInteger(v.next());
BigInteger chisl2=new BigInteger(v.next());
System.out.println(chisl1.subtract(chisl2));
    }
}


