Остаток от деления на 1..9

Напишите программу, вычисляющую остаток от деления целого неотрицательного числа на натуральное однозначное число.

Входные данные
Дано одно число (длиной не более 250 знаков) и число от 1 до 9. Каждое число вводится на отдельной строке.

Выходные данные
Выведите остаток от деления первого числа на второе.

Sample Input:
7
3

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 114 учащихся
Из всех попыток 81% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a%b


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
    BigInteger sum1=new BigInteger(myscan.nextLine());
    BigInteger sum2=new BigInteger(myscan.nextLine());
    System.out.println(sum1.remainder(sum2));    
    }
}

