Остаток от деления на короткое

Напишите программу, вычисляющую остаток от деления двух целых неотрицательных чисел.

Входные данные

Дано одно число (длина которого не превышает 250 знаков) и число от 1 до 9999.

Выходные данные

Выведите остаток от деления первого числа на второе.

Sample Input:

7
3
Sample Output:

1
Напишите программу. Тестируется через stdin → stdout
Верно решили 111 учащихся
Из всех попыток 90% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a%b


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
System.out.println(new BigInteger(v.next()).mod(new BigInteger(v.next())));
    }
}

