Разность чисел

Напишите программу, вычисляющую разность двух целых неотрицательных чисел. Гарантируется, что первое число не меньше второго.

Входные данные
Даны два числа, второе из них не превышает первого. Числа не превышают 10100

Выходные данные
Выведите разность данных чисел.

Sample Input:
7
5

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 124 учащихся
Из всех попыток 86% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a-b


# java
import java.util.Scanner;
import java.math.BigInteger;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        
        BigInteger a = new BigInteger(sc.next());
        BigInteger b = new BigInteger(sc.next());
        
        System.out.println(a.subtract(b));
    }
}