Частное от деления на 1..9

Напишите программу, вычисляющую частное от деления числа N (целое, неотрицательное, не более 250 знаков) на натуральное однозначное число.

Входные данные
Дано одно число и число от 1 до 9, каждое число дано в отдельной строке.

Выходные данные
Выведите частное от деления первого числа на второе.

Sample Input:
9
8

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 113 учащихся
Из всех попыток 62% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a/b


# python
print(int(input())//int(input()))


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
    BigInteger sum1=new BigInteger(myscan.nextLine());
    BigInteger sum2=new BigInteger(myscan.nextLine());
    System.out.println(sum1.divide(sum2));    
    }
}



