Частное от деления на длинное

Напишите программу, вычисляющую частное от деления двух целых неотрицательных чисел.

Входные данные
Дано два числа, длина каждого не превосходит 250 знаков, каждое число вводится на отдельной строке.

Выходные данные
Выведите частное от деления первого на второе.

Sample Input:
7
3

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 110 учащихся
Из всех попыток 94% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a/b


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);        
System.out.println(v.nextBigInteger().divide(v.nextBigInteger()));
    }
}

