Возведение в степень

Вычислите 2**n

Входные данные
Единственное целое неотрицательное число n, не превосходящее 20000

Выходные данные
Выведите ответ на поставленную задачу

Sample Input:
10

Sample Output:
1024

Напишите программу. Тестируется через stdin → stdout
Верно решили 120 учащихся
Из всех попыток 81% верных


# ruby
n = gets.to_i
print  2**n


# python
print(2**int(input()))


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner (System.in);
int n=v.nextInt();        
BigInteger step=BigInteger.valueOf(2);       
for(int i=1;i<n;i++){
    step=step.multiply(BigInteger.valueOf(2));           
}
System.out.println(step);
    }
}



