Квадратный корень

Входные данные
Дано число A, длина числа не превышает 250 знаков.

Выходные данные
Выведите такое наибольшее целое число X, что X2≤A.

Sample Input:
8

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 62 учащихся
Из всех попыток 16% верных


# ruby
def largest_square_root(input_value)
  # Преобразуем A в целое число
  integer_value = input_value.to_i
  
  # Определяем границы для бинарного поиска
  left_boundary, right_boundary = 0, integer_value
  
  while left_boundary <= right_boundary
    mid_point = (left_boundary + right_boundary) / 2
    if mid_point * mid_point <= integer_value
      left_boundary = mid_point + 1
    else
      right_boundary = mid_point - 1
    end
  end
  
  return right_boundary
end

# Пример использования
input_value = gets.chomp
result = largest_square_root(input_value)
puts result



# python
import math
print(math.isqrt(int(input())))


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
BigInteger n=new BigInteger(v.next());
BigInteger prov=n.sqrt();
System.out.println(prov);

    }
}
