Умножение на длинное

Напишите программу, которая вычисляет произведение двух целых неотрицательных чисел.

Входные данные
Даны два числа, каждое в отдельной строке, длина каждого не превышает 250 знаков.

Выходные данные
Выведите произведение данных чисел.

Sample Input:
2
9

Sample Output:
18

Напишите программу. Тестируется через stdin → stdout
Верно решили 120 учащихся
Из всех попыток 90% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a*b


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
BigInteger chisl1=new BigInteger(v.next());
BigInteger chisl2=new BigInteger(v.next());
System.out.println(chisl1.multiply(chisl2));
    }
}

