Сравнение чисел

Напишите программу, которая сравнит два целых неотрицательных числа и выведет результат сравнения

Входные данные
Даны два целых неотрицательных числа, в записи каждого не более 200 цифр.

Выходные данные
Выведите знак <, если первое число меньше второго, знак >, если первое больше второго или знак =, если числа совпадают.

Sample Input:
5556
5554

Sample Output:
>

Напишите программу. Тестируется через stdin → stdout
Верно решил 121 учащийся
Из всех попыток 65% верных

# ruby
a, b = gets.to_i, gets.to_i
print  a>b ? ">" : (a<b ? "<" : "=")


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        [a, b] = data.toString().split('\n').map(BigInt);
        console.log(a < b ? '<' : a > b ? '>' : '=');
    }
});


# java
import java.util.Scanner;
import java.math.BigInteger;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        
        BigInteger a = new BigInteger(sc.next());
        BigInteger b = new BigInteger(sc.next());
        
        int result = a.compareTo(b);
        
        System.out.println(result == 0 ? '=' : result == 1 ? '>' : '<');
    }
}


# C
#include <stdio.h>
#include <string.h>
#define SIZE 201

int get_correct_num(char *s) {
    fgets(s, SIZE, stdin);
    int len = strlen(s);
    char *e = s + len - 1;
    if(*e == '\n')
        *e = '\0', len--;
    return len;
}

int main() {
    char num1[SIZE], num2[SIZE];
    int len1 = get_correct_num(num1);   
    int len2 = get_correct_num(num2);
    
    if(len1 < len2)
        return puts("<") && 0;
    if(len1 > len2)
        return puts(">") && 0;
    
    char *p1 = num1, *p2 = num2;
    while(*p1 && *p1 == *p2)
        p1++, p2++;
    
    puts(*p1 < *p2 ? "<": 
         *p1 > *p2 ? ">": "=");
    return 0;
}



