Частное от деления на короткое

Напишите программу, вычисляющую частное от деления двух целых неотрицательных чисел.

Входные данные
Дано одно число (длина которого не превышает 250 знаков) и число от 1 до 9999. Каждое число вводится на отдельной строке.

Выходные данные
Выведите частное от деления первого числа на второе.

Sample Input:
7
3

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 112 учащихся
Из всех попыток 92% верных


# ruby
a, b = gets.to_i, gets.to_i
print  a/b


# java
import java.util.Scanner;
import java.math.BigInteger;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
BigInteger a=new BigInteger(v.next());
BigInteger b=new BigInteger(v.next());
System.out.println(a.divide(b));
    }
}

