Состязания - 3

В метании молота состязается n спортcменов. Каждый из них сделал mбросков. Побеждает спортсмен, у которого максимален наилучший бросок. Если таких несколько, то из них побеждает тот, у которого наилучшая сумма результатов по всем попыткам. Если и таких несколько, победителем считается спортсмен с минимальным номером. Определите номер победителя соревнований.

Входные данные
Программа получает на вход два числа n и m, являющиеся числом строк и столбцов в массиве. Далее во входном потоке идет n строк по m чисел, являющихся элементами массива.

Выходные данные
Программа должна вывести одно число - номер победителя соревнований. Не забудьте, что  строки  (спортсмены) нумеруются с 0.

Sample Input:
3 3
1 2 7
1 3 5
4 1 6

Sample Output:
0

Напишите программу. Тестируется через stdin → stdout
Верно решил 291 учащийся
Из всех попыток 47% верных


# ruby
n,m = gets.chomp.split(' ').map { |j| j.to_i }
a = []
max, sum, num_row, num_col = 0, 0, 0, 0

0.upto(n-1) do |x|   
    a.push(gets.chomp.split(' ').map { |j| j.to_i }) 
end

0.upto(n-1) do |x|
    max_try = a[x].max
    if max < max_try or (max == max_try && a[x].sum > sum)
        max = max_try
        num_row = x
        num_col = a[x].index(max)
        sum = a[x].sum      
    end    
end

print num_row


# python
n, m = map(int, input().split())
mas = [list(map(int, input().split())) for _ in range(n)]
win = max(mas, key=lambda s: (max(s), sum(s), -mas.index(s)))
print(mas.index(win))


# JS
let arr = require('fs').readFileSync(0, 'utf8').split('\n').slice(1)

arr = arr.map(function (row) {
    return row.split(' ').map(Number)
})

let maxInRow = arr.map(function (row) {
    return Math.max(...row)
})

let bestResult = Math.max(...maxInRow)

let bestPlayers = arr.filter(function (player) {
    return player.includes(bestResult)
})

let sumOfResults = bestPlayers.map(function (row) {
    return row.reduce(function(sum, elem) {
        return sum + elem;
    }, 0);
})

let maxSumOfResults = Math.max(...sumOfResults)

let bestResultsIndex = sumOfResults.indexOf(maxSumOfResults)
let bestPlayer = bestPlayers[bestResultsIndex]
let bestPlayerIndex = arr.indexOf(bestPlayer)

console.log(bestPlayerIndex)


# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        int[] nm = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
        int n = nm[0];
        int m = nm[1];
        int[,] arr = new int[n, m];
        for (int i = 0; i < n; i++)
        {
            int[] tmp = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
            for (int j = 0; j < m; j++)
            {
                arr[i, j] = tmp[j];
            }
        }

        int[] temp=new int[m];
        int index = 0;
        int max=0;
        int sum=0;
        for (int i=0;i<n;i++) 
        {
            for (int j = 0; j < m; j++)
            {
                temp[j] = arr[i, j];
            }
            if (temp.Max() > max)
            {
                index = i;
                max = temp.Max();
                sum = temp.Sum();
            }
            else if (temp.Max() == max && temp.Sum() > sum)
            {
                index = i;
                sum=temp.Sum();
            }            
        }
        Console.WriteLine(index);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
int n=v.nextInt(),m=v.nextInt(),max=0,Imax=0;
int vas[][]=new int [n][m];
int sum[]=new int[n];       
for(int i=0,chet=0;i<n;i++){
    for(int j=0;j<m;j++){
    vas[i][j]=v.nextInt();
    chet+=vas[i][j];
    if(max<vas[i][j]){
        max=vas[i][j];
        Imax=i;}}
sum[i]=chet;
chet=0;}
int sumI=sum[Imax];        
for(int i=0;i<n;i++){
    for(int j=0;j<m;j++){
        if(max==vas[i][j]&&sumI<sum[i]){sumI=sum[i];Imax=i;}}}
System.out.println(Imax);        
    }
}




