Состязания

В метании молота состязается n спортcменов. Каждый из них сделал mбросков. Победителем считается тот спортсмен, у которого сумма результатов по всем броскам максимальна. 
Если перенумеровать спортсменов числами от 0 до n-1, а попытки каждого из них – от 0 до m-1, то на вход программа получает массив A[n][m], состоящий из неотрицательных целых чисел. Программа должна определить максимальную сумму чисел в одной строке и вывести на экран эту сумму и номер строки, для которой достигается эта сумма.

Входные данные
Программа получает на вход два числа n и m, являющиеся числом строк и столбцов в массиве. Далее во входном потоке идет n строк по m чисел, являющихся элементами массива.

Выходные данные
Программа должна вывести  2 числа: сумму и номер строки, для которой эта сумма достигается. Если таких строк несколько, то выводится номер наименьшей из них. Не забудьте, что нумерация строк (спортсменов) начинается с 0.

Sample Input:
2 2
5 4
3 5

Sample Output:
9
0

Напишите программу. Тестируется через stdin → stdout
Верно решили 364 учащихся
Из всех попыток 53% верных



# ruby
n,m = gets.chomp.split(' ').map { |j| j.to_i }
a = []
max, row_max = 0, 0

0.upto(n-1) do |x|   
    a.push(gets.chomp.split(' ').map { |j| j.to_i }) 
end

0.upto(n-1) do |x|
    sum = a[x].sum
    if max < sum
        max = sum
        row_max = x
    end
end

puts max, row_max 


# python
print(*max([(sum(map(int, input().split())), i) for i in range(int(input().split()[0]))], key=lambda x: x[0]), sep='\n')


# JS
let arr = require('fs').readFileSync(0, 'utf8').split('\n').slice(1)

arr = arr.map(function (row) {
    return row.split(' ').map(Number)
})

let sums = arr.map(function (row) {
    return row.reduce(function(sum, elem) {
        return sum + elem;
    }, 0);
})

let maxSum =  Math.max(...sums)

let maxIndex = sums.indexOf(maxSum)

console.log(maxSum)
console.log(maxIndex)


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        string[] s = Console.ReadLine().Split();
        int n = Convert.ToInt32(s[0]);
        int m = Convert.ToInt32(s[1]);
        int[,] a = new int[n, m];
        for (int i = 0; i < n; i++)
        {
            string[] v = Console.ReadLine().Split();
            for (int j = 0; j < m; j++)
            {
                a[i, j] = Convert.ToInt32(v[j]);
            }
        }

        int max = 0;
        int number = 0;
        
        for (int i = 0; i < n; i++)
        {
            int sum = 0;
            for (int j = 0; j < m; j++)
            {
                sum += a[i, j];
            }

            if (sum > max)
            {
                max = sum;
                number = i;
            }
        }
        Console.WriteLine(max);
        Console.WriteLine(number);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
int n=v.nextInt(),m=v.nextInt();
int [][]vas=new int[n][m];int sum=0,stroka=0;
for(int i=0,chet=0;i<n;i++){
    for(int j=0;j<m;j++){
vas[i][j]=v.nextInt();
chet+=vas[i][j];}
if(sum<chet){sum=chet;stroka=i;}
chet=0;}
System.out.println(sum+"\n"+stroka);        
   
    }
}


# C++
#include <iostream>

int main() {
    // put your code here
    size_t sizeN, sizeM;
    std::cin >> sizeN >> sizeM;
    
    int arr [sizeN][sizeM];
    int max = 0, maxI = 0;
    
    for(size_t i = 0; i < sizeN; ++i)
    {
        int sum = 0;
        for(size_t j = 0; j < sizeM; ++j)
        {
            std::cin >> arr[i][j];
            sum += arr[i][j];
        }
        
        if(max < sum)
        {
            max = sum;
            maxI = i;
        }
    }
    
    std::cout << max << std::endl;
    std::cout << maxI << std::endl;
    return 0;
}


