Переставить два слова

Дана строка, состоящая ровно из двух слов, разделенных пробелом. Переставьте эти слова местами. Результат запишите в строку и выведите получившуюся строку.

При решении этой задачи нельзя пользоваться циклами и инструкцией if.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.

Sample Input:
Hello, world!

Sample Output:
world! Hello,

Напишите программу. Тестируется через stdin → stdout
Верно решили 536 учащихся
Из всех попыток 85% верных


# ruby
a = gets.split
puts a[1].to_s + ' ' +  a[0].to_s


# python
print(*input().split()[::-1])


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        const str = data.toString();
        console.log(str.replace(/(\S*) +(\S*)/i,'$2 $1'));
    }
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        string[] str=Console.ReadLine(). Split();
        Console.WriteLine(str[1]+" "+str[0]);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        String [] arr = new Scanner(System.in).nextLine().split(" ");
        System.out.printf("%s %s", arr[1], arr[0]);
    }
}


# C
#include <stdio.h>
#include <stdlib.h>
#define BUFF_SIZE 64

int main() {
    char word1[BUFF_SIZE];
    char word2[BUFF_SIZE];
    if (scanf("%s %s", word1, word2) != 2) return EXIT_FAILURE;
    printf("%s %s\n", word2, word1);
    return EXIT_SUCCESS;
}


# C++
#include <iostream>

int main() {
    std::string s1, s2;
    std::cin >> s1 >> s2;
    std::cout << s2 << " " << s1 << "\n";
    return 0;
}


