Второе вхождение

Дана строка. Найдите в этой строке второе вхождение буквы f, и выведите индекс этого вхождения. Если буква f в данной строке встречается только один раз, выведите число -1, а если не встречается ни разу, выведите число -2.

При решении этой задачи нельзя использовать метод count.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.

Sample Input 1:
comfort

Sample Output 1:
-1

Sample Input 2:
coffee

Sample Output 2:
3

Напишите программу. Тестируется через stdin → stdout
Верно решили 422 учащихся
Из всех попыток 61% верных


# ruby
s = gets
#s = 'comfort'
#s = 'coffee'
c = 'f'
s1 = s.index(c)
if s1
    s2 = s[s1+1..].index(c)
    if s2
        s2 = s1 + s2 + 1
        puts s2
    else    
        puts -1
    end   
else
    puts -2
end


# python
s = input()
print(s.find('f', s.find('f') + 1) if 'f' in s else -2)


#  JS
let txt = require('fs').readFileSync(0, 'utf8');

console.log((txt.indexOf('f') < 0) ? -2 : txt.replace('f', '*').indexOf('f'));


# C#
using System;

public class SecondOccurrence
{
    public static void Main()
    {
        int index = -2;
        string text = Console.ReadLine();
        
        for (int i = 0; i < text.Length; i++)
        {
            if (text[i] != 'f') continue;
            if (++index == 0) { index = i; break; }
        }
        
        Console.WriteLine(index);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v =new Scanner(System.in);
String gg= v.nextLine(),fina;int per;
per=gg.indexOf('f');
if(per!=-1){fina=gg.substring(per+1);
            per=fina.indexOf('f');
            System.out.println(per==-1?-1:per+gg.length()-fina.length());}
else{System.out.println(-2);}        // put your code here
    }
}


# C
#include <stdio.h>

int main() {
    int i = -1, res = -2;
    char c, sym = 'f';
    while((scanf("%c", &c) == 1)) {
        i++;
        if (c == sym) {
            if (++res) continue;
            res = i;
            break;
        }
    }
    printf("%d", res);
    return 0;
}


# C++
#include <iostream>

int main() {
    std::string s, to_find = "f";
    std::cin >> s;
    int n1 = s.find(to_find);
    int n2 = s.find(to_find, n1 + 1);
    if (n2 != -1) std::cout << n2 << "\n";
    else std::cout << (n1 == -1) * -1 - 1 << "\n";
    return 0;
}


