Первое и последнее вхождение

Дана строка. Если в этой строке буква f встречается только один раз, выведите её индекс. Если она встречается два и более раз, выведите индекс её первого и последнего появления. Если буква f в данной строке не встречается, ничего не выводите.

При решении этой задачи нельзя использовать метод count и циклы.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.

Sample Input 1:
comfort

Sample Output 1:
3

Sample Input 2:
office

Sample Output 2:
1 2

Напишите программу. Тестируется через stdin → stdout
Верно решил 451 учащийся
Из всех попыток 50% верных



# ruby
s = gets
#s = 'comort'
#s = 'office'
c = 'f'
s1 = s.index(c)
if s1
    s2 = s.reverse.index(c)
    s2 = s.size - 1 - s2 
        
    if s1 != s2 
        print "#{s1} #{s2}"
    else    
        print "#{s1}"
    end   
end    


# python
s = input()
f1, f2 = s.find('f'), s.rfind('f')
if f1 == f2 != -1:
    print(f1)
elif f1 != f2 and f2 != -1:
    print(f1, f2)


# JS
const txt = require('fs').readFileSync(0, 'utf8');

let first_f = txt.indexOf('f');

if (first_f >= 0) {
    let last_f = txt.lastIndexOf('f');
    console.log((first_f == last_f) ? first_f : `${first_f} ${last_f}`);
}


# C#
using System;

public class MainClass
{
    public static void Main()
    {
       string str=Console.ReadLine();
       int indexStart=str.IndexOf('f');
       int indexEnd=str.LastIndexOf('f');
       if(indexStart!=-1 && indexEnd!=-1)
       Console.WriteLine(indexStart==indexEnd?indexStart:$"{indexStart} {indexEnd}");
    }
} 


# java
import java.util.Scanner;
public class Main
{
  /**

   */
  public static void main(String[] args) {
    Scanner sc = new Scanner(System.in);
    String s = sc.nextLine();
    if (s.contains("f")) {
      if (s.indexOf("f") == s.lastIndexOf("f")) System.out.println(s.indexOf('f'));
      else System.out.println(s.indexOf('f') + " " + s.lastIndexOf('f'));
    }
  }
}


# C
#include <stdio.h>
#include <string.h>

int main(int argc, char **argv)
{
    char s[20];
    char c = 'f';
    char *ps = s;

    scanf("%s", s);

    char *first = strchr(s, (int)c);
    char *last = strrchr(s, (int)c);

    /* ptrdiff_t ? */

    !first && !last ?: (first == last ? printf("%d\n", first - ps) : printf("%d %d\n", first - ps, last - ps));

    return 0;
}


# C++
#include <iostream>

int main() {
    std::string s, to_find = "f";
    std::cin >> s;
    int n1 = s.find(to_find), n2 = s.rfind(to_find);
    if (n1 != n2) std::cout << n1 << " " << n2 << "\n";
    else if (n1 != -1) std::cout << n1 << "\n";
    return 0;
}
