Две половинки

Дана строка. Разрежьте ее на две равные части (если длина строки — четная, а если длина строки нечетная, то длина первой части должна быть на один символ больше). Переставьте эти две части местами, результат запишите в новую строку и выведите на экран.

При решении этой задачи нельзя пользоваться инструкцией if.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.

Sample Input 1:
Hi

Sample Output 1:
iH

Sample Input 2:
Hello

Sample Output 2:
loHel

Напишите программу. Тестируется через stdin → stdout
Верно решили 489 учащихся
Из всех попыток 70% верных


# ruby
s = gets
#s = 'Hello'
s1 = s[0...(s.size+1)/2.to_i]
s2 = s[(s.size+1)/2.to_i..]    
puts s2 + s1


# python
s = input()
n = int(len(s) / 2 + 0.5)
print(f'{s[n:]}{s[:n]}')


# JS 
let s = require('fs').readFileSync(0, 'utf8');
let center = (s.length+1) / 2;
console.log(s.slice(center) + s.slice(0, center));


# C#
using System;

public class MainClass
{
    public static void Main()
    {
       string str=Console.ReadLine();
       string part2=(str[0..((int)Math.Ceiling((double)str.Length/2))]);
       string part1=(str[((int)Math.Ceiling((double)str.Length/2))..^0]);
       Console.WriteLine(part1+part2);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        String str = new Scanner(System.in).nextLine();
        System.out.print(str.substring(   (str.length() + 1)/2) + 
                         str.substring(0, (str.length() + 1)/2));
    }
}

# C
#include <stdio.h>
#include <string.h>

int main() {
    char str[1024];
    fgets(str, 1024, stdin);
    
    int len = strlen(str);
    for (int i = (len + 1) / 2; i < len; i++) printf("%c", str[i]);
    for (int i = 0; i < (len + 1) / 2; i++) printf("%c", str[i]);
    return 0;
}


# C++
#include <iostream>

int main() {
    std::string s, res = "";
    std::cin >> s;
    int n = (s.size() + 1) / 2;
    for (int i = n; i < s.size(); i++) res += s[i];
    for (int i = 0; i < n; i++) res += s[i];
    std::cout << res << "\n";
    return 0;
}


