Делаем срезы

Выполните разбор строки, согласно приведенным правилам.

Входные данные
Дана строка.

Выходные данные
Сначала выведите третий символ этой строки.
Во второй строке выведите предпоследний символ этой строки.
В третьей строке выведите первые пять символов этой строки.
В четвертой строке выведите всю строку, кроме последних двух символов.
В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
В седьмой строке выведите все символы в обратном порядке.
В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
В девятой строке выведите длину данной строки.

Sample Input:
Abrakadabra

Sample Output:
r
r
Abrak
Abrakadab
Arkdba
baaar
arbadakarbA
abdkrA
11

Напишите программу. Тестируется через stdin → stdout
Верно решили 518 учащихся
Из всех попыток 63% верных



# ruby
s = gets
#s = 'Abrakadabra'

string5 = ''
0.upto(s.size-1) do |i|
    if i%2 == 0
        string5 += s[i]
    end            
end

string6 = ''
0.upto(s.size-1) do |i|
    if i%2 != 0
        string6 += s[i]
    end            
end

string8 = ''
sr = s.reverse
0.upto(sr.size-1) do |i|
    if i%2 == 0
        string8 += sr[i]
    end            
end

puts s[2],s[-2],s[0..4],s[0..-3],string5,string6,s.reverse,string8,s.size 


# python
s = input()
print(f'''{s[2]}
{s[-2]}
{s[:5]}
{s[:-2]}
{s[::2]}
{s[1::2]}
{s[::-1]}
{s[-1::-2]}
{len(s)}''')


# JS
let s = require('fs').readFileSync(0, 'utf8');

console.log(s[2]);
console.log(s[s.length - 2]);
console.log(s.slice(0, 5));
console.log(s.slice(0, s.length - 2));
console.log(s.split('').filter((_, index) => !(index&1)).join(''));
console.log(s.split('').filter((_, index) => index&1).join(''));
console.log(s.split('').reverse().join(''));
console.log(s.split('').reverse().filter((_, index) => !(index&1)).join(''));
console.log(s.length);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        string str=Console.ReadLine();
        Console.WriteLine(str[2]);
        Console.WriteLine(str[^2]);
        Console.WriteLine(str[..5]);
        Console.WriteLine(str[..^2]);
        for(int i=0;i<str.Length;i++)
        {
            if(i%2==0)
            Console.Write(str[i]);                        
        }
            Console.WriteLine();
        for(int i=0;i<str.Length;i++)
        {
            if(i%2!=0)
            Console.Write(str[i]);  
        }  
        Console. WriteLine();                    
        for(int i=str.Length-1;i>=0;i--)
        {
            Console.Write(str[i]);            
        }
        Console.WriteLine();
        for(int i=str.Length-1;i>=0;i--)
        {
            Console.Write(str[i]);
            i--;
        }
        Console.WriteLine();
        Console.WriteLine(str.Length);
                        
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        String str = new Scanner(System.in).nextLine();
        
/* 1 */ System.out.println(str.charAt(2));                     
/* 2 */ System.out.println(str.charAt(str.length() - 2));      
/* 3 */ System.out.println(str.substring(0, 5));               
/* 4 */ System.out.println(str.substring(0, str.length() - 2)); 
/* 5 */ for (int i = 0; i < str.length(); i += 2)
/* 5 */     System.out.print(str.charAt(i));
/* 5 */ System.out.println();
/* 6 */ for (int i = 1; i < str.length(); i += 2)
/* 6 */     System.out.print(str.charAt(i));
/* 6 */ System.out.println();
/* 7 */ System.out.println(new StringBuilder(str).reverse().toString());
/* 8 */ str = new StringBuilder(str).reverse().toString();
/* 8 */ for (int i = 0; i < str.length(); i += 2)
/* 8 */     System.out.print(str.charAt(i));        
/* 8 */ System.out.println();
/* 9 */ System.out.print(str.length());
    }
}


# C
#include <stdio.h>
#include <string.h>

int main() {
    char str[1024];
    fgets(str, 1024, stdin);
    
    int len = strlen(str);
    printf("%c\n", str[2]);
    printf("%c\n", str[len - 2]);
    for (int i = 0; i < 5; i++) printf("%c", str[i]);
    printf("\n");
    for (int i = 0; i < len - 2; i++) printf("%c", str[i]);
    printf("\n");
    for (int i = 0; i < len; i++)
        if (i % 2 == 0) printf("%c", str[i]);
    printf("\n");
    for (int i = 0; i < len; i++)
        if (i % 2 != 0) printf("%c", str[i]);
    printf("\n");
    for (int i = len - 1; i > -1; i--) printf("%c", str[i]);
    printf("\n");
    for (int i = len - 1; i > -1; i -= 2) printf("%c", str[i]);
    printf("\n");
    printf("%d", len);
    return 0;
}


# C++
#include <iostream>

int main() {
    std::string s;
    std::cin >> s;
    
    std::cout << s[2] << "\n"; // третий символ этой строки
    
    std::cout << s[s.size() - 2] << "\n"; // предпоследний символ этой строки
    
    for (int i = 0; i < 5; i++)
        std::cout << s[i]; // первые пять символов этой строки
    std::cout << "\n";
    
    for (int i = 0; i < s.size() - 2; i++)
        std::cout << s[i]; // вся строка, кроме последних двух символов
    std::cout << "\n";
    
    for (int i = 0; i < s.size(); i += 2)
        std::cout << s[i]; // все символы с четными индексами
    std::cout << "\n";
    
    for (int i = 1; i < s.size(); i += 2)
        std::cout << s[i]; // все символы с нечетными индексами
    std::cout << "\n";
    
    for (int i = s.size() - 1; i >= 0; i--)
        std::cout << s[i]; // все символы в обратном порядке
    std::cout << "\n";
    
    for (int i = s.size() - 1; i >= 0; i -= 2)
        std::cout << s[i]; // все символы строки через один в обратном порядке
    std::cout << "\n";
    
    std::cout << s.size() << "\n"; // длина данной строки
    return 0;
}



