Вставка символов

Дана строка. Получите новую строку, вставив между двумя символами исходной строки символ *. Выведите полученную строку.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.

Sample Input:
Python

Sample Output:
P*y*t*h*o*n

Напишите программу. Тестируется через stdin → stdout
Верно решили 426 учащихся
Из всех попыток 89% верных



# ruby
s = gets
s_out = ''
#s = 'Python'
#s = 'P*y*t*h*o*n'
s.each_char do |c|
    s_out += c + '*'
end    

puts s_out[0...-1]


# python
print('*'.join(input()))


# JS
let s = require('fs').readFileSync(0, 'utf8').split('').join('*');

console.log(s);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        string str=Console.ReadLine();
        for(int i=0;i<str.Length-1;i++)
        {        
        Console.Write(str[i]);
        Console.Write('*');
        }
        Console.Write(str[str.Length-1]);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
String qq=v.nextLine();
for(int i=0;i<qq.length();i++){
if(i==qq.length()-1){System.out.print(qq.charAt(i));}    
else{System.out.print(qq.charAt(i)+"*");}}    // put your code here
    }
}


# C++
#include <iostream>

int main() {
    std::string s, res = "";
    std::cin >> s;
    if (s.size() > 1) res += s[0];
    for (int i = 1; i < s.size(); i++) {
        res += '*';
        res += s[i];
    }
    std::cout << res << "\n";
    return 0;
}






