Из шестнадцатиричной в двоичную

Напишите программу, переводящую число из шестнадцатеричной системы счисления в двоичную.

Входные данные
Программа получает на вход строку, состоящую из цифр 0, ..., 9 и букв A, ..., F, являющуюся записью некоторого 16-ричного целого числа. Длина строки не превосходит 50 символов, первый символ в строке не равен 0. Необходимо вывести запись этого числа в двоичном виде без лидирующих нулей. 

Выходные данные
Выведите результат перевода.

Sample Input:
14

Sample Output:
10100

Напишите программу. Тестируется через stdin → stdout
Верно решили 139 учащихся
Из всех попыток 29% верных

# ruby
print gets.hex.to_s(2)

# python
print(f'{int(input(), base=16):b}')


# java
import java.util.Scanner;
import java.util.ArrayList;
class Main {
    public static void main(String[] args) {        
Scanner v =new Scanner(System.in);
String []str=v.nextLine().split("");
int []vas=new int [str.length];
ArrayList <Integer> vasList=new ArrayList<>();
ArrayList <String> otvet=new ArrayList<>();        
for(int i=0,br=0;i<str.length;i++){
    if(str[i].equals("A")){br=10;}
    else if(str[i].equals("B")){br=11;}
    else if(str[i].equals("C")){br=12;}
    else if(str[i].equals("D")){br=13;}
    else if(str[i].equals("E")){br=14;}
    else if(str[i].equals("F")){br=15;}
    else {br=Integer.parseInt(str[i]);}
    vas[i]=br;
}                
      
for(int i=0;i<vas.length;i++){
    for(int j=vas[i],chet=0;;){
        chet++;
        if(j==1){
            vasList.add(1);
            if(chet<4&&i!=0){
                for(int k=chet;k<4;k++){
                    vasList.add(0);
                }
            }
            for(int q=vasList.size()-1;q>=0;q--){
                otvet.add(""+vasList.remove(q));
            }              
            break;
        }
        vasList.add(j%2);
        j=j/2;
    }
}       
System.out.println(String.join("", otvet));
    }
}


# C++
#include <iostream>
#include <string>
#include <map>
using namespace std;

int main()
{
	string hex_number, bin_number(""), S3;
	map<char, string> hex_bin{
		{'0',"0000"},{'1',"0001"},{'2',"0010"},{'3',"0011"},{'4',"0100"},{'5',"0101"},{'6',"0110"},{'7',"0111"},
		{'8',"1000"},{'9',"1001"},{'A',"1010"},{'B',"1011"},{'C',"1100"},{'D',"1101"},{'E',"1110"},{'F',"1111"} };
	cin >> hex_number;
	if (hex_number == "0") bin_number = "0";
	else
	{
		// Перевод в двоичную систему счисления
		for (int i = 0; i < hex_number.length(); i++)
		{
			bin_number += hex_bin[hex_number[i]];
		}
        // Удаление ведущих нулей
		while (bin_number[0]=='0') bin_number.erase(bin_number.begin());
    }
    cout << bin_number << endl;
}



# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let n = i128::from_str_radix(&buf, 16).unwrap();
    println!("{:b}", n);
}

