Домашнее задание

Маленькому мальчику Ване на кружке по системам счисления задали следующую задачу: перевести число X в системе счисления s1 в систему счисления s2. Недолго думая, он позвал на помощь своего лучшего друга Петю, который славился тем, что замечательно умел считать до 10 на пальцах. После нескольких бессонных ночей ребята общими усилиями справились с задачей.

Однако, на следующем занятии Ване задали похожую задачу, где X, к сожалению, превышало 10. Тогда ребята решили обратиться в Летнюю Компьютерную Школу с просьбой написать универсальную программу, которая решает задачу для любых X, s1 и s2. Ваша цель – выполнить просьбу Вани и Пети.

Входные данные

Во входных данных вашей программе дается 3 числа: исходное число X, основания систем счисления s1 и s2 (2  ≤  s1, s2  ≤  10). Число X в десятичной системе счисления не превышает 2 × 109.

Выходные данные

В выходных данных должно находиться одно число, равное числу X в системе счисления s2, или -1, если входные данные некорректны.

Sample Input 1:

101 2 10
Sample Output 1:

5
Sample Input 2:

200 2 10
Sample Output 2:

-1
Напишите программу. Тестируется через stdin → stdout
Верно решили 50 учащихся
Из всех попыток 39% верных

# ruby
x, base1, base2 = gets.chomp.split.map(&:to_i)
x = x.to_s
begin
  converted_value = Integer(x, base1)
rescue ArgumentError
  puts -1
else
  if base2 == 10
    puts converted_value
  else
    result_string = " "
    digit_characters = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ"
    is_negative = 0
    if converted_value < 0
      converted_value = -converted_value
      is_negative = 1
    end
    while converted_value > 0
      result_string = digit_characters[converted_value % base2] + result_string
      converted_value = converted_value / base2
    end
    if is_negative == 1
      result_string = "-" + result_string
    end
    puts result_string.strip
  end
end


# python
def convert(num, from_base=10, to_base=10):
    digs = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'
    res = []
    try:
        num = int(num, from_base)
    except ValueError:
        return -1
    while num:      
        res.append(digs[num % to_base])
        num //= to_base 
    return(''.join(reversed(res)))

n, s1, s2 = input().split()
print(convert(n, int(s1), int(s2)))


# java
import java.util.Scanner;
import java.util.List;
import java.util.ArrayList;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        ArrayList mylist=new ArrayList();
        ArrayList mylist2=new ArrayList();
        String a=myscan.next();int n=myscan.nextInt(),k=myscan.nextInt();
        int[] mas=new int[a.length()];
        for(int j=0;j<a.length();j++){
            if(a.substring(j,j+1).matches("[A-Z]")==true)
               mas[j]=a.substring(j,j+1).charAt(0)-55;
        else mas[j]=Integer.parseInt(a.substring(j,j+1));}
        for(int j=0;j<mas.length;j++)
        if(n<=mas[j]){System.out.println(-1);return;}
        if(n==k){System.out.println(a);return;}
   int z=a.indexOf(".");
        String a2="";
        long sum=0;double sum2=0;
        if(z!=-1){
        a2=a.substring(z+1);
        a=a.substring(0,z);}
        if(n!=10){
        for(int i=0;i<a.length();i++){
       if(a.substring(i,i+1).matches("[A-Z]")==true)
       sum+=((long)a.substring(i,i+1).charAt(0)-55)*(long)Math.pow(n,a.length()-1-i);
       else sum+=Integer.valueOf(a.substring(i,i+1))*(long)Math.pow(n,a.length()-1-i);}
        if(a2.equals("")==false){
        for(int i=0,t=-1;i<a2.length();i++,t--){
        if(a2.substring(i,i+1).matches("[A-Z]")==true)
       sum2+=((int)a2.substring(i,i+1).charAt(0)-55)*Math.pow(n,t);
       else sum2+=Integer.valueOf(a2.substring(i,i+1))*Math.pow(n,t);    
        }}}
        else if(a2.equals("")==false){sum=Long.valueOf(a);sum2=Integer.valueOf(a2);}
        else{sum=Long.valueOf(a);}
        mylist.add(0,sum%k);
        while(sum/k!=0){sum=sum/k;mylist.add(0,sum%k);}
        if(a2.equals("")==false){mylist.add(".");
        double r=sum2;
        while(r>1)r/=10;
        int h=0;
        while(r!=(int)r&&h<11){r*=k;mylist.add((int)r);r-=(int)r;h++;}}
        for(int i=0;i<mylist.size();i++){
            char l='A';
            if(mylist.get(i).equals(".")==false&&(long)mylist.get(i)>9)mylist.set(i,(char)(l+((long)mylist.get(i)-10)));
        System.out.print(mylist.get(i));}
    }
}


# C++
#include <iostream>
#include <string>
#include <vector>
using namespace std;

int main()
{
    int K, T; // Основание систем счисления
    string bin_number; // Исходное число в виде строки
    cin >> bin_number >> K >> T;
    // Шаг 1. Перевод в десятичную систему счисления
    unsigned long long result(0), // результат перевода
                    Stepen(1);    // степени 
    int d; // очередная цифра числа 
    char s; // Очередная цифра числа в k-ричной системе счисления
    bool flag = true;
    for(int i = bin_number.length()-1; i >=0 ; i--)
    {
        // Простой перевод цифры из символа в число как разность кодов
        s = bin_number[i];
        if (s >= '0' and s <= '9') d = s - '0';
        else d = 10 + s - 'A';
        if (d >= K)
        {
            flag = false;
            break;
        }
        result += d * Stepen;
        Stepen *= K;
    }
    if (!flag) cout << -1 << endl;
    else
    {
        // Шаг 2. Перевод из десятичной системы счисления в T-ричную
        vector<char> V; // Массив цифр числа
        if (result == 0) V.push_back('0');
        while (result)
        {
            // Добавляем очередную цифру в вектор
            d = result % T;
            if (d<10) s = '0' + d;
            else s = 'A' + d - 10;
            V.push_back(s);
            result /= T;
        }
        // Выводим вектор цифр в обратном порядке
        for(auto p = V.rbegin(); p!=V.rend(); p++)
        {
            cout << *p;
        }
        cout << endl;
    }
}