Вставить элемент

Дан список целых чисел, число k и значение C. Необходимо вставить в список на позицию с индексом k элемент, равный C, сдвинув все элементы, имевшие индекс не менее k, вправо.

Поскольку при этом количество элементов в списке увеличивается, после считывания списка в его конец нужно будет добавить новый элемент, используя метод append.

Вставку необходимо осуществлять уже в считанном списке, не делая этого при выводе и не создавая дополнительного списка.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке. На второй строке вводятся числа k и C.

Выходные данные
Выведите ответ на задачу.

Sample Input:
7 6 5 4 3 2 1
2 0

Sample Output:
7 6 0 5 4 3 2 1

Напишите программу. Тестируется через stdin → stdout
Верно решили 418 учащихся
Из всех попыток 74% верных


# ruby
a = gets.chomp.split().map{|j| j.to_i}
k,c = gets.chomp.split().map{|j| j.to_i}
#a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#k,c=10,23
a.push(c)
a = a[0...k] + a[-1..] + a[k...-1]   
puts a.join(" ")


# python
lst = list(map(int, input().split()))
lst.insert(*map(int, input().split()))
print(*lst)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let [k, s] = str[1].split(' ');
    k = +k;
    str = str[0].split(' ');
    
    str.push(0);
    for (let i=str.length-1; i>k; i--) str[i]=str[i-1];
    str[k] = s;
    
    let result = '';
    for (let i=0; i<str.length; i++) result = result+str[i]+' ';
    console.log(result);
  });


# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        var arr = Array.ConvertAll(Console.ReadLine().Split(), int.Parse).ToList();
        var input = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
        int k = input[0];
        int C = input[1];
        arr.Insert(k, C);
        foreach (int i in arr)
        Console.Write(i + " ");
    }
}


# java
import java.util.Scanner;
import java.util.ArrayList;
import java.util.Collections;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner (System.in);
String[] vv=v.nextLine().split(" ");
ArrayList<String> vasList=new ArrayList();
Collections.addAll(vasList,vv);
vasList.add(v.nextInt(),v.next());
System.out.println(String.join(" ",vasList));        
    }
}



# C++
#include <string>
#include <iostream>
#include <sstream>
#include <iterator>
#include <vector>
#include <algorithm>

int main() {
    // put your code here
    std::string line;
    getline(std::cin, line);
    std::istringstream this_line(line);
    std::istream_iterator<int> begin(this_line), end;
    std::vector<int> arr(begin, end);
    
    int index, num;
    std::cin >> index >> num;
    
    arr.insert(arr.begin() + index, num);
    
    for (auto &&ptr : arr)
        std::cout << ptr << " ";
    return 0;
}