Удалить элемент

Дан список из чисел и индекс элемента в списке k. Удалите из списка элемент с индексом k, сдвинув влево все элементы, стоящие правее элемента с индексом k.

Входные данные
Программа получает на вход список, затем число k. Программа сдвигает все элементы, а после этого удаляет последний элемент списка при помощи метода pop().

Программа должна осуществлять сдвиг непосредственно в списке, а не делать это при выводе элементов. Также нельзя использовать дополнительный список.

Выходные данные
Выведите ответ на задачу.

Sample Input:
7 6 5 4 3 2 1
2

Sample Output:
7 6 4 3 2 1

Напишите программу. Тестируется через stdin → stdout
Верно решили 438 учащихся
Из всех попыток 79% верных


# ruby
a = gets.chomp.split().map{|j| j.to_i}
k = gets.to_i
#a = [7, 6, 5, 4, 3, 2, 1]
#k=6
if k<a.size-1
    a = a[0...k] + a[k+1..]
else
    a = a[0...k]  
end    
puts a.join(" ")


# python
lst = list(map(int, input().split()))
del lst[int(input())]
print(*lst)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let k = +str[1];
    str = str[0].split(' ');
    for (let i=k; i<str.length-1; i++) str[i]=str[i+1];
    str.pop();
    let result = '';
    for (let i=0; i<str.length; i++) result = result+str[i]+' ';
    console.log(result);
  });


# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        var arr = Console.ReadLine().Split().ToList();
        int k = int.Parse(Console.ReadLine());
        arr.RemoveAt(k);
            foreach (string i in arr)
            Console.Write(i + " ");
    }
}


# java
import java.util.*;
import java.util.stream.Collectors;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        List<Integer> list = Arrays.stream(scanner.nextLine().split(" "))
                .mapToInt(Integer::parseInt)
                .boxed()
                .collect(Collectors.toList());

        list.remove(scanner.nextInt());

        list.forEach(e -> System.out.print(e + " "));
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>

void input(int64_t** arr, size_t* N, size_t* K);
void output(int64_t** arr, size_t N);
void pop_item(int64_t** arr, size_t* N);
void rem_item(int64_t** arr, size_t* N, size_t K);

int main() {
    size_t N = 0, K = 0;
    int64_t* array;
    input(&array, &N, &K);
    rem_item(&array, &N, K);
    output(&array, N);
    if (N) free(array);
    return 0;
}

void rem_item(int64_t** arr, size_t* N, size_t K) {
    for (size_t i = K + 1; i < (*N); i++) (*arr)[i - 1] = (*arr)[i];
    pop_item(&(*arr), &(*N));
}

void pop_item(int64_t** arr, size_t* N) {
    (*N)--;
    (*arr) = realloc((*arr), (*N) * sizeof(int64_t));
}

void output(int64_t** arr, size_t N) {
    for (size_t i = 0; i < N; i++) {
        printf("%"PRId64, (*arr)[i]);
        if (i != N - 1) printf(" ");
    }
}

void input(int64_t** arr, size_t* N, size_t* K) {
    int64_t num;
    while (scanf("%"SCNd64, &num) == 1) {
        (*N)++;
        if ((*N) == 1) (*arr) = malloc(sizeof(int64_t));
        else (*arr) = realloc((*arr), (*N) * sizeof(int64_t));
        (*arr)[(*N) - 1] = num;
    }
    (*K) = (*arr)[(*N) - 1];
    pop_item(&(*arr), &(*N));
}



// put your C++ code here
#include <string>
#include <iostream>
#include <sstream>
#include <iterator>
#include <vector>
#include <algorithm>

int main() {
    // put your code here
    // Быстрее было бы просто через строку,
    std::string line;
    getline(std::cin, line);
    // но используем всё-таки вектор.
    // Для этого воспользуемся потоками
    std::istringstream this_line(line);
    // Создаём итераторы потока
    std::istream_iterator<int> begin(this_line), end;
    // По ним заполняем
    std::vector<int> arr(begin, end);
    
    int index;
    std::cin >> index;
    // Удаляем с автоматическим сдвигом
    // arr.erase(arr.begin() + index);
    
    // Но у нас по заданию "Программа сдвигает все элементы,
    // а после этого удаляет последний элемент списка при помощи метода pop()."
    std::vector <int> :: iterator it = arr.begin() + index;
    std::rotate (it, it + 1, arr.end());
    arr.pop_back();
    
    for (auto &&ptr : arr)
        std::cout << ptr << " ";
    return 0;
}

