Быстрое разложение на множители

Входные данные
Дано натуральное число N, 2 ≤ N ≤ 1018. Известно, что оно является произведением двух простых чисел.

Выходные данные
Выведите простые делители данного числа в порядке неубывания.

Sample Input:
15

Sample Output:
3 5

Напишите программу. Тестируется через stdin → stdout
Верно решили 55 учащихся
Из всех попыток 7% верных

# ruby
def foo(x)
  if x.even?
    [2, x / 2]
  else
    d1 = Math.sqrt(x).to_i
    d1 += 1 if d1.even?
    while d1 > 2
      return [d1, x / d1] if (x % d1).zero?

      d1 -= 2
    end
  end
end

x = gets.to_i
d1, d2 = foo(x)
print(d1, ' ', d2)


# python
from sympy import factorint

n = int(input())
#n = 4
factors = factorint(n)
a = []
for factor in factors:
  i = factors[factor]
  for j in range(i):
    a.append(factor)
a = sorted(a)    
print (*a)   