Шеренга

Петя перешёл в другую школу. На уроке физкультуры ему понадобилось определить своё место в строю. Помогите ему это сделать.

Входные данные
Программа получает на вход невозрастающую последовательность натуральных чисел, означающих рост каждого человека в строю. После этого с новой строки вводится число X – рост Пети. Все числа во входных данных натуральные и не превышают 200.

Выходные данные
Выведите номер, под которым Петя должен встать в строй. Если в строю есть люди с одинаковым ростом, таким же, как у Пети, то он должен встать после них.

Sample Input 1:
165 163 160 160 157 157 155 154
162

Sample Output 1:
3

Sample Input 2:
165 163 160 160 157 157 155 154
160

Sample Output 2:
5

Напишите программу. Тестируется через stdin → stdout
Верно решил 381 учащийся
Из всех попыток 51% верных


# ruby
a = gets.chomp.split().map{|j| j.to_i}
h = gets.to_i
#a=[-7, 4, 11, 15, 18, 23]
cnt = 1
a.sort

a.each do |v|   
    if h > v
        cnt += 1        
    end    
end
puts a.size + 1 - cnt + 1


# python
heights = list(map(int, input().split()))
petr_height = int(input())
print(sum(petr_height <= height for height in heights) + 1)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let Petya = +str[1];
    str = str[0].split(' ');
    let i = 0;
    while (Petya <= +str[i]) i++;
    console.log(++i);
  });


# C#
using System;

public class MainClass
{
    public static void Main()
    {    
        int[] input = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
        int h = int.Parse(Console.ReadLine());
        int pos = 0;  
            
        for(int i = 0; i < input.Length && input[i] >= h; ++i, pos = i){};       
        Console.Write(pos+1);

    }
}


# java
import java.util.*;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int[] arr = Arrays.stream(scanner.nextLine().split(" "))
                .mapToInt(Integer::parseInt)
                .toArray();
        int n = scanner.nextInt();
        System.out.println(Arrays.stream(arr).filter(e -> e >= n).count() + 1);
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>

int main() {
    size_t N = 0;
    int64_t* array;
    int64_t num;
    while (scanf("%"SCNd64, &num) == 1) {
        N++;
        if (N == 1) array = malloc(sizeof(int64_t));
        else array = realloc(array, N * sizeof(int64_t));
        array[N - 1] = num;
    }

    int64_t X = array[N - 1];
    array[N - 1] = 0;

    for (size_t i = 0; i < N; i++)
        if (X > array[i]) {
            printf("%zu", i + 1);
            break;
        }

    if (N) free(array);
    return 0;
}


# C++
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    // put your code here
    std::vector <int> arr;
    
    int temp;
    while(std::cin >> temp)
    {
        arr.push_back(temp);
    }   
    
    //Добавляем Петю
    std::cin >> temp;
    arr.push_back(temp);
      
    std::sort(arr.rbegin(), arr.rend());
    
    //Ставим итератор на позицию Пети
    auto itFind = std::find(arr.rbegin(), arr.rend(), temp);
    
    std::cout << std::distance(itFind, arr.rend()) - 1 << std::endl;
           
    return 0;
}


