Вывести в обратном порядке

Выведите элементы данного списка в обратном порядке, не изменяя сам список.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Напишите программу. Тестируется через stdin → stdout
Верно решили 410 учащихся
Из всех попыток 68% верных


# ruby
a = gets.chomp.split()
print a.reverse.join(" ")


# python
print(*input().split()[::-1])


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        string[] str=Console.ReadLine(). Split();
        for(int i=1;i<str.Length+1;i++)
        Console.Write(str[^i]+" ");
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
String[] vv=new Scanner(System.in).nextLine().split(" ");
for(int i=vv.length-1;i>=0;i--){
System.out.print(vv[i]+" ");}    
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>

int main() {

    size_t n = 0;
    int64_t* array;
    int64_t num;
    while (scanf("%"SCNd64, &num) == 1) {
        n++;
        if (n == 1) array = malloc(sizeof(int64_t));
        else array = realloc(array, n * sizeof(int64_t));
        array[n - 1] = num;
    }

    for (int x, i=0; i<n/2; x=array[i], array[i]=array[n-i-1], array[n-i-1]=x, ++i);
    for (int *p=array; p<array+n; printf("%d ",*p), ++p);
    return 0;
}


# C++ code here
#include <iostream>
#include <vector>

int main() {
    // put your code here
    std::vector <int> arr;
    
    int temp;
    while (std::cin >> temp)
    {
        arr.push_back(temp);
    }
    
    for(auto &&it = arr.rbegin(); it != arr.rend(); ++it)
        std::cout << *it << " ";
    
    return 0;
}




