Количество различных элементов

Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Sample Input:
1 2 2 3 3 3

Sample Output:
3

Напишите программу. Тестируется через stdin → stdout
Верно решили 420 учащихся
Из всех попыток 83% верных


# ruby
a = gets.chomp.split().map{|j| j.to_i}
#a=[-7, 4, 11, 15, 18, 23]
cnt = 1

a.each_cons(2) do |v|   
    if v[0] < v[1]
        cnt += 1        
    end    
end
p cnt 


# python
print(len(set(map(int, input().split()))))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split(' ').map(Number);
    
    const array = str.filter(function(item, pos) {
          return str.indexOf(item) == pos;
      })
      console.log(array.length)
});


# C#
using System;
using System.Collections.Generic;

public class MainClass
{
    public static void Main()
    {
        Console.WriteLine((new HashSet<string>(Console.ReadLine().Split())).Count);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
String[]vv=new Scanner(System.in).nextLine().split(" ");int min=0,chet=1;
for(int i=0;i<vv.length;i++){
int x=Integer.parseInt(vv[i]);    
if(i==0){min=x;}
else if(x>min){min=x;chet++;}}
System.out.println(chet);
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>

int main() {
    size_t N = 0;
    int64_t* array;
    int64_t num;
    while (scanf("%"SCNd64, &num) == 1) {
        N++;
        if (N == 1) array = malloc(sizeof(int64_t));
        else array = realloc(array, N * sizeof(int64_t));
        array[N - 1] = num;
    }

    size_t count = 1;
    for (size_t i = 1; i < N; i++)
        if (array[i] > array[i - 1]) count++;

    printf("%zu", count);
    if (N) free(array);
    return 0;
}


# C++
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    // put your code here
    std::vector <int> arr;
    
    int temp;
    while(std::cin >> temp)
    {
        arr.push_back(temp);
    }   
    
    std::sort(arr.begin(), arr.end());
    
    //Переносим дубли в конец вектора
    //и ставим итератор на последнюю уникальную позицию
    auto it = std::unique(arr.begin(), arr.end());
    //Удаляем дубли
    arr.resize(std::distance(arr.begin(), it));
    //Выводим размер вектора
    std::cout << arr.size() << std::endl;
    return 0;
}



