Наибольший элемент

Дан список чисел. Выведите значение наибольшего элемента в списке, а затем индекс этого элемента в списке. Если наибольших элементов несколько, выведите индекс первого из них.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Sample Input:
1 2 3 2 1

Sample Output:
3 2

Напишите программу. Тестируется через stdin → stdout
Верно решили 450 учащихся
Из всех попыток 72% верных



# ruby
a = gets.chomp.split().map{|j| j.to_i}

#a = [9, 9]
max = a[0]
ind_max = 0

1.upto(a.size-1) do |i|     
    if a[i] > max
        max = a[i]
        ind_max = i
    end
end

print "#{max} #{ind_max}"


# python
lst = list(map(int, input().split()))
max_num = max(lst)
idx = lst.index(max_num)
print(max_num, idx)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split(' ');
    let a = Math.max(...str).toString();
    console.log(a, str.indexOf(a));
  });

  
# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
      int[] input = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
      int max = input.Max();
      Console.WriteLine($"{max} {Array.IndexOf(input,max)}");
    }
}


# java
import java.util.*;
import java.util.stream.Collectors;

class Main {
    public static void main(String[] args) {
        List<Integer> list = Arrays.stream(new Scanner(System.in).nextLine().split(" "))
                .mapToInt(Integer::parseInt)
                .boxed()
                .collect(Collectors.toList());

        int max = list.stream().mapToInt(Integer::intValue).max().getAsInt();
        System.out.println(max + " " + list.indexOf(max));
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <limits.h>

int main() {
    size_t N = 0;
    int64_t* array;
    int64_t num;
    while (scanf("%"SCNd64, &num) == 1) {
        N++;
        if (N == 1) array = malloc(sizeof(int64_t));
        else array = realloc(array, N * sizeof(int64_t));
        array[N - 1] = num;
    }

    int64_t max = LLONG_MIN;
    size_t imax = 0;
    for (size_t i = 0; i < N; i++)
        if (array[i] > max) {
            max = array[i];
            imax = i;
        }

    printf("%"PRId64" %zu", max, imax);
    if (N) free(array);
    return 0;
}


# C++
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    // put your code here
    std::vector <int> arr;
    
    int temp;
    while(std::cin >> temp)
    {
        arr.push_back(temp);
    }   
    
    //устанавливаем итератор на максимальное значение
    auto max = std::max_element(arr.begin(), arr.end());
    //выводим максимальный элемент и дистанцию от начала вектора
    std::cout << *max << " " << std::distance(arr.begin(), max) << std::endl;
    return 0;
}


