Двоичная запись

Дано натуральное число N. Выведите его представление в двоичном виде в обратном порядке.

Входные данные
Задано единственное число N

Выходные данные
Необходимо вывести требуемое представление числа N.

Sample Input:
6

Sample Output:
011

Напишите программу. Тестируется через stdin → stdout
Верно решили 692 учащихся
Из всех попыток 72% верных


# ruby
puts gets.to_i.to_s(2).reverse


# python
n = int(input())
print(bin(n)[2:][::-1])


# JS
let n = require('fs').readFileSync(0, 'utf8');
console.log((+n).toString(2).split('').reverse().join(''));


# C#
using System;

public class MainClass
{
    public static void Main()
    {
     int n = int.Parse(Console.ReadLine()); 
     while (n > 0) 
        { Console.Write(n % 2); 
        n /= 2; 
        }
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        try (Scanner scanner = new Scanner(System.in)) {
            System.out.println(new StringBuilder(Integer.toBinaryString(scanner.nextInt())).reverse());
        }
    }
}


# C
#include <stdio.h>
int main() {
    int x;
    for (scanf("%d",&x); x; printf("%d",x%2), x/=2);
    return 0;
}


# C++
#include <iostream>

int dec_to_bin(int n) {
    int res = 0, i;
    for (i = 1; i * 2 <= n; i *= 2);
    while (i >= 1) {
        res = res * 10 + n / i;
        n %= i;
        i /= 2;
    }
    return res;
}

int main() {
    int n;
    std::cin >> n;
    n = dec_to_bin(n);
    while (n) {
        std::cout << n % 10;
        n /= 10;
    }
    return 0;
}



