Второй максимум

Последовательность состоит из различных натуральных чисел и завершается числом 0. Определите значение второго по величине элемента в этой последовательности.

Числа, следующие за числом 0, считывать не нужно.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит).

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
7
9
0

Sample Output:
7

Напишите программу. Тестируется через stdin → stdout
Верно решили 733 учащихся
Из всех попыток 52% верных



# ruby
puts ((nums = $stdin.read.split("\n").map(&:to_i))[...(nums.find_index(0))].sort)[-2] 


# python
print(sorted(map(int, iter(input, '0')), reverse=True)[1])


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    let i = 0;
    let [a, b] = [ -1, -1 ];

     while ( +data[i] !== 0) { 
         if ( a < +data[i] ) {
             if ( a > b ) b = a;
             a = +data[i];
         }
         if ( b < +data[i] && +data[i] < a ) b = +data[i];
         i++;
    }

    console.log(b);
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int[] item = new int[3];
        while((item[2] = int.Parse(Console.ReadLine())) != 0)
        {
            item[1] = item[2] > item[0] ? item[0] : item[2]>item[1] ? item[2] : item[1];
            item[0] = item[2]>item[0] ? item[2] : item[0];         
        }
        Console.WriteLine(item[1]);
    }
}


# java
import java.util.Scanner;
import java.util.TreeSet;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);

        TreeSet<Integer> set = new TreeSet<>();

        for (int a = input.nextInt(); a != 0; set.add(a), a = input.nextInt());

        System.out.println(set.lower(set.last()));
    }
}


# C
#include <stdio.h>
int main() {
    int x, mx1, mx2;
    scanf("%d%d",&mx1,&mx2);
    mx1<mx2 ? x=mx1, mx1=mx2, mx2=x : 0;
    while (scanf("%d",&x)==1 && x) {
        x>mx1 ? (mx1>mx2 ? mx2=mx1, mx1=x : (mx1=x)) : x>mx2 ? mx2=x : 0;
    }
    printf("%d\n",mx2);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, max1 = 0, max2 = 0;
    std::cin >> n;
    while (n != 0) {
        if (n > max1) {
            max2 = max1;
            max1 = n;
        } else if (n > max2) {
            max2 = n;
        }
        std::cin >> n;
    }
    std::cout << max2 << "\n";
    return 0;
}