Длина последовательности

Программа получает на вход последовательность целых неотрицательных чисел, каждое число записано в отдельной строке. Последовательность завершается числом 0, при считывании которого программа должна закончить свою работу и вывести количество членов последовательности (не считая завершающего числа 0).

Числа, следующие за числом 0, считывать не нужно.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит).

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
7
9
0
5

Sample Output:
3

Напишите программу. Тестируется через stdin → stdout
Верно решили 547 учащихся
Из всех попыток 80% верных


# ruby
puts (nums = $stdin.read.split("\n").map(&:to_i))[...(nums.find_index(0))].size


# put your python code here
length = 0
for el in iter(input, '0'):
    length += 1
print(length)


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        const strs = data.toString().split('\n');
        console.log(strs.indexOf('0'));
    }
});


# C#
using System;

var count = 0;
while(Console.ReadLine() != "0")
    count++;
Console.Write(count);


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        
    Scanner sc = new Scanner(System.in); // Объявляем  Scanner 
        int count = 0;
        
 
        for (int i=0; sc.nextInt() != 0; i++) {
            count++;
        }
        System.out.print(count);
        
            
           

    }
}


# C
#include <stdio.h>
int main() {
    int x,c=0;
    while (scanf("%d",&x)==1 && x && (++c) || (printf("%d\n",c),0));
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, i = 0;
    std::cin >> n;
    while (n) {
        i++;
        std::cin >> n;
    }
    std::cout << i << "\n";
    return 0;
}



