Количество элементов, равных максимуму

Последовательность состоит из натуральных чисел и завершается числом 0. Всего вводится не более 10000 чисел (не считая завершающего числа 0). Определите, сколько элементов этой последовательности равны ее наибольшему элементу.

Числа, следующие за числом 0, считывать не нужно.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит).

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
3
3
1
0
Sample Output:

2
Напишите программу. Тестируется через stdin → stdout
Верно решили 702 учащихся
Из всех попыток 76% верных


# ruby
puts ((a = (nums = $stdin.read.split("\n").map(&:to_i))[...(nums.find_index(0))].sort)[(a.find_index(a.max))..].size)


# python
qty = mx_value = 0

for el in map(int, iter(input, '0')):
    if not mx_value:
        qty += 1
        mx_value = el
        continue
        
    if el == mx_value:
        qty += 1
    elif el > mx_value:
        mx_value, qty = el, 1

print(qty)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    let i = 0;
    let [a, count] = [ -1, 0 ];

     while ( +data[i] !== 0) { 
         if ( a < +data[i] ) { 
             a = +data[i];
             count = 1;
         } else if ( a === +data[i] ) count++;
         i++;
    }

    console.log(count);
  });
  

# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int max=0;
        int check=0;
        int i; while((i=int.Parse(Console.ReadLine()))!=0)
        {
            if (i>max)
            {
            max=i;
            check =1;
            }
            else if (i==max)
            check++;
        }
        Console.WriteLine(check);
    }
}


# java
import java.util.ArrayList;
import java.util.Collections;
import java.util.List;
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);

        List<Integer> list = new ArrayList<>();
        int data;

        while((data = input.nextInt()) != 0) {
            list.add(data);
        }

        int max = Collections.max(list);

        System.out.println(list.stream().filter(x -> x == max).count());
    }
}


# C
#include <stdio.h>
int main() {
    for (int x,mx=(scanf("%d",&x),x),c=1; scanf("%d",&x)==1 && x || (printf("%d",c),0); )
        x>mx ? c=1,mx=x : x==mx ? ++c : 0;
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, max = 0, i = 0;
    std::cin >> n;
    while (n != 0) {
        if (n > max) {
            max = n;
            i = 1;
        } else if (n == max) {
            i++;
        }
        std::cin >> n;
    }
    std::cout << i << "\n";
    return 0;
}




