Количество четных элементов последовательности

Определите количество четных элементов в последовательности, завершающейся числом 0.

Само число 0, и все, что следует за ним, учитывать не нужно.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит).

Выходные данные
Выведите ответ на задачу.

Sample Input:
2
1
4
0

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 808 учащихся
Из всех попыток 78% верных


# ruby
arr = (nums = $stdin.read.split("\n").map(&:to_i))[...(nums.find_index(0))]
cnt = 0
arr.each do |v|
    if v % 2 == 0
        cnt += 1
    end
end
p cnt


# python
cnt=0
for v in iter(input, '0'):
    if int(v)%2==0:
        cnt += 1
print (cnt)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    let i = 0;
    let result = 0;

    while ( data[i] !== '0') 
        if ( data[i++]%2 === 0 ) result++;

    console.log(result);
  });


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        // put your c# code here
        int i = 0;

        while(true)
        {
            int number = int.Parse(Console.ReadLine()!);
            
            if (number != 0 && number % 2 == 0 )
            {
                i++;
            }
            else if (number % 2 != 0)
            {
                continue;
            }
            else
            {
                break;
            }
        }

        Console.Write($"{i}");
    }
}


# java
import java.util.Scanner;
import java.util.ArrayList;

class Main {
    public static void main(String[] args) {
      Scanner sc = new Scanner(System.in);
        ArrayList <Integer> ar = new ArrayList();
        int count = 0;
        int i;
        while((i=sc.nextInt())!=0){
            ar.add(i);
            count++;
        }
    
      System.out.println(ar.stream().filter(x->x%2==0).count());
    }
}


# C
#include <stdio.h>
int main() {
    for (int x,c=0; scanf("%d",&x)==1 && x || (printf("%d\n",c),0); c+=x%2==0);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, i = 0;
    std::cin >> n;
    while (n) {
        if (n % 2 == 0) i++;
        std::cin >> n;
    }
    std::cout << i << "\n";
    return 0;
}


