Максимум последовательности

Последовательность состоит из натуральных чисел и завершается числом 0. Определите значение наибольшего элемента последовательности.

Числа, следующие за нулем, считывать не нужно.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит).

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
7
9
0

Sample Output:
9

Напишите программу. Тестируется через stdin → stdout
Верно решили 842 учащихся
Из всех попыток 86% верных


# ruby
p (nums = $stdin.read.split("\n").map(&:to_i))[...(nums.find_index(0))].max


# python
max=0
for v in iter(input, '0'):
    if int(v)>max:
        max = int(v)
print (max)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    let i = 0;
    let result = +data[0];

    while ( +data[i] !== 0) { 
        if ( +data[i] > result ) result = +data[i];
        i++;
    }
       
    console.log(result);
  });


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        // put your c# code here
        int maxNumber = 0;
        
        while(true)
        {
            int number = int.Parse(Console.ReadLine()!);
            
            if (number == 0)
            {
                break;
            }
            else if(number != 0 && maxNumber < number)
            {
                maxNumber = number;
            }
            else
            {
                continue;
            }
        }
        Console.Write(maxNumber);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int num = sc.nextInt();
        int max = Integer.MIN_VALUE;
        while (num != 0) {
            if (max < num) max = num;
            num = sc.nextInt();
        }
        System.out.print(max);
    }
}


# C
#include <stdio.h>
int main() {
    for (int x,mx=(scanf("%d",&x),x); x && scanf("%d",&x)==1 || (printf("%d\n",mx),0); x>mx?mx=x:0);
    return 0;
}



# C++
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    int max = n;
    while (n) {
        if (n > max) max = n;
        std::cin >> n;
    }
    std::cout << max << "\n";
    return 0;
}

