Среднее значение последовательности

Определите среднее арифметическое элементов последовательности, завершающейся числом 0.

Число 0 в последовательность не входит. Числа, следующие за нулем, считывать не нужно.

Входные данные
Вводится последовательность целых чисел. Ввод завершается, когда будет введено число 0.

Выходные данные
Выведите одно число - среднее арифметическое элементов последовательности. Если ответ это целое число - значит нужно выводить целое число. Если ответ вещественное число - значит выводить нужно вещественное (без округлений, отбрасываний и незначащих нулей).

Sample Input:
1
5
6
0

Sample Output:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 715 учащихся
Из всех попыток 33% верных


# ruby
arr = (nums = $stdin.read.split("\n").map(&:to_i))[...(nums.find_index(0))]
x = arr.sum % arr.size
y = arr.sum.to_f / arr.size
puts x == 0 ? y.to_i : y  


# python
total = length = 0
for el in iter(input, '0'):
    total += int(el)
    length += 1
print(total / length if total % length else total // length)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    let i = 0;
    let result = 0;

    while ( data[i] !== '0') {
        result = result + +data[i];
        i++;
    }
    i;
    result = result / i;
    
    console.log(result);
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
        // put your c# code here
        int i = 0;
        double sum = 0;

        while(true)
        {
            int number = int.Parse(Console.ReadLine()!);
            
            if (number != 0 && number > 0)
            {
                sum += number;
                i++;;
            }
            else
            {
                break;
            }
        }

        Console.Write($"{sum/i}");
    }
}


# java
import java.util.*;
import java.util.stream.*;

class Main {
    public static void main(String[] args) {
        try (Scanner scanner = new Scanner(System.in)) {
            double average = IntStream.generate(scanner::nextInt)
                                      .takeWhile(value -> value != 0)
                                      .average()
                                      .orElseThrow(RuntimeException::new);
            
            if (Math.abs(average - (int) average) < 1E-10) {
                System.out.println((int) average);
            } else {
                System.out.println(average);
            }
        }
    }
}


# C 
#include <stdio.h>

int main() {
    int x = 0;
    double res = 0;
    int count = 0;
    scanf("%d", &x);
    while(x != 0) {
        res += x; 
        scanf("%d", &x);
        count++;
    }
    if (count == 0) {
        return 0;
    } else {printf("%g", res/count);}
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, s = 0, i = 0;
    std::cin >> n;
    while (n) {
        s += n;
        i++;
        std::cin >> n;
    }
    std::cout << s * 1.0 / i << "\n";
    return 0;
} 



