Сумма последовательности

Определите сумму всех элементов последовательности, завершающейся числом 0.

Числа, следующие за нулем, считывать не нужно.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит).

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
7
9
0

Sample Output:
17

Напишите программу. Тестируется через stdin → stdout
Верно решили 797 учащихся
Из всех попыток 81% верных


# ruby
puts (nums = $stdin.read.split("\n").map(&:to_i))[..(nums.find_index(0))].sum


# python
total = 0
for el in iter(input, '0'):
    total += int(el)
print(total)


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        const strs = data.toString().split('0')[0].split('\n');
        console.log(strs.reduce((x, y) => +x + +y));
    }
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        // put your c# code here
        int i = 0;

        while(true)
        {
            int number = int.Parse(Console.ReadLine()!);
            
            if (number != 0 && number > 0)
            {
                i += number;
            }
            else
            {
                break;
            }
        }

        Console.Write(i);
    }
}


# java
import java.util.*;
import java.util.stream.*;

import static java.util.stream.Collectors.*;

class Main {
    public static void main(String[] args) {
        try (Scanner scanner = new Scanner(System.in)) {
            System.out.println(IntStream.generate(scanner::nextInt)
                                        .takeWhile(value -> value != 0)
                                        .sum());
        }
    }
}


# C
#include <stdio.h>
int main() {
    for (int x,s=0; scanf("%d",&x) && x || (printf("%d\n",s),0); s+=x);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, s = 0;
    std::cin >> n;
    while (n) {
        s += n;
        std::cin >> n;
    }
    std::cout << s << "\n";
    return 0;
}




