Количество локальных максимумов

Элемент последовательности называется локальным максимумом, если он строго больше предыдущего и последующего элемента последовательности. Первый и последний элемент последовательности не являются локальными максимумами.

Дана последовательность натуральных чисел, признаком конца которой является число 0. Определите количество строгих локальных максимумов в этой последовательности. 

Числа, следующие за числом 0, считывать не нужно.

Входные данные
Дана последовательность натуральных чисел, признаком конца которой является число 0.

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
2
1
2
1
0

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 455 учащихся
Из всех попыток 64% верных


# ruby
a = (nums = $stdin.read.split("\n").map(&:to_i))[...(nums.find_index(0))]
cnt = 0
a.each_cons(3) do |v|
    if v[0] < v[1] and v[1] > v[2]
        cnt += 1 
    end    
end
puts cnt


# python
lst = list(map(int, iter(input, '0')))
print(sum(lst[i - 1] < lst[i] > lst[i + 1] for i in range(1, len(lst) - 1)))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    
    let i = 1;
    let count = 0;

    while ( +data[i+1] !== 0) {
       if ( (+data[i] > +data[i-1]) && (+data[i+1] < +data[i]) ) count++;
        i++;
    }
    console.log(count);
  });


# C#
using System;
using System.Collections.Generic;

public class LocalMaximumsCount
{
    public static void Main()
    {
        var sequence = new List<int>(10);
        while (true)
        {
            int num = Convert.ToInt32(Console.ReadLine());
            if (num == 0) break;
            sequence.Add(num);
        }
        sequence.TrimExcess();
        
        var count = 0;
        for (int i = 1; i < sequence.Count - 1; i++)
            if (sequence[i - 1] < sequence[i] && sequence[i] > sequence[i + 1])
                count++;
        
        Console.WriteLine(count);
    }
}


# java
import java.util.ArrayList;
import java.util.List;
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        List<Integer> list = new ArrayList<>();
        int data, counter = 0;

        while((data = input.nextInt()) != 0) {
            list.add(data);
        }

        for (int a = 1; a < list.size() - 1; a++) {
            if(list.get(a).compareTo(list.get(a - 1)) > 0 && list.get(a).compareTo(list.get(a + 1)) > 0) {
                counter++;
            }
        }

        System.out.println(counter);
    }
}


# C
#include <stdio.h>

int main() {
    int prepre = 0,pre = 0, cur = 0, i = 0;
    scanf("%d", &prepre);
    scanf("%d", &pre);
    while((scanf("%d", &cur) == 1) && cur) {
        if (pre > prepre && pre > cur) i++;
        prepre = pre;
        pre = cur;
    }

    printf("%d", i);
    return 0;
}


# C++20
#include <iostream>

int main() {
    int a = 0, b = 0, c, i = 0;
    std::cin >> c;
    while (c != 0) {
        if (a != 0 && a < b && b > c) i++; 
        
        a = b;
        b = c;
        std::cin >> c;
    }
    std::cout << i << "\n";
    return 0;
}



