Количество элементов, которые больше предыдущего

Последовательность состоит из натуральных чисел и завершается числом 0. Определите, сколько элементов этой последовательности больше предыдущего элемента.

Числа, следующие за числом 0, считывать не нужно.

Входные данные
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит).

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
7
9
0

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 734 учащихся
Из всех попыток 57% верных


# ruby
x = 0
cnt = -1
loop do
    y = gets.to_i
    if y == 0
        break
    end    
    if y > x
        cnt += 1        
    end 
    x = y    
end
print (cnt)


# python
qty = 0
prev = cur = None

for el in iter(input, '0'):
    if not prev:
        prev = int(el)
    cur = int(el)
    qty += cur > prev
    prev = cur
    
print(qty)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    let i = 1;
    let result = [];
    let count = 0;

    while ( +data[i] !== 0) { 
        if ( +data[i] > +data[i-1] ) count++;
        i++;
    }
 
    console.log(count);
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int numCount = 0;
        int previous = 0;

        while (true)
        {
            int num = int.Parse(Console.ReadLine());
            if (num == 0) { break; }
            if (num > previous && previous != 0) { numCount++; }
            previous = num;
        }
        Console.WriteLine(numCount);
    }
}


# java
import java.util.Scanner;
public class Main {
  public static void main(String[] args) {
    Scanner sc = new Scanner(System.in);
    int count = 0;
    int t= 0;
    int x = sc.nextInt();
    do{t = x;
      x = sc.nextInt();
      if (x>t) count++;

    }while (x!=0);
    System.out.println(count);
  }
}


# C
#include <stdio.h>
int main() {
    for (int a,b,c=(scanf("%d",&a),0); scanf("%d",&b)==1 && b || (printf("%d",c),0); c+=a<b, a=b);
    return 0;
}


# C++
#include <iostream>

int main() {
    int a, b, i = 0;
    std::cin >> b;
    a = b;
    while (b != 0) {
        if (b > a) {
            i++;
        }
        a = b;
        std::cin >> b;
    }
    std::cout << i << "\n";
    return 0;
}

