Обнулить последние биты

Напишите программу, которая обнуляет заданное количество последних (младших) бит числа.

Входные данные
Дано целое число A и натуральное число i.

Выходные данные
Обнулите у числа A его последние i бит и выведите результат обнуления.

Sample Input:
5 1

Sample Output:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 67 учащихся
Из всех попыток 73% верных

# ruby
n, m = gets.chomp.split.map(&:to_i)
puts (n & ~((1 << m) - 1))


# python
n, k = map(int, input().split())
print((n >> k) << k)


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
long a=v.nextLong(),b=v.nextLong();
System.out.println(a>>b<<b);
    }
}


# C
#include <stdio.h>

int main() {
   unsigned int num, digit;
    scanf("%u %u", &num, &digit);
                                  
    printf("%u\n", num >> digit << digit);

  return 0;
}


# C++
#include <iostream>
using namespace std;
int main() {
int a,b;
cin>>a>>b;

cout <<((a>>b)<<b);
return 0;
}


# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let mut ai = buf.split(" ").map(|x| x.parse::<u32>().unwrap());
    println!("{}", ai.next().unwrap() & 0xFFFFFFFF << ai.next().unwrap());
    
}






