Вывести значение байта побитно

Напишите программу, выводящую все биты 8-битного числа

Входные данные
Дано число A (0 ≤ A ≤ 255).

Выходные данные
Выведите число A в битовой форме: 8 бит, старшие биты слева, младшие – справа.

Sample Input:
5

Sample Output:
00000101

Напишите программу. Тестируется через stdin → stdout
Верно решили 109 учащихся
Из всех попыток 75% верных


# ruby
puts gets.to_i.to_s(2).to_s.rjust(8, "0")


# python
n = int(input())
print(f'{n:b}'.zfill(8))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
int a=v.nextInt();        
String str=Integer.toBinaryString(a),str2="";        
for(int i=0;i<8-str.length();i++){
    str2+="0";
}
System.out.println(str2+str);        
    }
}


# C
#include <stdio.h>

int main() {
    unsigned int x;
    char bin_number[] = "00000000";
    scanf("%u", &x);
    for(int i = 0; i < 8; i++)
    {
        bin_number[7 - i] = (x >> i) & 1 ? '1' : '0';
    }
    printf("%s", bin_number);
    return 0;
}


# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let a = buf.parse::<u8>().unwrap();
    (0..8).for_each(|i| print!("{}", a >> (7 - i) & 1));
}

