2^n+2^m

Найдите сумму двух различных степеней числа 2, используя только битовые операции. В частности нельзя использовать операцию сложения чисел.

Входные данные
Даны два неравных числа: n и m, не превосходящие 31.

Выходные данные
Выведите на экран значение суммы 2n+2m.

Sample Input:
1 2

Sample Output:
6

Напишите программу. Тестируется через stdin → stdout
Верно решили 116 учащихся
Из всех попыток 41% верных


# ruby
n, m = gets.chomp.split.map(&:to_i)
puts (2 << n-1) | (2 << m-1)


# python
a, b = map(int, input().split())
print((1 << a) | (1 << b))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner myscan=new Scanner(System.in);
    int n=myscan.nextInt(),m=myscan.nextInt();
        long ch=0b1,ch2=0b1;
        ch<<=n;ch2<<=m;
        System.out.println(n!=m?ch|ch2:(ch|ch2)<<1);    
    }
}

# C++
#include <iostream>
using namespace std;
int main() {
    int n,m;
    cin>>n;
    cin>>m;
    cout<<((long long)1<<n)+((long long)1<<m);
    return 0;
}

# C
#include <stdio.h>

int main() 
{
    unsigned int n, m;
    scanf("%u%u",&n, &m);
    printf("%u\n", (1 << n) | (1 << m));
    // put your code here
    return 0;
}


# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let mut nm = buf.split(" ").map(|x| 1u32 << x.parse::<u8>().unwrap());
    println!("{}", nm.next().unwrap() + nm.next().unwrap());
}