Установить значение бита в 0

Напишите программу, устанавливающую значение определенного бита числа в 0 (биты при этом нумеруются с нуля, начиная от младших).

Входные данные
Дано целое число A и натуральное число i.

Выходные данные
Выведите число, которое получается из числа A установкой значения i-го бита = 0.

Sample Input:
5 2

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 98 учащихся
Из всех попыток 60% верных

# ruby
n, m = gets.chomp.split.map(&:to_i)
puts n &~ (1 << m) 


# python
a, n = map(int, input().split())
print(a & ~(1 << n))


# C
#include <stdio.h>

int main() {
   unsigned int num, digit;
    scanf("%u %u", &num, &digit);

    printf("%u\n", num & ~(1 << digit));

  return 0;
}


# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let mut ai = buf.split(" ").map(|x| x.parse::<u32>().unwrap());
    println!("{}", ai.next().unwrap() & !(1u32 << ai.next().unwrap()));
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        long a=myscan.nextLong(),i=myscan.nextLong();
        System.out.println((a|(1<<i))^1<<i);
    }
}


