Обнулить все биты, кроме последних

Напишите программу, обнуляющие все биты числа, кроме нескольких последних (младших).

Входные данные
Дано целое число A и натуральное число n.

Выходные данные
Выведите число, которое состоит только из n последних бит числа A (то есть обнулите все биты числа A, кроме последних n)

Sample Input:
5 1

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 60 учащихся
Из всех попыток 54% верных


# ruby
n, m = gets.chomp.split.map(&:to_i)
puts (n & ~(~0 << m))


# python
n, k = map(int, input().split())
print(n % (1 << k))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner (System.in);
long a=v.nextLong(); int b=v.nextInt(),chet=1;
for(int i=1;i<b;i++){
    chet=(chet<<1)|1;
}        
System.out.println(a&chet);
    }
}


# C++
#include <iostream>

using namespace std;

signed main()
{
    unsigned n, i;
    cin >> n >> i;
    cout << (n ^ (n >> i << i));
    return 0;
}

