Определить значение бита

Напишите программу, определяющую значение i-го бита числа (биты при этом нумеруются с нуля, начиная от младших).

Входные данные
Дано целое число A и целое неотрицательное число i.

Выходные данные
Выведите значение i-го бита числа A, то есть 0 или 1.

Sample Input:
5 1

Sample Output:
0

# ruby
n, m = gets.chomp.split.map(&:to_i)
puts (n >> m & 1)


# python
a, n = map(int, input().split())
print(a >> n & 1)


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner myscan=new Scanner(System.in);
        long a=myscan.nextLong(),i=myscan.nextLong();
        System.out.println((a&(1<<i))==0?"0":"1");
    }
}


# C
#include <stdio.h>

int main() {
   unsigned int num, digit = 1;
    scanf("%u %u", &num, &digit);
                                  
    printf("%u\n", (num & (1 << digit)) == 1 << digit);

  return 0;
}

# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let mut ai = buf.split(" ").map(|x| x.parse::<u32>().unwrap());
    println!("{}", ai.next().unwrap() >> ai.next().unwrap() & 1);
}


