Двоичные строки заданной длины

По данному числу N выведите все строки длины N из нулей и единиц в лексикографическом порядке.

Входные данные
Задано единственное число N (натуральное, 1 ≤ N ≤ 10).

Выходные данные
Необходимо вывести все строки длины N из нулей и единиц в лексикографическом порядке, по одной на строке.

Sample Input:
2

Sample Output:
00
01
10
11

Напишите программу. Тестируется через stdin → stdout
Верно решил 91 учащийся
Из всех попыток 57% верных

# ruby
n = gets.to_i

(0...1<<n).each do |i|
    puts i.to_s(2).rjust(n, "0")
end


# python
n = int(input())
    
for x in range(1 << n):
    print(f'{x:b}'.zfill(n))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int n=myscan.nextInt();
        int max=Integer.MAX_VALUE>>(31^n);
        int sum=0,a=0,tmp=0;
        while(sum<=max){
            a=1;
     System.out.println(String.format("%"+n+"s",Integer.toBinaryString(sum)).replaceAll(" ","0")); 
        while(a!=0){
        tmp=sum&a;
        sum=sum^a;
        a=tmp<<1;}}
    }
}


# C++
#include <iostream>
using namespace std;
int main() {
int n,m;
cin>>n;
m=1<<n;
for (int i=0;i<m;i++){
     string str="";
     int num=i;

     for(int i=0;i<n;i++){
        str=(char)((num%2)+'0')+str;
        num/=2;
    }
    cout <<str<<endl;
}
return 0;
}


# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let n: u8 = buf.parse().unwrap();
    for i in 0..(1u32 << n) {
        (1..=n).for_each(|x| print!("{}", i >> (n - x) & 1));
        println!("");
    }
}




