Установить значение бита в 1

Напишите программу, которая в заданном числе устанавливает определенный бит в 1 (биты при этом нумеруются с нуля, начиная от младших).

Входные данные
Дано целое число A и натуральное число i.

Выходные данные
Выведите число, которое получается из числа A установкой значения i-го бита = 1.

Sample Input:
5 1

Sample Output:
7

Напишите программу. Тестируется через stdin → stdout
Верно решили 109 учащихся
Из всех попыток 40% верных

# ruby
n, m = gets.chomp.split.map(&:to_i)
puts n | (2 << m-1)


# python
a, n = map(int, input().split())
print(a | (1 << n))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
long a=v.nextLong(),b=v.nextLong(),q=1<<b;        
System.out.println(a|q);   
    }
}


# C
#include <stdio.h>

int main() {
   unsigned int num, digit;
    scanf("%u %u", &num, &digit);

    printf("%u\n", num | (1 << digit));

  return 0;
}


# C++
#include <iostream>
using namespace std;
int main() {
   int i;
    long long a, k; //Дано целое число A и натуральное число i
 
    cin >> a >> i;
    k = 1;
    k <<= i; // число,  у которого i бит = 1, а остальные - 0
    a |= k;
 
    cout <<  a << endl;
    return 0;
}


# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let mut ai = buf.split(" ").map(|x| x.parse::<u32>().unwrap());
    println!("{}", ai.next().unwrap() | 1u32 << ai.next().unwrap());
}


