Инвертировать бит

Напишите программу, которая инвертирует определенный бит в заданном числе (биты при этом нумеруются с 0, начиная с младших).

Входные данные
Дано целое число A и натуральное число i.

Выходные данные
Выведите число, которое получается из числа A инвертированием i-го бита.

Sample Input:
5 2

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решил 71 учащийся
Из всех попыток 61% верных

# ruby
n, m = gets.chomp.split.map(&:to_i)
puts (n ^ (1 << m))


# python
a, n = map(int, input().split())
print(a ^ (1 << n))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        long a=myscan.nextLong(),i=myscan.nextLong();
        System.out.println(a^(1<<i));
    }
}

# C
#include <stdio.h>

int main() {
   unsigned int num, digit;
    scanf("%u %u", &num, &digit);
                                  
    printf("%u\n", num ^ (1 << digit));

  return 0;
}


# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    let mut ai = buf.split(" ").map(|x| x.parse::<u32>().unwrap());
    println!("{}", ai.next().unwrap() ^ 1 << ai.next().unwrap());
}




