2^n

Во всех упражнениях данного урока нельзя использовать арифметические операторы сложения, умножения, вычитания, деления. Вместо них нужно использовать побитовые операторы &, |, ~, ^, <<, >>. Входное число A не превышает 232-1 (если это не указано особо). Номера битов всегда задаются корректно, то есть принимают значения от 0 до 31. Ввод и вывод данных производится через стандартные потоки ввода-вывода.

Напишите программу, вычисляющую заданную степень числа 2, используя битовые операции.

Входные данные
Дано число n<32.

Выходные данные
Выведите число 2n, то есть число, у которого n-й бит равен 1, а остальные – нули.

Sample Input:
2

Sample Output:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 139 учащихся
Из всех попыток 31% верных


# ruby
n = gets.to_i
puts 2<<(n-1)

# python
print(1<<int(input()))

# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
long n=v.nextInt(),otv=(long)01<<n;
System.out.println(otv);        
    }
}


# C++
#include <iostream>
using namespace std;
int main() {
    int n;
    cin>>n;
    cout<<((long long)1<<n);
    return 0;
}

# C
#include <stdio.h>

int main() {
    long n; scanf("%ld", &n);
    printf("%ld", 1 << n);
    return 0;
}




# rust
fn main() {
    let mut buf = String::new();
    std::io::stdin().read_line(&mut buf).unwrap();
    println!("{}", 1u32 << buf.parse::<u8>().unwrap());
}

