Результаты олимпиады (1)

Во время проведения олимпиады каждый из участников получил свой идентификационный номер – натуральное число. Необходимо отсортировать список участников олимпиады по количеству набранных ими баллов.

Входные данные
На первой строке дано число N (1 ≤ N ≤ 1000) – количество участников. На каждой следующей строке даны идентификационный номер и набранное число баллов соответствующего участника. Все числа во входном файле не превышают 105.

Выходные данные
В выходной файл выведите исходный список в порядке убывания баллов. Если у некоторых участников одинаковые баллы, то их между собой нужно упорядочить в порядке возрастания идентификационного номера.

Sample Input:
3
101 80
305 90
200 14

Sample Output:
305 90
101 80
200 14

Напишите программу. Тестируется через stdin → stdout
Верно решили 139 учащихся
Из всех попыток 55% верных


# ruby
n = gets.to_i
a = []

0.upto(n-1) do |i|   
    a.push(gets.chomp.split(' ').map { |j| j.to_i }) 
end

a = a.sort_by { |i,j| -j }

i,j = 0,0
fsort = false

a.each_cons(2) do |v|
    if fsort == true
        if v[0][1] != v[1][1]
            a[j..i] = a[j..i].sort_by(&:first)                       
            j = 0 
            fsort = false
        end
    else
        if v[0][1] == v[1][1]          
            fsort = true
            j=i 
        end    
    end            
    i += 1    
end

a.each do |i|
    print i.join(" ")
    print "\n"
end    



# python
_, *nums = ([*map(int, row.split())] for row in open(0).read().split('\n'))
[print(*row) for row in sorted(nums, key=lambda x: (-x[1], x[0]))]



# JS
var stdin = process.openStdin();

stdin.addListener("data", function (d) {
  let str = d.toString().split("\n");
  let arr = [];
  for (let i = 1; i < str.length; i++) {
    let [id, balls] = str[i].split(" ");
    let obj = {id, balls};
    arr.push(obj);
  }
  arr.sort((a, b) => b.balls - a.balls);

  let i = 0;
  while (i < arr.length) {
    if (i + 1 < arr.length && +arr[i].balls === +arr[i + 1].balls) {
      let j = i + 1;
      while (j < arr.length && arr[i].balls === arr[j].balls) j++;

      let buffer = arr.slice(i, j).sort((a, b) => a.id - b.id);
      for (let k = 0; k < buffer.length; k++)
        console.log(buffer[k].id + " " + buffer[k].balls);
      i = j;
    } else console.log(arr[i].id + " " + arr[i++].balls);
  }
});


# C#
using System;
using System.Linq;

public class MainClass
{            
    public static void Main()
    {                        
        int n=int.Parse(Console.ReadLine());
        Sman[] arrSman=new Sman[n];
        
        for(int i=0;i<n;i++)
        {
            arrSman[i]=new Sman();
            int[] input=Array.ConvertAll(Console.ReadLine(). Split(), int.Parse);
            arrSman[i].ID=input[0];
            arrSman[i].mark=input[1];            
        }
        
        var orderArr=arrSman.OrderBy(p=>p.ID).OrderByDescending(p=>p.mark);
        
        foreach(var man in orderArr)
        Console.WriteLine(man.ID+" "+man.mark);
        
    }
    struct Sman
        {
        public int ID;
        public int mark;
        }
}


# java
import java.util.Arrays;
import java.util.Comparator;
import java.util.HashMap;
import java.util.Map;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int number = Integer.parseInt(input.nextLine());
        HashMap<Integer, Integer> sportsmen = new HashMap<>();

        for (int a = 0; a < number; a++) {
            int[] data = Arrays.stream(input.nextLine().split("\\s+"))
                    .mapToInt(Integer::parseInt)
                    .toArray();

            if(!sportsmen.containsKey(data[0])) sportsmen.put(data[0], data[1]);
            else sportsmen.put(data[0], sportsmen.get(data[0]) + data[1]);
        }

        sportsmen.entrySet()
                .stream()
                .sorted(Map.Entry.<Integer, Integer>comparingByValue(Comparator.reverseOrder())
                        .thenComparing(Map.Entry.comparingByKey()))
                .forEach(el -> System.out.printf("%d %d%n", el.getKey(), el.getValue()));
    }
}

