Утренняя пробежка - 2

В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 70% от предыдущего значения. По данному числу y определите номер дня, на который суммарный пробег спортсмена составит не менее y километров.

Входные данные
На вход программа получает два действительных числа x и y. Числа положительные, действительные, не превосходят 1000, заданы с точностью до шести знаков после запятой.

Выходные данные
Программа должна вывести единственное целое число.

Sample Input:
1 20

Sample Output:
6

Напишите программу. Тестируется через stdin → stdout
Верно решили 258 учащихся
Из всех попыток 27% верных



# ruby
#x,y = gets.to_f, gets.to_f
a = gets.split().map{|j| j.to_f }
x = a[0]
y = a[1]
#y = 16
k = 1
sum = x

while sum<=y 
    x += x * 0.7
    sum += x      
    k += 1
end 

puts k


# python
x, y = map(float, input().split())

n, total = 1, x
while total <= y:
    x *= 1.7
    total += x
    n += 1
    
print(n)


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        [x, y] = data.toString().split(' ');
        console.log(+y > +x ? Math.ceil(Math.log(0.7 * y / x + 1) / Math.log(1.7)) : 1);
    }
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        float[] data = Array.ConvertAll(Console.ReadLine().Split(),float.Parse);
            float allDistans = data[1];
            float distanceDay = data[0];
            int days = 0;
            while (allDistans> 0)
            {
                allDistans -= distanceDay; 
                distanceDay *= 1.7f;
                days++;
            }
            Console.WriteLine(days);
    }
}


# java
import java.util.Locale;
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        input.useLocale(Locale.ENGLISH);

        double x = input.nextDouble();
        double y = input.nextDouble();
        double result = x;
        int counter = 1;

        while(result < y) {
            x = x * 1.7;
            result += x;
            counter++;
        }

        System.out.println(counter);
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <math.h>

int main() {
    double a, b, s;
    scanf("%lf %lf", &a, &b);
    a = floor(a * pow(10, 6));
    b = floor(b * pow(10, 6));
    s = a;
    uint8_t days = 1;
    while (s <= b) {
        a = floor(a * 1.7);
        s += a;
        days++;
    }
    printf("%"PRId8, days);
    return 0;
}



# C++
#include <iostream>
#include <stdio.h>
int main() {
    // put your code here======>next
    double x,y,sum;sum=0.0;
    scanf("%lf%lf",&x,&y);int d=0;
    while (sum<y){sum+=x;
        x+=x*0.7;
     d++;   
    
    }
    printf("%d",d);
    return 0;
}




