Диета

В некоторой сверхсекретной лаборатории изучаются физические возможности животных. Любой живой организм нуждается в трех компонентах пищи – белках, жирах и углеводах. Известен набор продуктов, имеющийся в распоряжении лаборатории, и меню животных – сколько единиц каждого продукта они получают. Известно также, сколько белков, жиров и углеводов необходимо для нормальной жизнедеятельности животного. Необходимо определить, получает ли животное достаточное количество питательных веществ. Известно, что животному требуется в сутки X белков, Y жиров и Z углеводов. 

Известно также, что всего животное получает в сутки N продуктов питания, и для каждого из них известны Ai, Bi, Ci и Qi – соответственно, энергетическая ценность единицы продукта в белках, жирах и углеводах и количество единиц этого продукта. Все числа – действительные, заданные с точностью до 5 знаков после запятой.
Входные данные
На первой строке входных данных записаны числа X , Y и Z. На второй строке записано число N. Далее на N строках записаны, соответственно, Ai, Bi, Ci и Qi.
Выходные данные
Выведите YES , если данный пищевой рацион является достаточным по всем параметрам, и NO в противном случае.

Sample Input:
1.0 1.0 1.0
3
1 0 0 1
0 0.5 0 2
0 0 0.25 4

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 239 учащихся
Из всех попыток 52% верных


# ruby
a = gets.split().map{|j| j.to_f }
x = a[0]
y = a[1]
z = a[2]
n = gets.to_i
a_sum,b_sum,c_sum = 0,0,0

1.upto(n) do |i|   
    a = gets.split().map{|j| j.to_f }   
    a_sum += a[0] * a[3]
    b_sum += a[1] * a[3]
    c_sum += a[2] * a[3]
end

if (a_sum >= x) && (b_sum >= y) && (c_sum >= z)
    puts 'YES'
else
    puts 'NO'
end    


# python
X, Y, Z = map(float, input().split())
A = B = C = 0
for _ in range(int(input())):
    a, b, c, q = map(float, input().split())
    A += a * q
    B += b * q
    C += c * q
if all([A >= X, B >= Y, C >= Z]):
    print('YES')
else:
    print('NO')


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let [b, g, y, k] = str[0].split(' ');
    let animal = { b:+b, g:+g, y:+y }
    let obj = { b:0, g:0, y:0, k:0 } 
    let result = 'YES';
    
    for (let i=2; i<str.length; i++) {
        let [b, g, y, k] = str[i].split(' ');
        obj.b = obj.b + b*k;
        obj.g = obj.g + g*k;
        obj.y = obj.y + y*k;
    }
    
    if (animal.b > obj.b ) result = 'NO';
    if (animal.g > obj.g ) result = 'NO';
    if (animal.y > obj.y ) result = 'NO';
    
    console.log(result);
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
        float[] needFood=Array.ConvertAll(Console.ReadLine().Split(),float.Parse);
        int n=int.Parse(Console.ReadLine());
        float X=needFood[0];
        float Y=needFood[1];
        float S=needFood[2];
        bool isFull=false;
        float amount;
        while(n>0 && !isFull) 
        {
            float[] food=Array.ConvertAll(Console.ReadLine(). Split(),float.Parse);
            amount=food[3];
            X -= food[0]*amount;
            Y -= food[0]*amount;
            S -= food[0]*amount;
            isFull=X<=0 && Y<=0 && S<=0; 
            n--;           
        } 
        Console.WriteLine(isFull?"YES":"NO");
    }
}


# java
import java.util.Arrays;
import java.util.Locale;
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        input.useLocale(Locale.ENGLISH);

        double pR = 0d, f = 0d, c = 0d, q = 0d;

        double neededPr = input.nextDouble();
        double neededFat = input.nextDouble();
        double neededC = Double.parseDouble(input.nextLine().trim());

        int foodstuff = Integer.parseInt(input.nextLine());

        for(int a = 0; a < foodstuff; a++) {
            double[] current = Arrays
                    .stream(input.nextLine().split("\\s+"))
                    .mapToDouble(Double::parseDouble)
                    .toArray();

            pR += current[0] * current[3];
            f += current[1] * current[3];
            c += current[2] * current[3];
        }

        if(neededPr <= pR && neededFat <= f && neededC <= c) {
            System.out.println("YES");
        }
        else {
            System.out.println("NO");
        }
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <math.h>

#define ACCURACY(x) floor(x * pow(10, 5))

int main() {
    double X = 0.0, Y = 0.0, Z = 0.0;
    scanf("%lf %lf %lf", &X, &Y, &Z);
    X = ACCURACY(X);
    Y = ACCURACY(Y);
    Z = ACCURACY(Z);
    
    uint8_t N = 0;
    scanf("%"SCNd8, &N);
    double Xi = 0.0, Yi = 0.0, Zi = 0.0, Qi = 0.0;
    double Xs = 0.0, Ys = 0.0, Zs = 0.0;
    for (size_t i = 0; i < N; i++) {
        scanf("%lf %lf %lf %lf", &Xi, &Yi, &Zi, &Qi);
        Xs += ACCURACY(Xi * Qi);
        Ys += ACCURACY(Yi * Qi);
        Zs += ACCURACY(Zi * Qi);
    }

    printf("%s", Xs >= X && Ys >= Y && Zs >= Z ? "YES" : "NO");
    return 0;
}


# C++
#include <iostream>
using namespace std;

int main()
{
double x,y,z,xi,yi,zi;
int n=0,qi;
cin>>x>>y>>z>>n;
for(int i=0;i<n;i++){
cin>>xi>>yi>>zi>>qi;
x=x-xi*qi;
y=y-yi*qi;
z=z-zi*qi;
}
cout<<((x<=0&&y<=0&&z<=0)? "YES":"NO");
return 0;
}




  


