Утренняя пробежка - 1

В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 70% от предыдущего значения. По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.

Входные данные
На вход программа получает два действительных числа x и y . Числа положительные, действительные, не превосходят 1000, заданы с точностью до шести знаков после запятой.

Выходные данные
Программа должна вывести единственное целое число.

Sample Input:
10 30

Sample Output:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 350 учащихся
Из всех попыток 47% верных


# ruby
#x,y = gets.to_f, gets.to_f
a = gets.split().map{|j| j.to_f }
x = a[0]
y = a[1]
#y = 16
k = 1

while x<=y
    x += x * 0.7
    k += 1
end 

puts k


# python
x, y = map(float, input().split())

n = 1
while x <= y:
    x *= 1.7
    n += 1
    
print(n)


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        [x, y] = data.toString().split(' ');
        console.log(+y > +x ? Math.ceil(Math.log(y / x) / Math.log(1.7)) + 1 : 1);
    }
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
            float[] data = Array.ConvertAll(Console.ReadLine().Split(),float.Parse);
            float allDistans = data[1];
            float distanceDay = data[0];
            int days = 1;
            while (allDistans-distanceDay > 0)
            {
                distanceDay *= 1.7f;
                days++;
            }
            Console.WriteLine(days);
    }
}


# java
import java.util.Locale;
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        input.useLocale(Locale.ENGLISH);

        double x = input.nextDouble();
        double y = input.nextDouble();
        int counter = 1;

        while(x < y) {
            x = x * 1.7;
            counter++;
        }

        System.out.println(counter);
    }
}


# C
#include <inttypes.h>
#include <stdio.h>
#include <math.h>

int main() {
    double a, b;
    scanf("%lf %lf", &a, &b);
    a = floor(a * pow(10, 6));
    b = floor(b * pow(10, 6));
    uint8_t days = 1;
    while (a <= b) {
        a = floor(a * 1.7);
        days++;
    }
    printf("%"PRId8, days);
    return 0;
}


# C++
#include <iostream>

int main() {
    // put your code here
    double x, y;
    std::cin >> x >> y;
    int day = 1;
    while (x < y)
    {
        x *= 1.7;
        ++day;
    }
    
    std::cout << day << std::endl;
    return 0;
}


