Максимум

Напишите программу, которая считывает два целых числа a и b и выводит наибольшее значение из них. Числа — целые от 1 до 1000.
При решении задачи можно пользоваться только целочисленными арифметическими операциями +, -, *, //, %, =.

Нельзя пользоваться нелинейными конструкциями: ветвлениями, циклами, функциями вычисления модуля, извлечения квадратного корня.
Не пользуйтесь функциями типа max!

Входные данные
Вводятся два целых числа a и b.

Выходные данные
Выведите ответ на задачу.

Sample Input:
8
5

Sample Output:
8

Напишите программу. Тестируется через stdin → stdout
Верно решили 877 учащихся
Из всех попыток 57% верных


# ruby
a,b = gets.to_i, gets.to_i
p a * (0**((a - b) * (a - b))) + b * ( 0**(a / b)) + a * ( 0**(b / a))


# python
a, b = int(input()), int(input())
print(a if a > b else b)


# JS
let [a, b] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log((a + b + Math.abs(a - b)) / 2);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int first = int.Parse(Console.ReadLine());
        int second = int.Parse(Console.ReadLine());
        bool a = first > second;
        bool b = second >= first;
        Console.WriteLine(Convert.ToInt32(a) * first + Convert.ToInt32(b) * second);
    }
}


# java
import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;


class Main {
    public static void main(String[] args) {
        int x = 0;
        int y = 0;
        try(BufferedReader reader = new BufferedReader(new InputStreamReader(System.in))) {
            x = Integer.parseInt(reader.readLine());
            y = Integer.parseInt(reader.readLine());
        }
        catch (IOException e) {
            e.printStackTrace();
        }

        int result = x - ((x - y) & ((x - y) >> 31));
        System.out.println(result);

    }
}


# C
#include <stdio.h>

int main()
{
    int a, b;
    scanf("%d %d", &a, &b);
    printf("%d", a > b ? a : b);
    return 0;
}


# C++
#include <iostream>

int main() {
    int a, b;
    std::cin >> a >> b;
    std::cout << (a / b * a + b / a * b) / (a / b + b / a) << "\n";
    return 0;
}





