Симметричное число

Дано четырехзначное число. Определите, является ли его десятичная запись симметричной. Если число симметричное, то выведите 1, иначе выведите 0. Число может иметь меньше четырех знаков, тогда нужно считать, что его десятичная запись дополняется слева незначащими нулями.

При решении этой задачи нельзя пользоваться условной инструкцией if и циклами

Входные данные
Вводится четырехзначное число.

Выходные данные
Выведите ответ на задачу.

Sample Input:
2002

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 857 учащихся
Из всех попыток 34% верных


# ruby
n = gets.to_i
n1 = n/1000+n/100%10*10+n/10%10*100+n%10*1000
puts (n / n1) * (n1 / n)


# python
a = int(input())
x = (a%10)*10
y = (a//10)%10
b = x+y
print((int)((a//100)==b))



# JS
const readline = require('readline');
const { stdin, stdout } = process;
new Promise((resolve)=>{
    const rl = readline.createInterface({ input: stdin, output: stdout });
    let inputLines = [];
    rl
        .on('line', (str)=>{ if(str) inputLines.push(str); })
        .on('close', ()=>{ resolve(inputLines); });
}).then((inputLines)=>{
    /* Решение */
    let [ num ] = inputLines;
    num = num.padStart(4, '0');
    const revNum = num.split('').reverse().join('');

    console.log(num==revNum? 1: 0);
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int number = int.Parse(Console.ReadLine());
        string left = $"{number % 1000 / 100}{number / 1000}";
        string right = $"{number % 100 / 10}{number % 10}";
        Console.WriteLine(Convert.ToInt32(left==right));
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        
        int num = sc.nextInt();
        
        System.out.print((("" + num/1000 + num%1000/100).equals("" + num%10 + num%100/10)) ? 1 : 0);
    }
}


# C
#include <stdio.h>

int main() {
    int a, b, c, d; scanf("%d", &a);
    
    d = a % 10, a /= 10;
    c = a % 10, a /= 10;
    b = a % 10, a /= 10;
    
    printf("%d", a == d && b == c);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, n1, k;
    std::cin >> n;
    n1 = n/1000+n/100%10*10+n/10%10*100+n%10*1000;
    std::cout << (n / n1) * (n1 / n) << "\n";
    return 0;
}



