Разность времен

Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды для каждого из моментов времени. Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.

Входные данные
Программа на вход получает три целых числа — часы, минуты, секунды, задающие первый момент времени и три целых числа, задающих второй момент времени.

Выходные данные
Выведите число секунд между этими моментами времени.

Sample Input:
1
1
1
2
2
2

Sample Output:
3661

Напишите программу. Тестируется через stdin → stdout
Верно решили 1 592 учащихся
Из всех попыток 81% верных


# ruby
h1, m1, s1, h2, m2, s2 = gets.to_i, gets.to_i, gets.to_i, gets.to_i, gets.to_i, gets.to_i
t1 = h1 * 3600 + m1 * 60 + s1 
t2 = h2 * 3600 + m2 * 60 + s2
puts t2 - t1


# python
h1, m1, s1, h2, m2, s2 = (int(input()) for _ in range(6))
seconds1 =  h1 * 3600 + m1 * 60 + s1
seconds2 =  h2 * 3600 + m2 * 60 + s2
print(seconds2 - seconds1)


# JS
let [h1, m1, s1, h2, m2, s2] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
let seconds1 = h1 * 3600 + m1 * 60 + s1;
let seconds2 = h2 * 3600 + m2 * 60 + s2;
console.log(seconds2 - seconds1);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int h1 = Convert.ToInt32(Console.ReadLine());
        int m1 = Convert.ToInt32(Console.ReadLine());
        int s1 = Convert.ToInt32(Console.ReadLine());
        int h2 = Convert.ToInt32(Console.ReadLine());
        int m2 = Convert.ToInt32(Console.ReadLine());
        int s2 = Convert.ToInt32(Console.ReadLine());
        int seconds1 = h1 * 3600 + m1 * 60 + s1;
        int seconds2 = h2 * 3600 + m2 * 60 + s2;
        Console.WriteLine(seconds2 - seconds1);
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int h1 = sc.nextInt();
        int m1 = sc.nextInt();
        int s1 = sc.nextInt();
        int h2 = sc.nextInt();
        int m2 = sc.nextInt();
        int s2 = sc.nextInt();
        int firstTime = h1 * 3600 + m1 * 60 + s1;
        int secondTime = h2 * 3600 + m2 * 60 + s2;
        System.out.println(secondTime - firstTime);
    }
}


# C
#include <stdio.h>

int read_time(){
    int h, m, s; 
    scanf("%d %d %d", &h, &m, &s);
    return (h * 60 + m) * 60 + s;
}

int main() {
    int t = read_time() - read_time();
    printf("%d", -t);
    return 0;
}


# C++
#include <iostream>

int main() {
    int h1, m1, s1, h2, m2, s2, t1, t2;
    std::cin >> h1 >> m1 >> s1 >> h2 >> m2 >> s2;
    
	t1 = h1 * 3600 + m1 * 60 + s1; 
	t2 = h2 * 3600 + m2 * 60 + s2;   
    
    std::cout << t2 - t1 << "\n";
    return 0;
}



