Следующее и предыдущее

Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере. Пробелы, знаки препинания, заглавные и строчные буквы важны!

Входные данные
Вводится целое число, по модулю не превосходящее 10000.

Выходные данные
Выведите сначала фразу "The next number for the number ", затем введенное число, затем слово " is ", окруженное пробелами, затем формулу для следующего за введенным числа, наконец, знак точки без пробела. Аналогично в следующей строке для предыдущего числа.

Sample Input:
179

Sample Output:
The next number for the number 179 is 180.
The previous number for the number 179 is 178.

Напишите программу. Тестируется через stdin → stdout
Верно решили 3 522 учащихся
Из всех попыток 38% верных


# ruby
a = gets.to_i
puts "The next number for the number #{a} is #{a+1}."
puts "The previous number for the number #{a} is #{a-1}."


# python 
n = int(input())
print(f'''The next number for the number {n} is {n + 1}.
The previous number for the number {n} is {n - 1}.''')


# JS
let n = Number(require('fs').readFileSync(0, 'utf8'));
console.log(`The next number for the number ${n} is ${n + 1}.`);
console.log(`The previous number for the number ${n} is ${n - 1}.`);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int number = int.Parse(Console.ReadLine());
        string result = $"The next number for the number {number} is {number+1}.\nThe previous number for the number {number} is {number-1}.";
        Console.WriteLine(result);
    }
}


# C
#include <stdio.h>

int main() {
    int a;
    scanf("%d", &a);
    printf("The next number for the number %d is %d.\n", a, a + 1);
    printf("The previous number for the number %d is %d.", a, a - 1);
    return 0;
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
         Scanner scanner = new Scanner(System.in);
        int number = scanner.nextInt();
        System.out.println("The next number for the number " + number + " is " + (number + 1) + ".");
        System.out.println("The previous number for the number " + number + " is " + (number - 1) + ".");
    }
}



# C++
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    int a;
    cin >> a;
    cout << "The next number for the number " <<  a << " is " << a+1 << "." <<endl;
    cout << "The previous number for the number " <<  a << " is " << a-1 << "."  << endl;    
    return 0;
}







