Электронные часы - 1

Дано число n. С начала суток прошло n минут. Определите, сколько часов и минут будут показывать электронные часы в этот момент. Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59). Учтите, что число n может быть больше, чем количество минут в сутках.

Входные данные
Вводится целое число n.

Выходные данные
Выведите ответ на задачу.

Sample Input:
150

Sample Output:
2 30

Напишите программу. Тестируется через stdin → stdout
Верно решили 2 012 учащихся
Из всех попыток 43% верных


# ruby
n = gets.to_i % (24 * 60)
h = n / 60
m = n % 60
puts h.to_s + ' ' + m.to_s  


# python
minutes = int(input())
print((minutes // 60) % 24, minutes % 60)


# JS
let n = Number(require('fs').readFileSync(0, 'utf8'));
console.log(Math.floor(n / 60) % 24, n % 60);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int number = int.Parse(Console.ReadLine());
        string result = $"{number / 60 % 24} {number % 60}";
        Console.WriteLine(result);
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        int n = scan.nextInt();
        
        int h = n/60;
        int s = h/24;
        h = h - s*24;
        int m = n%60;
        System.out.print(h + " " + m);
    }
}


# C
#include <stdio.h>

int main() {
    int h, m; scanf("%d", &h);
    
    m = h % 60;
    h = h / 60 % 24;
    
    printf("%d %d\n", h, m);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, h, m;
    std::cin >> n;
    n = n % (24 * 60);
    h = n / 60;
    m = n % 60;
    std::cout << h << " " << m << "\n";
    return 0;
}


