Дележ яблок - 1

N школьников делят K яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику?

Входные данные
Программа получает на вход числа N и K.

Выходные данные
Программа должна вывести искомое количество яблок.

Sample Input:
5
21

Sample Output:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 3 400 учащихся
Из всех попыток 66% верных


# ruby
a = gets.to_i
puts gets.to_i/a


# python
n, k = int(input()), int(input())
print(k // n)


# JS
let [n, k] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log(Math.floor(k / n));


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = Convert.ToInt32(Console.ReadLine());
        int k = Convert.ToInt32(Console.ReadLine());
        Console.WriteLine(k / n);
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {

        Scanner Scan = new Scanner(System.in);

        int n = Scan.nextInt();
        int k = Scan.nextInt();

        int c = k / n;

        System.out.print(c);
        Scan.close();
    }
}


# C
#include <stdio.h>

int main()
{
    int n, k;
    scanf("%d %d", &n, &k);
    printf("%d", k / n);
    return 0;
}



# C++ code here
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    int a, b;
    cin >> a >> b;
    cout << b/a << endl;
    return 0;
}





