Второклассная задача

У второклассников очень популярна следующая задача:

101=1
8181515=4
1111112=0
8888888=14
1010101=3
7000007=?

Преподавателю программирования в некоем Центре для одаренных детей так понравилась эта задачка, что он решил именно ее использовать для проверки знаний математики 2-го класса у своих учеников.

Пусть первое число x, а соответствующее ему n.

Входные данные
Единственное неотрицательное число x, не превышающее 101001.

Выходные данные
Выведите n.

Sample Input:
689

Sample Output:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 346 учащихся
Из всех попыток 68% верных


# ruby
a_circ = [1,0,0,0,0,0,1,0,2,1]
s = gets
cnt = 0

s.each_char do |i|
    v = i.to_i
    cnt += a_circ[v]
end

puts cnt 


# python
print(sum(1 if i in '069' else 2 if i == '8' else 0 for i in input()))



# JS
const count = (arr, val) => arr.filter(x => x === val).length;
const data = require('fs').readFileSync(0, 'utf8').split('').map(Number);
const res = count(data, 0) + count(data, 6) + count(data, 8) * 2 + count(data, 9);
console.log(res);


# C#
using System;

int count = 0;
foreach (var digit in Console.ReadLine())
{
    if (digit == '0' || digit == '6' || digit == '9') count += 1;
    else if (digit == '8') count += 2;
}
Console.WriteLine(count);


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        String x = scanner.next();

        int result = 0;

        for (char c : x.toCharArray()) {
            result += switch (c) {
                case '0', '6', '9' -> 1;
                case '8' -> 2;
                default -> 0;
            };
        }

        System.out.println(result);
    }
}


# C++
#include <iostream>

int main() {
    int x, n = 0;
    std::cin >> x;
    while (x) {
        if (x % 10 == 8) n += 2;
        else if (x % 10 == 0 || x % 10 == 6 || x % 10 == 9) n++;
        x /= 10;
    }
    std::cout << n << "\n";
    return 0;
}


