Количество элементов, больших предыдущего

Дан массив, состоящий из целых чисел. Напишите программу, которая подсчитает количество элементов массива, больших предыдущего (элемента с предыдущим номером).

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 10000). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести единственное число - количество элементов массива, больших предыдущего.

Sample Input:
5
1 2 3 4 5

Sample Output:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 736 учащихся
Из всех попыток 50% верных



# ruby
n=gets.to_i
a = gets.chomp.split()
#a = "1 2 3 4 5 6 7 8 9 10".chomp.split()
#print a
cnt = 0
a.each_cons(2) do |v|
    if v[0].to_i < v[1].to_i
        cnt += 1 
    end    
end
p cnt


# python
input()
lst = list(map(int, input().split()))
print(sum(lst[i] > lst[i - 1] for i in range(1, len(lst))))


# JS
let [n, arr] = require('fs').readFileSync(0, 'utf8').split('\n')
arr = arr.split(' ').map(Number)

let total = 0
for (let i = 1; i <= n; i++) { 
    if (arr[i] > arr[i-1]) {
        total++
    }
}

console.log(total)


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        var n = Console.ReadLine();
        int[] arr = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        int count = 0;
        
        for(int i = 1; i < arr.Length; ++i)
        {
            if(arr[i] > arr[i-1]) ++count;
        }
        
        Console.WriteLine(count);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        int count = 0;
        int [] arr = new int [n];
        for (int i = 0; i < n; i++) {
            arr [i] = sc.nextInt();
            if (i != 0 && arr[i] > arr [i-1]) {count++;}
        }
        sc.close();
        System.out.print(count);
    }
}


# C
#include <stdio.h>
int main() {
    int n, m[(scanf("%d",&n),n)];
    for (int c,i=c=0; i<n || (printf("%d\n",c),0); scanf("%d",&m[i]), i?c+=m[i-1]<m[i]:0,  ++i);
    return 0;
}


# C++
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int n, res = 0;
    cin >> n;
    vector <int> a(n);
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    
    for (int i = 1; i < n; i++) {
        if (a[i - 1] < a[i]) {
            res++;
        }
    }
    cout << res;    
    return 0;
}


