A[0], A[2], A[4], ...

Дан массив, состоящий из целых чисел. Нумерация элементов начинается с 0. Напишите программу, которая выведет элементы массива, номера которых четны (0, 2, 4...).

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 100). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести все элементы массива с чётными номерами. Числа следует выводить через пробел. 

Sample Input:
6
4 5 3 4 2 3

Sample Output:
4 3 2

Напишите программу. Тестируется через stdin → stdout
Верно решили 427 учащихся
Из всех попыток 58% верных


# ruby
n=gets.to_i
a = gets.chomp.split()
k = 0

a.each do |i|     
    if (k%2) == 0
        print "#{i} " 
    end
    k = k + 1     
end    

# python
(input(), print(*input().split()[::2]))



# JS
let arr = require('fs').readFileSync(0, 'utf8').split('\n')[1].split(' ');
let res = arr.filter((_, i) => !(i&1)).join(' ');
console.log(res);


# C
#include <stdio.h>
int main() {
    int n, m[(scanf("%d",&n),n)];
    for (int i=0; i<n; scanf("%d",&m[i]), i%2 ? 0 : printf("%d ",m[i]), ++i);
    return 0;
}


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        var n = Console.ReadLine();
        int[] arr = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        
        for(int i = 0; i < arr.Length; ++i)
        {
            if(i % 2 == 0) Console.Write($"{arr[i]} ");
        }
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner (System.in);
        int [] arr = new int [sc.nextInt()];
        for (int i = 0; i < arr.length; i++) {
            arr[i] = sc.nextInt();
            System.out.print(i%2 == 0 ? arr[i] : " ");
        }
        sc.close();
    }
}


# C++20
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int n;
    cin >> n;
    vector <int> a(n);
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    
    for (int i = 0; i < n; i += 2) {
        cout << a[i] << " ";
    }
    return 0;
}








