Максимум в массиве

Вводится массив, состоящий из целых чисел. Найти наибольшее среди них.

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 35). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести значение наибольшего элемента в массиве.

Sample Input:
3
1 2 3

Sample Output:
3

Напишите программу. Тестируется через stdin → stdout
Верно решили 595 учащихся
Из всех попыток 67% верных


# ruby
n=gets.to_i
p (gets.chomp.split().map(&:to_i)).max


# python
input()
print(max(map(int, input().split())))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    console.log(Math.max(...str[1].split(' ')));
  });

  
# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        Console.ReadLine();
        Console.WriteLine((Array.ConvertAll(Console.ReadLine().Split(),int.Parse)).Max());
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int [] arr = new int [sc.nextInt()];
        int max = Integer.MIN_VALUE;
        for (int i = 0; i < arr.length; i++) {
            arr[i]=sc.nextInt();
            if (max < arr[i]) max = arr[i]; 
        }
        System.out.print(max);
    }
}


# C
#include <stdio.h>
int main() {
    int n, m[(scanf("%d",&n),n)], mx=(scanf("%d",m),*m);    
    for (int i=1; i<n || (printf("%d\n",mx),0); scanf("%d",&m[i]), mx=m[i]>mx?m[i]:mx, ++i);
    return 0;
}


# C++
#include <iostream>
#include <vector>
#include <limits.h>

int main() {
    int size, max = INT_MIN;
    std::cin >> size;
    std::vector <int> array(size);
    for(int i = 0; i < size; i++)
    {
        std::cin >> array[i]; 
    }
    for(int i = 0; i < size; i++)
    {
        if(array[i] > max)
        {
            max = array[i];
        }
    }
    std::cout << max;
    return 0;
}

