Переставить элементы в обратном порядке

Напишите программу, которая переставляет элементы массива в обратном порядке без использования дополнительного массива. Программа должна считать массив, поменять порядок его элементов, затем вывести результат (просто вывести элементы массива в обратном порядке – недостаточно!)

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 35). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести массив, полученный после перестановки элементов. Числа следует выводить через пробел.

Sample Input:
6
4 5 3 4 2 3

Sample Output:
3 2 4 3 5 4

Напишите программу. Тестируется через stdin → stdout
Верно решили 660 учащихся
Из всех попыток 65% верных


# ruby
array_size = gets.to_i
numbers = gets.split.map(&:to_i)
numbers.reverse!
print numbers.join(" ")


# python
input()
print(*input().split()[::-1])



# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    str = str[1].split(' ');
    let result = '';
    
    for (let i=0; i<Math.trunc(str.length/2); i++)
        [str[i], str[str.length-i-1]] = [str[str.length-i-1], str[i]];
    for (let key of str) result = result + key + ' ';
    console.log(result);
  });


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        Console.ReadLine();
        string[] ints =Console.ReadLine().Split();
        Array.Reverse(ints);
       foreach(string i in ints)
        Console.Write(i+" ");
    }
}


# java
import java.util.*;

class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int number = input.nextInt();
        Integer[] array = new Integer[number];

        for (int a = 0; a < number; a++) {
            array[a] = input.nextInt();
        }

        Collections.reverse(Arrays.asList(array));

        Arrays.stream(array).forEach(e -> System.out.print(e + " "));
    }
}


# C
#include <stdio.h>
int main() {
    int n, m[(scanf("%d",&n),n)];
    for (int *p=m; p<m+n; scanf("%d",p++));
    for (int x, i=0; i<n/2; x=m[i], m[i]=m[n-i-1], m[n-i-1]=x, ++i);
    for (int *p=m; p<m+n; printf("%d ",*p), ++p);
    return 0;
}


# C++
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int n, tmp;
    cin >> n;
    vector <int> w(n);
    
    for (int i = 0; i < n; i++) {
        cin >> w[i];
    }
    
    for (int i = 0; i < n/2; i++) {
        tmp = w[i];
        w[i] = w[n-i-1];
        w[n-i-1] = tmp;
    }
    for (int i = 0; i < n; i++) {
        cout << w[i] << ' ';
    }
    return 0;
}


