Шеренга

Петя впервые пришел на урок физкультуры в новой школе. Перед началом урока ученики выстраиваются по росту, в порядке невозрастания. Напишите программу, которая определит на какое место в шеренге Пете нужно встать, чтобы не нарушить традицию, если заранее известен рост каждого ученика и эти данные уже расположены по невозрастанию (то есть каждое следующее число не больше предыдущего). Если в классе есть несколько учеников с таким же ростом, как у Пети, то программа должна расположить его после них.

Входные данные
Сначала задано число N — количество учеников (не считая Петю) (1 ≤ N ≤ 100). C новой строки, через пробел, записаны N чисел — элементы массива. Массив состоит из натуральных чисел, не превосходящих 200 (рост учеников в сантиметрах). Затем, на новой строке, вводится рост самого Пети.

Выходные данные
Необходимо вывести единственное число - номер Пети в шеренге (не индекс массива).

Sample Input:
8
165 163 160 160 157 157 155 154
162

Sample Output:
3

Напишите программу. Тестируется через stdin → stdout
Верно решил 451 учащийся
Из всех попыток 33% верных


# ruby
n = gets.to_i
a = gets.chomp.split().map{|j| j.to_i}
h = gets.to_i
#a=[-7, 4, 11, 15, 18, 23]
cnt = 1
a.sort

a.each do |v|   
    if h > v
        cnt += 1        
    end    
end
puts n + 1 - cnt + 1


# python
n = int(input())
heights = list(map(int, input().split()))
petr_height = int(input())
pos = sum(petr_height <= height for height in heights) + 1
print(pos)


# JS
process.stdin.resume();
process.stdin.setEncoding("ascii");

let inputStdin = "";
let inputStdinArray = "";
let inputCurrentline = 0;

process.stdin.on("data", function (data) {
  inputStdin += data;
});

process.stdin.on("end", function () {
  inputStdinArray = inputStdin.split("\n");
  main();
});

function readLine() {
  return inputStdinArray[inputCurrentline++];
}
//Решение:
function main() {
    const N = readLine();
    const n = readLine();
    const arr = n.split(' ').map(Number);
    const Petya = readLine();
      for (let i = 0; i < arr.length; i++) {
        if (Petya > arr[i]) {
          console.log(i + 1);
          break;
        } if (Math.min(...arr) >= Petya) {
          console.log(arr.length + 1);
          break;
        };
      };
};


# C#
using System;
using System.Collections.Generic;

public class MainClass
{
    public static void Main()
    {
        int n=int.Parse(Console.ReadLine());
        var num=new List<int>(Array.ConvertAll(Console.ReadLine(). Split(), int.Parse));
        int height=int.Parse(Console.ReadLine());
        for(int i=0;i<n;i++)
        {
            if(num[i]<height)
            {
                Console.WriteLine(i+1);
                break;
            }
            else{if(i==n-1) Console.WriteLine(n+1);}
        }        
    }
}


# java
import java.util.*;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        scanner.nextLine();
        int pos = 1;
        int[] arr = Arrays.stream(scanner.nextLine().split(" "))
                .mapToInt(Integer::parseInt)
                .toArray();
        int petya = scanner.nextInt();

        for (int e : arr) {
            pos += petya <= e ? 1 : 0;
        }
        
        System.out.print(pos);
    }
}


# C 
#include <inttypes.h>
#include <stdio.h>

int main() {
    size_t N = 0;
    scanf("%zu", &N);
    int64_t arrin[N];
    for (size_t i = 0; i < N; i++)
        scanf("%"SCNd64, &arrin[i]);
    
    int64_t X = 0;
    size_t Xpos = N + 1;
    scanf("%"SCNd64, &X);
    for (size_t i = 0; i < N; i++)
        if (X > arrin[i]) {
            Xpos = i + 1;
            break;
        }

    printf("%zu", Xpos);
    return 0;
}


# C++
#include <iostream>
using namespace std;

int main()
{
    int N, count = 1;
    cin >> N;
    int array[N];
    for(int i = 0; i < N; i++)
        cin >> array[i];
    int num;
    cin >> num;
    for(int i = 0; i < N; i++)
        if(num <= array[i])
            count++;
    cout << count;
    return 0;
}


