Количество различных элементов в монотонном массиве

Дан массив, состоящий из целых чисел. Известно, что числа упорядочены по неубыванию (то есть каждый следующий элемент не меньше предыдущего). 
Напишите программу, которая определит количество различных чисел в этом массиве.

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 100). Далее через пробел записаны N чисел — элементы массива. 
Массив состоит из целых чисел, находящихся в пределах от -231-1 до 231-1

Выходные данные
Необходимо вывести единственное число - количество различных чисел в массиве.

Sample Input:
5
1 1 1 1 1

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 535 учащихся
Из всех попыток 68% верных


# ruby
n=gets.to_i
a = gets.chomp.split().map{|j| j.to_i}
#a=[-7, 4, 11, 15, 18, 23]
cnt = 1

a.each_cons(2) do |v|   
    if v[0] < v[1]
        cnt += 1        
    end    
end
p cnt 


# python
n = int(input())
lst = list(map(int, input().split()))
d = {el: 0 for el in lst}

print(len(d))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let my_set = new Set(str[1].split(' ')); 
    console.log(my_set.size); 
});


# С#
using System;
using System.Collections.Generic;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        Console.ReadLine();
        Console.WriteLine(new HashSet<string>(Console.ReadLine().Split()).Count);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v= new Scanner(System.in);
int n=v.nextInt(),max=0,chet=1;
int[]vv=new int[n];
for(int i=0;i<n;i++){
vv[i]=v.nextInt();
if(i==0){max=vv[i];}
else{if(max<vv[i]){max=vv[i];chet++;}}}
System.out.println(chet);        

    }
}


# C 
#include <inttypes.h>
#include <stdio.h>

int main() {
    size_t N = 0;
    scanf("%zu", &N);

    double arrin[N];
    for (size_t i = 0; i < N; i++)
        scanf("%lf", &arrin[i]);

    double beacon = -2e32;
    size_t count = 0;
    for (size_t i = 0; i < N; i++) {
        if (arrin[i] > beacon) {
            beacon = arrin[i];
            count++;
        }
    }

    printf("%zu", count);
    return 0;
}


№ С++
#include <iostream>
#include <set>
using namespace std;

int main() {
    set<int> values;
    int length; cin >> length;
    for (int i = 0; i < length; i++) {
        int value; cin >> value;
        values.insert(value);
    }
    cout << values.size();
    return 0;
}







