Вывести четные элементы

Дан массив, состоящий из целых чисел. Напишите программу, которая выводит те элементы массива, которые являются чётными числами.

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 100). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести все четные элементы массива (то есть те элементы, которые являются четными числами). Числа следует выводить через пробел.

Sample Input:
5
1 2 3 4 5

Sample Output:
2 4

Напишите программу. Тестируется через stdin → stdout
Верно решили 707 учащихся
Из всех попыток 62% верных


# ruby
n=gets.to_i
a = gets.chomp.split()

a.each do |i|     
    if (i.to_i%2) == 0
        print "#{i} " 
    end     
end  


# python
input()
print(*filter(lambda x: not x & 1, map(int, input().split())))


# JS
let arr = require('fs').readFileSync(0, 'utf8').split('\n')[1].split(' ').map(Number);
let res = arr.filter(item => !(item&1)).join(' ');
console.log(res);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        var n = Console.ReadLine();
        int[] arr = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        
        for(int i = 0; i < arr.Length; ++i)
        {
            if(arr[i] % 2 == 0) Console.Write($"{arr[i]} ");
        }
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int [] arr = new int [sc.nextInt()];
        for (int i = 0; i < arr.length; i++) {
            arr[i] = sc.nextInt();
            System.out.print(arr[i]%2 == 0 ? arr[i] + " " : "");
        }
        sc.close();
    }
}


# C
#include <stdio.h>
int main() {
    for (int n, m[(scanf("%d",&n),n)], i=0; i<n; scanf("%d",&m[i]), m[i]%2 ? 0 : printf("%d ",m[i]), ++i);
    return 0;
}


# C++
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int n;
    cin >> n;
    vector <int> a(n);
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    
    for (int i = 0; i < n; i++) {
        if (a[i] % 2 == 0) {
            cout << a[i] << " ";
        }
    }
    return 0;
}



