Количество положительных элементов

Дан массив, состоящий из целых чисел. Напишите программу, которая подсчитывает количество положительных чисел среди элементов массива.

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 10000). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо единственное число - количество положительных элементов в массиве.

Sample Input:
5
1 2 3 -1 -4

Sample Output:
3

Напишите программу. Тестируется через stdin → stdout
Верно решили 757 учащихся
Из всех попыток 70% верных


# ruby
n=gets.to_i
a = gets.chomp.split()
k = 0
a.each do |i|     
    if i.to_i > 0
        k += 1
    end     
end 
p k 


# python
input()
print(sum(i > 0 for i in map(int, input().split())))


# JS
let arr = require('fs').readFileSync(0, 'utf8').split('\n')[1].split(' ').map(Number);
let res = arr.filter(item => item > 0).length;
console.log(res);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        var n = Console.ReadLine();
        int[] arr = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        int counter = 0;
        
        foreach(int i in arr)
        {
            if(i > 0) ++counter;
        }
        
        Console.WriteLine(counter);
    }
}


# java
import java.util.*;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        scanner.nextLine();
        System.out.println(Arrays.stream(scanner.nextLine()
                .split(" "))
                .mapToInt(Integer::parseInt)
                .filter(value -> value > 0)
                .count());
    }
}


# C
#include <stdio.h>
int f(int* array, int* limit)
{
    int* current = array;
    int count=0;
    for(current; current<limit; current=current+1)
    {
        scanf("%d", current);
        if(*current>0)
        {
               count++;
        }
    }
    printf("%d", count);
}



int main() {
    int n;
    scanf("%d",&n);
    int arr[n];
    f(arr,arr+n);
    return 0;
}


# C++
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int n, positives = 0;
    cin >> n;
    vector <int> a(n);
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    
    for (int i = 0; i < n; i++) {
        if (a[i] > 0) {
            positives++;
        }
    }
    cout << positives;
    return 0;
}


