Количество элементов больших обоих соседей

Дан массив, состоящий из целых чисел. Напишите программу, которая в данном массиве определит количество элементов, у которых два соседних и, при этом, оба соседних элемента меньше данного.

Входные данные
Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 100). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести количество элементов массива, у которых два соседа и которые при этом строго больше обоих своих соседей.

Sample Input:
5
1 2 3 4 5

Sample Output:
0

Напишите программу. Тестируется через stdin → stdout
Верно решили 626 учащихся
Из всех попыток 59% верных



# ruby
n=gets.to_i
a = gets.chomp.split()
cnt = 0
a.each_cons(3) do |v|
    if v[0].to_i < v[1].to_i and v[1].to_i > v[2].to_i
        cnt += 1 
    end    
end
p cnt


# python
n = int(input())
lst = list(map(int, input().split()))
print(sum(lst[i] > lst[i - 1] and lst[i] > lst[i + 1] for i in range(1, n - 1)))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    str = str[1].split(' ');
    let result = 0;
    
    for (let i=1; i<str.length-1; i++)
        if ( +str[i] > +str[i-1] && +str[i] > +str[i+1]) result++;
    console.log(result);
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
        var n = Console.ReadLine();
        int[] arr = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        int count = 0;
        
        for(int i = 1; i < arr.Length-1; ++i)
        {
            if((arr[i] > arr[i+1]) && (arr[i] > arr[i-1]))
            {
                ++count;
            }
        }
        
        Console.WriteLine(count);
    }
}


# java
import java.util.*;

class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int number = Integer.parseInt(input.nextLine());
        int[] array = Arrays.stream(input.nextLine().split("\\s+")).mapToInt(Integer::parseInt).toArray();

        int counter = 0;

        for (int a = 1; a < number - 1; a++) {
            if(array[a - 1] < array[a] && array[a + 1] < array[a]) counter++;
        }

        System.out.println(counter);
    }
}


# C
#include <stdio.h>
int main() {
    int n, m[(scanf("%d",&n),n)], c=0;
    for (int i=0; i<n; scanf("%d",&m[i]), i>1 ? c+=(m[i-2]<m[i-1] && m[i-1]>m[i]) : 0, ++i);
    printf("%d\n", c);
    return 0;
}


# C++
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int n, res = 0;
    cin >> n;
    vector <int> a(n);
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    
    for (int i = 1; i < n-1; i++) {
        if (a[i - 1] < a[i] && a[i] > a[i+1]) {
            res++;
        }
    }
    cout << res;    
    return 0;
}



