Циклический сдвиг вправо

Напишите программу, которая циклически сдвигает элементы массива вправо (например, если элементы нумеруются, начиная с нуля, то 0-й элемент становится 1-м, 1-й становится 2-м, ..., последний становится 0-м, то есть массив {3, 5, 7, 9} превращается в массив {9, 3, 5, 7}).

Входные данные

Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 35). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные

Необходимо вывести массив, полученный после сдвига элементов. Числа следует выводить через пробел.

Sample Input:

6
4 5 3 4 2 3
Sample Output:

3 4 5 3 4 2
Напишите программу. Тестируется через stdin → stdout
Верно решили 529 учащихся
Из всех попыток 67% верных


# ruby
n=gets.to_i
a = gets.chomp.split()
a1 = [a[-1]]
a.each do |i|    
    a1.push(i)    
end 
a1.pop   
a = a1
print a.join(" ") 

# python
n = int(input())
lst = list(map(int, input().split()))
new_lst = lst[-1:] + lst[:-1]
print(*new_lst)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let str = d.toString().split('\n');
    let a = str[1].lastIndexOf(' ');
    let result = str[1].slice(a+1)+' '+str[1].slice(0,a) ;
    console.log(result);
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        int[] arr = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        
        // replace
        int temp = arr[n - 1];
        
        for(int i = 0; i < n; ++i)
        {
            var tempF = arr[i];
            arr[i] = temp;
            temp = tempF;
        }
        
        // print
        foreach(int i in arr)
        {
            Console.Write($"{i} ");
        }
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
int n=v.nextInt(),vrem=0;
int[] vv =new int[n];
for(int i=0;i<n;i++){
vv[i]=v.nextInt();
if(i==n-1){
    for(int j=0;j<n-1;j++){
     vrem=vv[j];
     vv[j]=vv[n-1];
     vv[n-1]=vrem;}}}
for(int i=0;i<n;i++){
System.out.print(vv[i]+" ");}    
         
        // put your code here
    }
}


# C
#include <stdio.h>
int main() {
    int n, m[(scanf("%d",&n),n)];
    for (int i=0; i<n; scanf("%d",&m[i]), ++i);
    for (int i=n, x=m[n-1]; i || (m[0]=x,0); m[i]=m[i-1], --i); 
    for (int i=0; i<n; printf("%d ",m[i]), ++i);
    return 0;
}


# C++
#include <iostream>
#include <deque>
using namespace std;

int main() {
    int n, el;
    deque <int> a;
    cin >> n;

    for (int i=0; i<n-1; i++)
    {
        cin >> el;
        a.push_back(el);
    }
    
    cin >> el;
    a.push_front(el);
    
    for (int i=0; i<n; i++)
        cout << a[i] << " ";
    
    return 0;
}


