Кролики

Существует так называемый принцип Дирихле, который можно сформулировать следующим образом:

Некоторое число кроликов равномерно рассажено в клетках. Если число кроликов больше, чем число клеток, то хотя бы в одной из клеток будет больше одного кролика.

В данной задаче мы рассмотрим более общий случай этого классического математического факта. Пусть есть n клеток и m зайцев, которых рассадили по этим клеткам. Вам требуется расcчитать максимальное количество зайцев, которое гарантированно окажется в одной клетке.

Входные данные
В первой строке входного файла записаны два натуральных числа n и m (1 ≤ n, m ≤ 109).

Выходные данные
В выходной файл выведите ответ на задачу.

Sample Input:
2 3

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 352 учащихся
Из всех попыток 42% верных


# ruby
n, m = gets.split(' ').map { |i| i.to_i }
puts (m/n.to_f).ceil


# python
n, m = map(int, input().split())
print((m + n - 1) // n)


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split(' ');
    let [n, m] = data;
    n = +n;
    m = +m;
    let result = Math.trunc( m/n );
    if ( m%n !== 0 ) result++;
    console.log(result);
  });

  
# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
       var num = Console.ReadLine().Split(' ').Select(x=>int.Parse(x)).ToArray();
        int res = 0;
        res = num[1]/num[0];
        if(num[1]%num[0]>0)
            res++;
        Console.WriteLine(res);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        int m = sc.nextInt();
        sc.close();
        
        System.out.print((m/n + (m%n ==0 ? 0 : 1)));
    }
}


# C
#include <stdio.h>
int main() {
    for (int n,m; scanf("%d%d",&n,&m)==2; printf("%d\n",(m+n-1)/n));
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, m;
    std::cin >> n >> m;
    std::cout << (m + n - 1) / n << "\n";
    return 0;
}


