Часовая стрелка

Часовая стрелка повернулась с начала суток на d градусов. Определите, сколько сейчас целых часов h и целых минут m.

Входные данные
На вход программе подается целое число d (0 ≤ d < 360).

Выходные данные
Выведите на экран фразу:

It is ... hours ... minutes.

Вместо многоточий программа должна выводить значения h и m, отделяя их от слов ровно одним пробелом.

Sample Input:
90

Sample Output:
It is 3 hours 0 minutes.

Напишите программу. Тестируется через stdin → stdout
Верно решили 583 учащихся
Из всех попыток 44% верных


# ruby
d = gets.to_i
#360 - 12
#d - x
#d = 15
h = (12 * d) / 360

#30g - 5m
#6g - 1m

d_left = d - (h * 360 / 12)
#d - x
m = d_left * 2
#m = d_left
print "It is #{h} hours #{m} minutes."
#puts s


# python
d = int(input())
print(f'It is {d // 30} hours {(d % 30) * 2} minutes.')


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let k = +d;
    let [h,m] = [0, 0];
    
    m = 2*k;
    h = Math.trunc(m/60);
    m = m%60;
    
    console.log('It is '+h+' hours '+m+' minutes.');
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int d = int.Parse(Console.ReadLine());
        int m = d * 2;
        int h = m / 60;
        m %= 60;
        Console.WriteLine($"It is {h} hours {m} minutes.");
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        int n = in.nextInt();
        System.out.printf("It is %d hours %d minutes.", n / 30, n % 30 * 2);
    }
}


# C
#include <stdio.h>
int main() {
    for (unsigned d; scanf("%u",&d)==1; printf("It is %u hours %u minutes.", d/30, d%30*2));
    return 0;
}


# C++
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    n *= 2;
    std::cout << "It is " << n / 60 << " hours " << n % 60 << " minutes.\n";
    return 0;
}






