k-я секунда суток

Идёт k-я секунда суток. Определите, сколько целых часов h и целых минут m прошло с начала суток. Например, если
k=13257=3⋅3600+40⋅60+57,
то h=3 и m=40.

Входные данные
На вход программе подается целое число k (0 ≤ k ≤ 86399).

Выходные данные
Выведите на экран фразу:

It is ... hours ... minutes.

Вместо многоточий программа должна выводить значения h и m, отделяя их от слов ровно одним пробелом.

Sample Input:
13257

Sample Output:
It is 3 hours 40 minutes.
Напишите программу. Тестируется через stdin → stdout
Верно решили 712 учащихся
Из всех попыток 74% верных



# ruby
k = gets.to_i
#k = h * 3600 + m * 60 + 57
h = k / 3600
m = (k - h * 3600) / 60
#s = k - (h * 3600 + m * 60) 
print "It is #{h} hours #{m} minutes."
#puts s


# python
k = int(input())
print(f'It is {k // 3600} hours {(k % 3600) // 60} minutes.')


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(l) {
    let k = +l;
    let [ h,m ] = [0, 0];
    h = Math.floor( k / 3600 );
    k = k - h * 3600;
    m = Math.floor( k / 60);

    console.log(`It is ${h} hours ${m} minutes.`);
  });

  
# C#
using System;

public class MainClass
{
    public static void Main()
    {
       int k = int.Parse(Console.ReadLine());
       int h=k/3600;
       k%=3600;
       int m=k/60;
        Console.WriteLine($"It is {h} hours {m} minutes.");
    }
}


# java
import java.util.Scanner;
import java.util.concurrent.TimeUnit;

class Main {
    public static void main(String[] args) {
        try (Scanner scanner = new Scanner(System.in)) {
            int seconds = scanner.nextInt();
            int hours = ((int) (TimeUnit.SECONDS.toHours(seconds) % 24));
            long minutes = ((int) (TimeUnit.SECONDS.toMinutes(seconds) % 60));

            System.out.printf("It is %d hours %d minutes.%n", hours, minutes);
        }
    }
}

# C
#include <stdio.h>
int main() {
    for (int k; scanf("%d",&k)==1; printf("It is %d hours %d minutes.", k/3600, k%3600/60));
    return 0;
}


# C++
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    std::cout << "It is " << n / 3600 << " hours " << n % 3600 / 60 << " minutes.\n";
    return 0;
}



