Без циклов

В книге на одной странице помещается k строк. Таким образом, на 1-й странице печатаются строки с 1-й по k-ю, на второй — с (k+1)-й по (2k)-ю и т. д. Напишите программу, по номеру строки в тексте определяющую номер страницы, на которой будет напечатана эта строка, и порядковый номер этой строки на странице.

Входные данные
На вход программе подаются число k — количество строк на странице и число n — номер строки в тексте (1 ≤ k ≤ 200, 1 ≤ n ≤ 20000).

Выходные данные
Выведите два числа — номер страницы, на которой будет напечатана эта строка, и номер строки на этой странице

Для считывания данных на языке Python 3 можно использовать следующую конструкцию:

k, n = map(int, input().split())

Sample Input:
50 1

Sample Output:
1 1

Напишите программу. Тестируется через stdin → stdout
Верно решили 468 учащихся
Из всех попыток 34% верных

# ruby
k, n = gets.split.map{|str| str.to_i}
#k,n = 5, 11
if k > n
    npage = 1
    nstring = n
elsif n % k == 0
    npage = n/k
    nstring = k
else
    npage = n/k + 1
    nstring = n%k
end    

print "#{npage} #{nstring}"


# python
k, n = map(int, input().split())
print((n - 1) // k + 1, (n - 1) % k + 1)


# JS
const [k, n] = require('fs').readFileSync(0, 'utf8').split(" ")

const string = n % k || k
const page = Math.ceil(n / k)
console.log(page, string)


# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        var num = Console.ReadLine().Split(' ').Select(x=>int.Parse(x)).ToArray();
        int s=num[1]/num[0];
        Console.WriteLine((num[1]%num[0]!=0)? $"{s+1} {num[1]%num[0]}":$"{s} {num[0]}");
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int k = sc.nextInt();
        int n = sc.nextInt();
        sc.close();
        
        System.out.print(((n-1)/k+1) + " " + ((n-1)%k+1));
    }
}


# C
#include <stdio.h>

int main() {
    int k = 0, n = 0;
    scanf("%d %d", &k, &n);
    printf("%d %d", 1 + n / k - (n % k == 0), n % k + (k * (n % k == 0)));
    return 0;
}


# C++
#include <iostream>

int main() {
    int k, n;
    std::cin >> k >> n;
    std::cout << n / k + (n % k != 0) << " " << n % k + (n % k == 0) * k << "\n";
    return 0;
}



