Два момента времени

Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, потом минуты и секунды для каждого из моментов времени. Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.

Входные данные
В первой строке входных данных находятся три целых числа — часы, минуты и секунды первого момента времени. Во второй строке — три числа, характеризующие второй момент времени. Число часов лежит в диапазоне от 0 до 23, число минут и секунд — от 0 до 59.

Выходные данные
Выведите число секунд между двумя моментами времени.

Sample Input:
1 1 1
2 2 2

Sample Output:
3661

Напишите программу. Тестируется через stdin → stdout
Верно решили 534 учащихся
Из всех попыток 76% верных


# ruby
h1, m1, s1 = gets.split.map{|str| str.to_i}
h2, m2, s2 = gets.split.map{|str| str.to_i}
#puts h1, m1, s1, h2, m2, s2
t1 = h1*3600 + m1*60 + s1
t2 = h2*3600 + m2*60 + s2
#puts t1, t2
puts t2 - t1 


# python
h1, m1, s1, h2, m2, s2 = *map(int, input().split()), *map(int, input().split())
print((h2 * 3600 + m2 * 60 + s2) - (h1 * 3600 + m1 * 60 + s1))


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let data = d.toString().split('\n');
    let [h1, m1, s1] = data[0].split(' ');
    let [h2, m2, s2] = data[1].split(' ');
    
    let result = (h2-h1)*3600+(m2-m1)*60+(s2-s1);
    console.log(result);
  });

  
# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        var time1 = Console.ReadLine().Split(' ').Select(x=>int.Parse(x)).ToArray();
        var time2 = Console.ReadLine().Split(' ').Select(x=>int.Parse(x)).ToArray();
        Console.WriteLine($"{(time2[0]*3600+time2[1]*60+time2[2])-(time1[0]*3600+time1[1]*60+time1[2])}");
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.print(-1*(sc.nextInt()*3600 + sc.nextInt()*60 + sc.nextInt()) + (sc.nextInt()*3600 + sc.nextInt()*60 + sc.nextInt()));
    }
}


# C
#include <stdio.h>

int main() {
    int h1, m1, s1, h2, m2, s2;
    scanf("%d %d %d %d %d %d", &h1, &m1, &s1, &h2, &m2, &s2);
    printf("%d", (h2 - h1) * 3600 + (m2 - m1) * 60 + (s2 -s1));
    return 0;
}


# C++
#include <iostream>

int main() {
    int h1, m1, s1, h2, m2, s2, seconds1, seconds2;
    std::cin >> h1 >> m1 >> s1 >> h2 >> m2 >> s2;
    seconds1 = (h1 * 60 + m1) * 60 + s1;
    seconds2 = (h2 * 60 + m2) * 60 + s2;
    std::cout << seconds2 - seconds1 << "\n";
    return 0;
}


