Сумма от 1 до N

Сумму всех целых чисел от 1 до 100 можно посчитать при помощи хитрого приема. 
Разобьем все числа по парам 1 и 100, 2 и 99, 3 и 98 и т.д. 
Сумма каждой пары 101. Пар всего 100 пополам (50). Поэтому сумма равна (1+100)∗100 / 2
Для нечетного количества слагаемых работает та же формула: например, 1+2+3= (1+3)∗3 / 2 = 6

Входные данные
Одно целое число N. Гарантируется, что ответ "помещается" в тип int64 (Паскаль) / long long (в Си) / long (в Java).

Выходные данные
Одно число – сумма всех целых чисел от 1 до N.

Sample Input:
100

Sample Output:
5050


Напишите программу. Тестируется через stdin → stdout
Верно решили 609 учащихся
Из всех попыток 45% верных


# ruby
def sum_one_to_v (v) 
    v.to_i
    if v%2 == 0
        v = (1+v)*v/2
    else
        v = ((1+v)*v)/2   
    end
    v.to_i
end

n = gets.to_i
puts sum_one_to_v(n)


# python
n = int(input())
print((n * (n + 1)) // 2)


# JS 
// put your javascript (node.js) code here
const prompt = (function() {
  const lines = require('fs').readFileSync(0, 'utf8').split('\n');
  return function() {
    if (lines.length > 0)
      return lines.shift()
    const error = Error('EOF when reading a line');
    error.name = 'EOFError';
    throw error;
  }
})();

let num = BigInt(prompt());
let res = (1n + num) * num / 2n;
console.log(String(res));


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        long n = long.Parse(Console.ReadLine());
        long res = ((1+n)*n)/2 ;
        Console.WriteLine(res);
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        long n = in.nextInt();
        System.out.println((1 + n) * n / 2);
    }
}

# C
#include <stdio.h>
int main() {
    for (unsigned long long n; scanf("%llu",&n)==1; printf("%llu\n",(1+n)*n/2));
    return 0;
}


# C++
#include <iostream>

int main() {
    long long n;
    std::cin >> n;
    std::cout << (n + 1) * n / 2 << "\n";
    return 0;
}






