Обмен значений

Напишите программу, которая считывает значения двух целочисленных переменных a и b, затем меняет их значения местами (то есть в переменной a должно быть записано то, что раньше хранилось в b, а в переменной b записано то, что раньше хранилось в a). Затем выведите значения переменных.

Входные данные
Вводятся целые числа a и b.

Выходные данные
Выведите ответ на задачу.

Sample Input:
8
5

Sample Output:
5 8

Напишите программу. Тестируется через stdin → stdout
Верно решили 2 052 учащихся
Из всех попыток 79% верных


# ruby
b, a = gets.to_i, gets.to_i
print a, ' ', b


# python
a, b = input(), input(); print(b, a)


# JS
let [a, b] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log(b, a);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int a = int.Parse(Console.ReadLine());
        int b = int.Parse(Console.ReadLine());
        int c = a;
        a = b;
        b = c;
        Console.WriteLine($"{a} {b}");
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        replace();
    }

    public static void replace() {
        Scanner sc = new Scanner(System.in);
        int a = sc.nextInt();
        int b = sc.nextInt();
        int c;
        c = a;
        a = b;
        b = c;
        System.out.printf("%d %d", a, b);
    }
}


# C
#include <stdio.h>

int main() {
    int a, b; 
    scanf("%d %d", &a, &b);
    
    swap_int(&a, &b);
    
    printf("%d %d\n", a, b);
    return 0;
}

void swap_int(int *a, int *b) {
    int t = *a;
    *a = *b;
    *b = t;
}


# C++
#include <iostream>

int main() {
    int a, b;
    std::cin >> a >> b;
    std::cout << b << " " << a << "\n";
    return 0;
}






