Стоимость покупки

Пирожок в столовой стоит a рублей и b копеек. Определите, сколько рублей и копеек нужно заплатить за n пирожков.

Входные данные
Программа получает на вход три числа: a, b, n.

Выходные данные
Программа должна вывести два числа: стоимость покупки в рублях и копейках.

Sample Input:
10
15
2

Sample Output:
20 30

Напишите программу. Тестируется через stdin → stdout
Верно решили 1 729 учащихся
Из всех попыток 61% верных


# ruby
a, b, n,  = gets.to_i, gets.to_i, gets.to_i
cop = n * (a * 100 + b)
print cop/100, ' ', cop%100 


# python
a, b, n = (int(input()) for _ in "123")
total = (a * 100 + b) * n
print(total // 100, total % 100)


# JS
let [a, b, n] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
let total = (a * 100 + b) * n;
console.log(Math.floor(total / 100), total % 100);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int a = int.Parse(Console.ReadLine());
        int b = int.Parse(Console.ReadLine());
        int n = int.Parse(Console.ReadLine());
        Console.WriteLine($"{a * n + b * n / 100} {b * n % 100}");
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int a = scanner.nextInt();
        int b = scanner.nextInt();
        int n = scanner.nextInt();
        int total = n * (a * 100 + b);
        System.out.println(total / 100 + " " + total % 100);
    }
}


# C
#include <stdio.h>

int main() {
    int a, b, n;
    scanf("%d %d %d", &a, &b, &n);
    
    b = n * (a * 100 + b);
    printf("%d %d\n", b / 100, b % 100);
    return 0;
}


# C++
#include <iostream>

int main() {
    int a, b, n, cop;
    std::cin >> a >> b >> n;
    
    cop = n * (a * 100 + b);   
    
    std::cout << cop/100 << " " << cop%100 << "\n";
    return 0;
}