Число десятков

Дано неотрицательное целое число. Найдите число десятков в его десятичной записи (то есть вторую справа цифру его десятичной записи).

Входные данные
Вводится неотрицательное целое число.

Выходные данные
Выведите ответ на задачу.

Sample Input:
123

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 2 586 учащихся
Из всех попыток 72% верных


# ruby
puts gets.to_i.abs%100/10


# python
print(input()[-2])


# JS
let n = Number(require('fs').readFileSync(0, 'utf8'));
console.log(Math.floor(n / 10) % 10);


# C#
using System;
using static System.Console;

public class MainClass
{
    public static void Main()
    {
        var num = ReadLine();
        WriteLine(num[num.Length - 2]);
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int value = sc.nextInt();
        System.out.println(value / 10 % 10);
    }
}


# C
#include <stdio.h>

int main() {
int a, b;
scanf("%d", &a);
while(a > 99)
{
    a = a - 100;
}
    printf("%d", a/10);
}


# C++
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    std::cout << abs(n) / 10 % 10 << "\n";
    return 0;
}




