Дележ яблок - 2

N школьников делят K яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок останется в корзинке?

Входные данные
Программа получает на вход числа N и K.

Выходные данные
Программа должна вывести искомое количество яблок.

Sample Input:
5
21

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решил 3 281 учащийся
Из всех попыток 81% верных


# ruby
k = gets.to_i
puts gets.to_i % k


# python
n, k = int(input()), int(input())
print(k % n)


# JS
let [n, k] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log(k % n);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = Convert.ToInt32(Console.ReadLine());
        int k = Convert.ToInt32(Console.ReadLine());
        Console.WriteLine(k % n);
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);

        int countStudents = sc.nextInt();
        int countApples = sc.nextInt();
        sc.close();

        int result = getCountRemainApples(countStudents, countApples);
        System.out.println(result);
    }

    public static int getCountRemainApples(int countStudents, int countApples) {
        if (countStudents == 0) {
            return countApples;
        }
        return countApples % countStudents;
    }
}


# C
#include <stdio.h>

int main()
{
    int N, K;
    scanf("%d %d", &N, &K);
    printf("%d", K % N);
    return 0;
}



# C++
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    int a, b;
    cin >> a >> b;
    cout << b%a << endl;
    return 0;
}


