Электронные часы - 2

Электронные часы показывают время в формате h:mm:ss, то есть сначала записывается количество часов, потом обязательно двузначное количество минут, затем обязательно двузначное количество секунд. Количество минут и секунд при необходимости дополняются до двузначного числа нулями.

С начала суток прошло n секунд. Выведите, что покажут часы.

Входные данные
Вводится целое число n.

Выходные данные
Выведите ответ на задачу, соблюдая требуемый формат.

Sample Input:
3602

Sample Output:
1:00:02

Напишите программу. Тестируется через stdin → stdout
Верно решили 1 662 учащихся
Из всех попыток 35% верных


# ruby
n = gets.to_i

#h
h = (n / 3600) % 24
n %= 3600

#mm
mm = n / 60
m1 = mm / 10 
m2 = mm % 10
n %= 60 

#ss
ss = n
s1 = ss / 10 
s2 = ss % 10

puts "#{h}:#{m1}#{m2}:#{s1}#{s2}"


# python
seconds = int(input())
print(f'{(seconds // 3600) % 24}:{str((seconds // 60) % 60).zfill(2)}:{str(seconds % 60).zfill(2)}')


# JS
let n = Number(require('fs').readFileSync(0, 'utf8'));
let hours = Math.floor(n / 3600) % 24;
let minutes = Math.floor(n / 60) % 60;
let seconds = n % 60;
console.log(`${hours}:${minutes.toString().padStart(2, "0")}:${seconds.toString().padStart(2, "0")}`)


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int number = int.Parse(Console.ReadLine());
        int hour = number / 3600 % 24;
        int minute = number / 60 % 60;
        int second = number % 60;
        Console.WriteLine($"{hour}:{minute / 10}{minute % 10}:{second / 10}{second % 10}");
    }
}


# java
import java.util.Scanner;
class Main {    
    public static void main(String[] args) {
    Scanner scan = new Scanner(System.in);
        int x = scan.nextInt();    
        int hour = x/3600;
        int minute = (x/60-hour*60);
        int second = (x-(minute*60+hour*3600));
        hour = hour%24;
        System.out.printf("%d:%02d:%02d", hour,minute,second);
    }
}


# C
#include <stdio.h>

int main() {
    int h, m, s; scanf("%d", &s);
    
    h = s / 3600 % 24;
    m = s % 3600 / 60;
    s = s % 60;
    
    printf("%d:%02d:%02d\n", h, m, s);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, h, m, mm, m1, m2, ss, s1, s2;

    //n
    std::cin >> n;

    //h
	h = (n / 3600) % 24;
	n %= 3600;

	//mm
	mm = n / 60;
	m1 = mm / 10; 
	m2 = mm % 10;
	n %= 60;

	//ss
	ss = n;
	s1 = ss / 10; 
	s2 = ss % 10;

    std::cout << h << ":" << m1 << m2 << ":" <<  s1 << s2 << "\n";
    return 0;
}    



