Последняя цифра

Дано натуральное число. Выведите его последнюю цифру.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Sample Input:
176

Sample Output:
6

Напишите программу. Тестируется через stdin → stdout
Верно решили 2 778 учащихся
Из всех попыток 79% верных

# ruby
puts gets[-1]


# python
print(int(input()) % 10)


# JS
let n = Number(require('fs').readFileSync(0, 'utf8'));
console.log(n % 10);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = Convert.ToInt32(Console.ReadLine());
        Console.WriteLine(n % 10);
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
         Scanner scan = new Scanner(System.in);
        int num = scan.nextInt();
        System.out.println(num % 10);
    }
}


# C
#include <stdio.h>

int main() {
    int n; scanf("%d", &n);
    return printf("%d", n % 10) && 0;
}


# C++
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    std::cout << n % 10 << "\n";
    return 0;
}
