МКАД

Длина Московской кольцевой автомобильной дороги — 109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час. На какой отметке он остановится через t часов?

Входные данные
Программа получает на вход значения v и t. Если v>0, то Вася движется в положительном направлении по МКАД, если же значение v<0, то в отрицательном.

Выходные данные
Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.

Sample Input 1:
60
2

Sample Output 1:
11

Sample Input 2:
-1
1

Sample Output 2:
108

Напишите программу. Тестируется через stdin → stdout
Верно решили 2 270 учащихся
Из всех попыток 26% верных


# ruby
puts gets.to_i*gets.to_i%109


# python
v, t = int(input()), int(input())
print((v * t) % 109)


# JS
let [v, t] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
s = v >= 0 ? (v * t) % 109 : 109 - (Math.abs(v) * t) % 109;
console.log(s)


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int v = int.Parse(Console.ReadLine());
        int t = int.Parse(Console.ReadLine());
        int result = Math.Abs(v * t) > 109 ? v * t % 109 : v * t;
        Console.WriteLine(v > 0 ? result : 109 + result);
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int v = scanner.nextInt();
        int t = scanner.nextInt();
        int s = v * t;
        System.out.println((s % 109 + 109) % 109);
    }
}


# C
#include <stdio.h>
#define MKAD 109

int main() {
    int v,t,s;
    scanf("%d %d", &v, &t);
    if (v > 0) {
        s = v * t;
        s < MKAD ? printf("%d", s) : printf("%d", s%MKAD);   
        }
    else {
        s = (v * -1) * t;
        s < MKAD ? printf("%d", MKAD - s) : printf("%d", MKAD - s%MKAD);
    }
    return 0;
}


# C++
#include <iostream>

int main() {
    int v, t;
    std::cin >> v >> t;
    std::cout << (109 + (v * t) % 109) % 109 << "\n";    
    return 0;
}


