Гипотенуза

Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.

Входные данные
В двух строках вводятся два числа (числа целые, положительные, не превышают 1000).

Выходные данные
Выведите ответ на задачу в виде целого числа

Sample Input:
6
8

Sample Output:
10


Напишите программу. Тестируется через stdin → stdout
Верно решили 4 078 учащихся
Из всех попыток 33% верных


# ruby
a = gets.to_i
b = gets.to_i 
puts ((a**2 + b**2)**0.5).to_i



# python
def triangle(a, b):
    return round((a**2 + b**2)**0.5)

print(triangle(int(input()), int(input())))


# JS
let [a, b] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log((a ** 2 + b ** 2) ** 0.5);



# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int a = int.Parse(Console.ReadLine());
        int b = int.Parse(Console.ReadLine());
        
        Console.WriteLine(Math.Sqrt(a*a+b*b));
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println((int)(Math.sqrt(Math.pow(sc.nextDouble(), 2)+Math.pow(sc.nextDouble(), 2))));
    }
}



# C 
#include <stdio.h>
#include <math.h>


int main() {
    int a;  scanf("%d", &a);
    int b;  scanf("%d", &b);
    
    printf("%.0f", hypot(a, b));
    return 0;
}


# C++
#include <iostream>
#include <cmath>

int main() {
    int a, b;
    std::cin >> a >> b;
    std::cout << sqrt(a * a + b * b) << "\n";
    return 0;
}