Следующее четное

Дано натуральное число n. Выведите следующее за ним четное число. При решении этой задачи нельзя использовать условную инструкцию if и циклы.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Sample Input:
9

Sample Output:
10

Напишите программу. Тестируется через stdin → stdout
Верно решили 2 233 учащихся
Из всех попыток 54% верных


# ruby
puts (gets.to_i / 2 + 1)*2 



# python
n = int(input())
print((n + 2) - (n % 2))


# JS
let n = Number(require('fs').readFileSync(0, 'utf8'));
console.log((n + 2) - (n % 2));


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int number =  1 + int.Parse(Console.ReadLine());
        Console.WriteLine(number + (number % 2));
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int num = scanner.nextInt();
        System.out.println(num + 2 - num % 2);
    }
}


# C
#include <stdio.h>

int main() {
    int n; scanf("%d", &n);
    printf("%d", n + 2 - (n & 1));
    return 0;
}


# C++
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    std::cout << (n/2 + 1)*2  << "\n";
    return 0;
}



