Дележ яблок - 3

n школьников делят k яблок “поровну”, то есть так, чтобы количество яблок, доставшихся любым двум школьникам, отличалось бы не более, чем на 1.

Входные данные
Программа получает на вход числа n и k.

Выходные данные
Программа должна вывести количество школьников, которым достанется яблок меньше, чем некоторым из их товарищей.

Примечание
При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

Sample Input:
7
30

Sample Output:
5

Напишите программу. Тестируется через stdin → stdout
Верно решили 1 252 учащихся
Из всех попыток 33% верных


# ruby
n, k = gets.to_i, gets.to_i
puts k%n == 0 ? 0 : n - (k%n)


# python
n, k = int(input()), int(input())
print(-k % n)


# JS
let [n, m] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log(Math.ceil(m / n) * n - m);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        int m = int.Parse(Console.ReadLine());
        double result = (Math.Ceiling((double)m / n) * n) - m;
        Console.WriteLine(result);
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);

        int countStudents = Integer.parseInt(sc.nextLine());
        int countApples = Integer.parseInt(sc.nextLine());
        sc.close();

        int result = (countStudents - (countApples % countStudents)) % countStudents;
        System.out.println(result);
    }
}


# C
#include <stdio.h>

int main() {
    int n, k;
    scanf("%d %d", &n, &k);
    
    printf("%d", (n - k % n) % n);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, k;
    std::cin >> n >> k;
    std::cout << (k + n - 1) / n * n % k << "\n";
    return 0;
}


