Улитка

Улитка ползёт по вертикальному шесту высотой h метров, поднимаясь за день на a метров, а за ночь спускаясь на b метров. На какой день улитка доползёт до вершины шеста?

Входные данные
Программа получает на вход натуральные числа h, a, b. Гарантируется, что a>b.

Выходные данные
Программа должна вывести одно натуральное число.

Примечание
При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

Sample Input:
10
3
2

Sample Output:
8

Напишите программу. Тестируется через stdin → stdout
Верно решили 836 учащихся
Из всех попыток 14% верных


# ruby
h, a, b = gets.to_i, gets.to_i, gets.to_i
#h, a, b = 5, 500, 470
h_day = a - b
ha = ((h - a).abs + h - a) / 2
puts (ha + h_day - 1) / h_day + 1


# python
import math

h,a,b = [int(input()) for i in range(3)]
y = h-a
if y<0:
    y=0
x = math.ceil(y/(a-b))
print(x+1)


# JS
// put your javascript (node.js) code here
const rl = require('readline').createInterface({
    input: process.stdin,
    output: process.stdout
});
rl.on('line', h=> {
    rl.on('line', a=> {
        rl.on('line', b=> {
            let days = Math.max(Math.ceil((h-a)/(a-b)) + 1, 1)
            console.log(days)
        });
    });
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int h = int.Parse(Console.ReadLine());
        int a = int.Parse(Console.ReadLine());
        int b = int.Parse(Console.ReadLine());
        int days = 1;
        for(int i = a; i < h; i -= b){
            i += a;
            days++;
        }
        Console.WriteLine(days);
        // put your c# code here
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        // put your code here
        Scanner scanner = new Scanner(System.in);
        double h = scanner.nextDouble();
        double a = scanner.nextDouble();
        double b = scanner.nextDouble();
        double days = Math.ceil((h-a)/(a-b))+1;
        int result = (int)days;
        System.out.println( h>a ? result : 1);
        
    }
}


# C
#include <stdio.h>

int main() {
    int h, a, b;
    scanf("%d %d %d", &h, &a, &b);
    
    int t = (h > a) * (h - b - 1) / (a - b);
    
    printf("%d", ++t);
    return 0;
}


# C++
#include <iostream>

int main() {
    int h, a, b, h_day, ha;
    std::cin >> h >> a >> b;
    h_day = a - b;
    ha = (abs(h - a) + h - a) / 2;
    std::cout << (ha + h_day - 1) / h_day + 1 << "\n";
    return 0;
}







