Проверьте делимость

Даны два натуральных числа n и m. Если одно из них делится на другое нацело, выведите 1, иначе выведите 0.

Входные данные
Вводятся два натуральных числа n и m.

Выходные данные
Выведите ответ на задачу.

Примечание
При решении этой задачи нельзя пользоваться условной инструкцией if и циклами. 

Sample Input:
2
8

Sample Output:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 913 учащихся
Из всех попыток 38% верных


# ruby
n,m = gets.to_i, gets.to_i
p 1 / ((n%m) * (m%n) + 1)


# python
n, m = [int(input()) for i in range(2)]
a = n%m
b = m%n
print((int)(any([a == 0, b == 0])))


# JS
const readline = require('readline');
const { stdin, stdout } = process;
new Promise((resolve)=>{
    const rl = readline.createInterface({ input: stdin, output: stdout });
    let inputLines = [];
    rl
        .on('line', (str)=>{ if(str) inputLines.push(Number(str)); })
        .on('close', ()=>{ resolve(inputLines); });
}).then((inputLines)=>{
    /* Решение */
    let [ n, m ] = inputLines;
    let result = m>n ? m%n==0? 1: 0 : n%m==0? 1: 0

    console.log(result);
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        int m = int.Parse(Console.ReadLine());
        bool result = (n % m) * (m % n) == 0;// or m % m == 0;
        Console.WriteLine(Convert.ToInt32(result));
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner scn = new Scanner(System.in);
    double n = scn.nextInt();
    double m = scn.nextInt();
    double mult = (n%m)*(m%n);
    int check = 1 - (int) Math.ceil (mult/(mult+1));
    System.out.println(check);
    }
}


# C
#include <stdio.h>

int main() {
    int n, m;
    scanf("%d %d", &n, &m);
    
    printf("%d", !(n % m) || !(m % n));
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, m, n1;
    std::cin >> n >> m;
    n1 = n/1000+n/100%10*10+n/10%10*100+n%10*1000;
    std::cout << 1 / ((n%m) * (m%n) + 1) << "\n";
    return 0;
}


