Автопробег

За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров?
При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

Входные данные
Программа получает на вход натуральные числа n и m, не превосходящие 10000.

Выходные данные
Выведите ответ на задачу.

Sample Input:
700
750

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 1 637 учащихся
Из всех попыток 46% верных


# ruby
n, m = gets.to_i, gets.to_i
puts (m + n - 1) / n 


# python
import math

n,m = int(input()),int(input())
print(math.ceil((m/n)))


# JS
let [n, m] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log(Math.ceil(m / n));


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        double m = double.Parse(Console.ReadLine());
        double result = Math.Ceiling(m/n);
        Console.WriteLine(result);
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        double n,m;
        double day;
        Scanner scan=new Scanner(System.in);
        n=scan.nextDouble();
        m=scan.nextDouble();
        day=Math.ceil(m/n);
        int value = (int) day;
        System.out.print(value);
    }
}


# C
#include <stdio.h>
#include <math.h>

int main() {
    int n, m; 
    scanf("%d %d", &n, &m);
    
    printf("%.0f", ceil((double)m / n));
    return 0;
}


# C++
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    int n, m;
    cin >> n >> m;
    cout << (m + n - 1) / n << endl;
    return 0;
}





