Отрезок_0

На клетчатой бумаге Петя нарисовал отрезок из точки с координатами (a, b) в точку с координатами (c, d). Через сколько клеток проходит этот отрезок (считается, что отрезок проходит через клетку, если он проходит через ее внутренность, если же он проходит только через вершину или по границе клетки, считается, что он не проходит через клетку).

Входные данные
Вводятся целые числа a, b, c, d. Числа по модулю не превышают 10**9.

Выходные данные
Выведите одно число — количество клеток, через которые проходит отрезок.

Sample Input 1:
0 0 6 4

Sample Output 1:
8

Sample Input 2:
3 3 -3 3

Sample Output 2:
0

Напишите программу. Тестируется через stdin → stdout
Верно решили 57 учащихся
Из всех попыток 37% верных

# ruby
def f(number)
    if number < 0
        number -= number * 2
    end    
    return number
end    
        
x1, y1, x2, y2 = gets.split.map(&:to_i)
x = f(x2 - x1)
y = f(y2 - y1)
p x + y - x.gcd(y)


# python
from math import gcd
a,b,c,d=map(int,input().split())
x = abs(c-a)
y = abs(d-b)
print(x+y-gcd(x,y))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
    int x1=myscan.nextInt(),y1=myscan.nextInt(),x2=myscan.nextInt(),y2=myscan.nextInt();
    int x=(int)Math.abs(x1-x2);
    int y=(int)Math.abs(y1-y2);
        int a=x,b=y;
        while(b!=0){
        int t=b;
        b=a%b;
        a=t;}
        System.out.print(x+y-a);
    }
}

