Часы

В марсианских сутках N часов. У марсиан Ятеп и Ашам есть часы со стрелками, которые работают почти так же, как земные – большая стрелка делает один оборот в час, а маленькая – один оборот в сутки. Ятеп и Ашам поссорились и решили не разговаривать, пока стрелки часов не совпадут. Определите точный момент времени, когда это случится.

Входные данные

Во входном файле задано число тестов K (0 ≤ K< 10^4), далее для каждого теста указаны целые числа N, A, B и C (1<N<10^9, 0 ≤ A < N, 0 ≤ B < C < 10^9). Числа A, B и C означают, что Ятеп и Ашам поссорились в A+B/C часов.

Выходные данные

Для каждого теста выведите искомое время в том же формате: числа A, B и C, такие, что искомое время равно A+B/C (0 ≤ A < N, 0 ≤ B < C, дробь B/C – несократимая).

Sample Input:
2
12 11 0 1
12 0 0 1

Sample Output:
0 0 1
1 1 11

Напишите программу. Тестируется через stdin → stdout
Верно решили 52 учащихся
Из всех попыток 34% верных

# ruby
gets.to_i.times do
    n, a1, b1, c1 = gets.split.map(&:to_i)
    if n > 2 
# совпадение стрелок происходит в А + А/(N-1) часов
# определяем текущее положение минутной 
# стрелки относительно часовой - "до" или "после"
# так как В и С могут быть большими, то воспользуемся:
# (В/С)*((N-1)*С) и (А/(N-1))*((N-1)*C)
# получим В*(N-1) и А*С
# если текущее положение больше или равно, то к А прибавляем 1
        if b1*(n-1) >= a1*c1
            a1 += 1
        end
# если полученное кол-во часов больше или равно N-1
# то встреча в "полночь"
        if a1 >= n - 1 
            a1, b1, c1 = 0, 0, 1
        else
# создание "несократимой дроби" В/С
            k = a1.gcd(n-1)
            b1 = a1/k
            c1 = (n-1)/k
        end    
# если в сутках 2 часа, то встреча всегда в "полночь"
# если в сутках 1 час, то стрелки всегда совпадают
    elsif n == 2
        a1, b1, c1 = 0, 0, 1
    end    
    print "#{a1} #{b1} #{c1}\n"
end


# python
from math import gcd

for _ in range(int(input())):
    n, a, b, c = map(int, input().split())
    for i in range(1, n - 1):
        d = gcd(i, n - 1)
        t = i + i / (n - 1)
        if t >= a + b / c:
            print(i, i // d, (n - 1) // d)
            break
    else:
        print(0, 0, 1)


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int k=myscan.nextInt();
        for(int j=0;j<k;j++){
        double n=myscan.nextDouble(),a=myscan.nextDouble(),b=myscan.nextDouble(),c=myscan.nextDouble();
            if(n==1){System.out.println(a+" "+b+" "+c);continue;}
        double i=0;
            int r=0;
            for(;((n*i)/(n-1))<=(a+b/c);i++){}
                r=(int)((n*i)/(n-1))%(int)n;
        int h=(int)(n*i)%(int)(n-1);
        int f=(int)n-1;
        if(h==0)f=1;
            int s=h,g=f;
            while(s!=0){
            int y=s;
            s=g%s;
            g=y;}   
        System.out.println(r+" "+h/g+" "+f/g);}        
    }
}

