Расширенный алгоритм Евклида

Даны натуральные числа a, b, c. Если уравнение ax+by=c имеет решения в целых числах, то выведите через пробел НОД(a,b), x и y (какое-нибудь решение). Если решения не существует, то выведите слово Impossible.

Входные данные
Входные данные - натуральные числа и не превышают по модулю 10000.

Выходные данные
Выведите ответ на задачу.

Напишите программу. Тестируется через stdin → stdout
Верно решили 44 учащихся
Из всех попыток 20% верных


# ruby
a, b, c = gets.chomp.split.map(&:to_i)
g = a.abs.gcd(b.abs)

if c % g != 0
  puts 'Impossible'
else
  a /= g
  b /= g
  c /= g

  (0...a.abs).each do |i|
    if (c - b * i) % a == 0
      y = i
      x = (c - b * y) / a
      print "#{g} #{x} #{y}"
      break
    end
  end
end

# python
def extended_gcd(a, b):
    if not b:
        return a, 1, 0
    else:
        gcd, x, y = extended_gcd(b, a % b)
        return gcd, y, x - (a // b) * y


a, b, c = map(int, input().split())
gcd, x0, y0 = extended_gcd(a, b)
if c % gcd:
    print("Impossible")
else:
    print(gcd, x0 * (c // gcd), y0 * (c // gcd))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int a=myscan.nextInt(),b=myscan.nextInt(),c=myscan.nextInt();
        int r1=a,r2=b;
        while(r1!=0){int t=r1;r1=r2%r1;r2=t;}
        int d=r2;
        if(c%d==0){
        a/=d;b/=d;
        int s=0,s1=1,s2=0;
        int t=0,t1=0,t2=1;
            r1=a;r2=b;
        while(r2>0){int q=r1/r2;int r=r1-q*r2; r1=r2;r2=r;
        s=s1-q*s2;s1=s2;s2=s;
        t=t1-q*t2;t1=t2;t2=t;
        }
        System.out.print(d+" "+(c*s1)/d+" "+(c*t1)/d);  
        }
        else System.out.print("Impossible");
    }
}
    