МегаНОД

Дано N чисел. Найти самое большое число, на которое делятся все N чисел.

Входные данные
В первой строке дано число N. Во второй строке даны через пробел N чисел (1 <= N <= 1000).

Выходные данные
Выведите искомое число.



# ruby
n = gets.to_i
a = gets.chomp.split.map(&:to_i)
k = a[0]

1.upto(n-1) do |i|   
    k = k.gcd(a[i])    
end
p k


# python
from math import gcd 

_ = input()
arr = list(map(int, input().split()))
print(gcd(*arr))



# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
int n=v.nextInt(),max=Integer.MIN_VALUE;
int []vas=new int[n];
for(int i=0;i<n;i++){
vas[i]=v.nextInt();
if(max<vas[i]){max=vas[i];}
}
for(int i=max,chet=0;i>=1;i--){
    for(int j=0;j<n;j++){
        if(vas[j]%i==0){chet++;}
    }
    if(chet==n){System.out.println(i);break;}
    chet=0;
}
    
    
    }
}