Граница многоугольника

Многоугольник на плоскости задан целочисленными координатами своих N вершин в декартовой системе координат. Требуется найти количество точек с целочисленными координатами, лежащих на границе многоугольника. Стороны многоугольника друг с другом не соприкасаются (за исключением соседних - в вершинах) и не пересекаются.

Ограничения: 3 <= N <= 100 000, координаты вершин целые и по модулю не превосходят 1 000 000 000.

Входные данные
В первой строке содержится число N, в следующих N строках - пары чисел - координаты точек. Если соединить точки в данном порядке, а также соединить первую и последнюю точки, получится заданный многоугольник.

Выходные данные
Вывести одно число - количество точек с целочисленными координатами на границе многоугольника.

Sample Input:
8
5 15
15 5
15 -5
5 -15
-5 -15
-15 -5
-15 5
-5 15

Sample Output:
80

Напишите программу. Тестируется через stdin → stdout
Верно решили 66 учащихся
Из всех попыток 60% верных


# ruby
n = gets.to_i
ans,x,y = 0,0,0
xfirst, yfirst = gets.split.map(&:to_i)
xprev, yprev = xfirst, yfirst

0.upto(n - 2) do |i|
    x, y = gets.split.map(&:to_i)
    ans += (x - xprev).abs.gcd((y - yprev).abs)
    xprev, yprev = x, y
end    

ans += (x - xfirst).abs.gcd((y - yfirst).abs)
print(ans)

# python
from math import gcd

def get_n(x1: int, y1: int, x2: int, y2: int)-> int:
    return gcd(abs(x1 - x2), abs(y1 - y2))

n = int(input())
x, y = map(int, input().split())
points = [(x, y)]
res = 0

for i in range(n - 1):
    x, y = map(int, input().split())
    res += get_n(x, y, *points[-1])
    points.append((x, y))
    
res += get_n(x, y, *points[0])
print(res)


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
    int n=myscan.nextInt();
    int x1=myscan.nextInt(),y1=myscan.nextInt(),x2=myscan.nextInt(),y2=myscan.nextInt();
        int k=x1,l=y1,sum=0;
     for(int i=2;i<n+2;i++){
        int x=(int)Math.abs(x1-x2);
    int y=(int)Math.abs(y1-y2);
    int a=x,b=y;
        while(b!=0){
        int t=b;
        b=a%b;
        a=t;}
        sum+=a-1;
        x1=x2;y1=y2;
     if(myscan.hasNextInt()){x2=myscan.nextInt();y2=myscan.nextInt();}
     else {x2=k;y2=l;}}       
       System.out.print(sum+n);
    }
}

