Дробь
Коля учится в третьем классе, сейчас они проходят простые дроби с натуральными числителем и знаменателем. Вчера на уроке Коля узнал, что дробь называется правильной, если ее числитель меньше знаменателя, и несократимой, если нет равной ей дроби с меньшими натуральными числителем и знаменателем.

Коля очень любит математику, поэтому дома он долго экспериментировал, придумывая и решая разные задачки с правильными несократимыми дробями. Одну из этих задач Коля предлагает решить вам с помощью компьютера.

Найдите наибольшую правильную несократимую дробь, у которой сумма числителя и знаменателя равна n.

Входные данные

Во входном файле записано одно целое число n (3 ≤ n ≤ 1000).

Выходные данные

Выведите в выходной файл числитель и знаменатель искомой дроби.

Sample Input 1:

10
Sample Output 1:

3 7
Sample Input 2:

23
Sample Output 2:

11 12
Напишите программу. Тестируется через stdin → stdout
Верно решили 83 учащихся
Из всех попыток 68% верных

# ruby
n = gets.to_i
a=n/2
b=n-a
1.upto(n-1) do |i| i
    while a.gcd(b) != 1
        a, b = a-1 , b+1
    end
end    
print "#{a} #{b}"


# python
from math import gcd

n = int(input())
p = n // 2

while gcd(p, n - p) > 1:
    p -= 1
print(p, n - p)


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
int n=v.nextInt(),a=0,b=0;boolean ff=false;
for(int i=1;i<n/2+n%2;i++){
    for(int j=n,k=n-i;j>1;j--){
    if(i%j==0&&k%j==0){ff=true;}
    if(j-1==1&&ff==false){a=i;b=k;}
    }
    ff=false;
}
System.out.println(a+" "+b);        
    }
}



