Упорядоченные дроби

Вывести в порядке возрастания все несократимые дроби, заключённые между 0 и 1, знаменатели которых не превышают N.

Входные данные

В первой строке находится единственное число N. 2 <= N <= 255.

Выходные данные

В каждой строке выводится дробь.

Sample Input 1:

5
Sample Output 1:

1/5
1/4
1/3
2/5
1/2
3/5
2/3
3/4
4/5
Sample Input 2:

4
Sample Output 2:

1/4
1/3
1/2
2/3
3/4
Напишите программу. Тестируется через stdin → stdout
Верно решили 80 учащихся
Из всех попыток 67% верных

# ruby  
n = gets.to_i
m = []

1.upto(n-1) do |a|
    a+1.upto(n) do |b|
        if a.gcd(b) == 1 and a<b
            m << [a.to_f/b,a,b]
        end
    end
end   

m.sort!
m.each do |i|
    print "#{i[1]}/#{i[2]}\n"    
end


# python
from math import gcd

n = int(input())
f = set()

for p in range(1, n):
    q = n
    while q > 1 and p / q < 1:
        d = gcd(p, q)
        f.add((p / q, p // d, q // d))
        q -= 1
        
for _, p, q in sorted(f):
     print(f'{p}/{q}')


# JS
const nod = (x, y) => {
    if (y > x)
        return nod(y, x);
    if (!y)
        return x;
    return nod(y, x % y);
}

const n = +require('fs').readFileSync(0, 'utf8');

let arr = [];
for (let i = 2; i <= n; i++) {
    for (let j = 1; j < i; j++)
        if (nod(j, i) == 1)
            arr.push([j, i]);        
}

arr.sort(([v0, v1], [w0, w1]) => v0/v1 - w0/w1)

for (let row of arr)
    console.log(row.join('/'));

