Сокращение дроби

Дана дробь 1. Требуется ее сократить, то есть записать это же число в виде c/d, где c — целое число, d — натуральное число и d минимальное возможное.

Входные данные
Вводятся два целых числа a и b (–100 ≤ a ≤ 100, 0 < b ≤ 100).

Выходные данные
Выведите два числа c и d.

Sample Input 1:
3 6

Sample Output 1:
1 2

Sample Input 2:
-2 5

Sample Output 2:
-2 5

Напишите программу. Тестируется через stdin → stdout
Верно решили 126 учащихся
Из всех попыток 72% верных


# ruby
a,b  = gets.split.map(&:to_i) 
c = a.gcd(b)
print "#{a/c} #{b/c}"


# python
from fractions import Fraction

x = Fraction(*map(int, input().split()))
print(*x.as_integer_ratio())


# JS
let [mm, nn] = require('fs').readFileSync(0, 'utf8').split(' ').map(Number);

let [m, n] =  [Math.abs(mm), Math.abs(nn)];

while (m != 0 && n != 0) {
    if (m > n)
        m = m % n;
    else
        n = n % m;
}

let nod = m + n;
console.log(mm / nod, nn / nod);


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
int a=v.nextInt(),b=v.nextInt();boolean ff=false;
for(int i=Math.abs(a);i>1;i--){
    if(a%i==0&&b%i==0){a=a/i;b=b/i;ff=true;}
    if(ff==true&&i-1==1){i=Math.abs(a)+1;ff=false;}
}
    System.out.println(a+" "+b);
    }
}

