Целые точки отрезка

Требуется написать программу, которая вычислит, сколько всего точек с целочисленными координатами принадлежат отрезку.

Входные данные
Даны четыре целых числа – координаты концов отрезка (x1, y1) и (x2, y2). Каждая из координат не превышает по абсолютной величине значения 1000.

Выходные данные
Требуется вывести количество точек отрезка, имеющих целочисленные координаты.

Sample Input 1:
1 0 5 0

Sample Output 1:
5

Sample Input 2:
-1 -2 2 4

Sample Output 2:
4

Напишите программу. Тестируется через stdin → stdout
Верно решили 78 учащихся
Из всех попыток 29% верных

# ruby
x1,y1,x2,y2  = gets.split.map(&:to_i)
dx,dy,cnt = x2-x1, y2-y1, 0

if x1 == x2
    n = dy.abs
elsif y1 == y2
    n = dx.abs
else
    n = (dx.abs).gcd(dy.abs)
end

print n+1


# python
x1, y1, x2, y2 = map(int, input().split())
if x1 == x2:
    print(abs(y2 - y1) + 1), exit(0)
elif x2 < x1:
    x1, y1, x2, y2 = x2, y2, x1, y1
    
k = (y2 - y1) / (x2 - x1)
cnt = 1
for x in range(x1, x2):
    y = y1 + k * (x - x1)
    cnt += y.is_integer()
print(cnt)


# JS
let [x1, y1, x2, y2] = require('fs').readFileSync(0, 'utf8').split(' ').map(Number);
[x1, y1, x2, y2] = x1 > x2 ? [x2, y2, x1, y1] : [x1, y1, x2, y2];

let f = x => (x-x1) * (y2-y1) / (x2-x1) + y1;

let count = 0;
for (let i = x1; i <= x2; i++)
    if (f(i) % 1 == 0)
        count++;  
    
console.log(count);


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
    int x1=myscan.nextInt(),y1=myscan.nextInt(),x2=myscan.nextInt(),y2=myscan.nextInt();
    int x=(int)Math.abs(x1-x2);
    int y=(int)Math.abs(y1-y2);
    int a=x,b=y;
        while(b!=0){
        int t=b;
        b=a%b;
        a=t;}
        System.out.print(a+1);
        
    }
}



# C++
#include <iostream>
using namespace std;
int main() {
    int x1,y1,x2,y2,kol=0;
    cin>>x1>>y1>>x2>>y2;
    if (x1>x2) swap(x1,x2);
    if (y1>y2) swap(y1,y2);
    for(int x=x1;x<=x2;x++)
        for(int y=y1;y<=y2;y++)
            if ((x-x1)*(y2-y1)==(y-y1)*(x2-x1)) kol++;
    cout<<kol;
    return 0;
}


