Кинотеатр

Марья Ивановна с Марьей Михайловной привели школьников в кинотеатр. Чтобы не было никаких обид, Марья Ивановна построила всех школьников по алфавиту и рассадила их: сначала в первый ряд слева направо, затем во второй слева направо и т.д., заполнив весь зал из n рядов по m кресел. Тут пришла Марья Михайловна и сказала, что ребята сели неправильно – надо пересесть. Она предложила сначала заполнить все первые места от первого ряда к последнему, затем все вторые места и т. д.

Определите, сколько школьников после такой пересадки останется на своем месте.

Например, если n = 3 и m = 3, то в первом случае дети сядут так:
1 2 3
4 5 6
7 8 9

а во втором – так:
1 4 7
2 5 8
3 6 9
Таким образом, три школьника: 1, 5 и 9 останутся на своих местах.

Входные данные
Вводятся два целых числа n и m (1 ≤ n, m ≤ 10^9).

Выходные данные
Выведите количество школьников, которые останутся на своих местах.

Sample Input 1:
3 3

Sample Output 1:
3

Sample Input 2:
2 4

Sample Output 2:
2


# ruby
n, m = gets.chomp.split.map(&:to_i)
p (n-1).gcd(m-1) + 1



# python
from math import gcd

n, m = map(int, input().split())
if n < m:
    n, m = m, n
print(gcd(n - 1, m - 1) + 1)


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int n=myscan.nextInt(),m=myscan.nextInt();
        int s=2;
        int a=m-1,b=n-1;
        while(a!=0){
            int t=a;
            a=b%a;
            b=t;}
        if(b==1){System.out.print("2"); return;}
        if(n==m){System.out.print(n); return;}
        if(n==1||m==1){System.out.print((int)Math.max(n,m)); return;}
        for(int i=1;i<n;i++)
            for(int j=1;j<m;j++)
                if(i*(m-1)/b==j*(n-1)/b){a=i;b=j;
              while(i<n-1&&j<m-1){s++;i+=a;j+=b;}}
        System.out.print(s); 
    }
}
  


