Выведите традиционную надпись Hello, World! используя язык программирования, с помощью которого вы собираетесь решать задачи

Напишите программу. Тестируется через stdin → stdout
Верно решили 5 747 учащихся
Из всех попыток 49% верных


# put your ruby code here
puts 'Hello, World!'


# put your python code here
print("Hello, World!")



// put your C code here
#include <stdio.h>
	
int main() {
    printf("Hello, World!\n");
    return 0;
}


// put your C++ code here
#include <iostream>

int main() {
    std::cout << "Hello, World!\n";
    return 0;
}



