Количество совпадающих

Даны два списка чисел, которые могут содержать до 100000 чисел каждый. Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во втором.

Примечание. Эту задачу на Питоне можно решить в одну строчку.

Входные данные
Вводятся два списка чисел. Все числа каждого списка находятся на отдельной строке.

Выходные данные
Выведите ответ на задачу.

Sample Input:
1 3 2
4 3 2

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 475 учащихся
Из всех попыток 64% верных


# ruby
s1 = gets.chop.split().map{|j| j.to_s }
s2 = gets.split().map{|j| j.to_s }
print s1.intersection(s2).size


# python
print(len(set(input().split()) & set(input().split())))


# JS
let [arr1, arr2] = require('fs').readFileSync(0, 'utf8').split('\n');
arr1 = Array.from(new Set(arr1.split(' ')));
arr2 = Array.from(new Set(arr2.split(' ')));
const intersection = arr1.filter(value => arr2.includes(value));
console.log(intersection.length);


# C#
using System;
using System.Collections.Generic;

class Program
{
    static void Main() {
        var items1 = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        var items2 = Array.ConvertAll<string, int>(Console.ReadLine().Split(), int.Parse);
        var set1  = new HashSet<int>(items1);
        var set2  = new HashSet<int>(items2);
        set1.IntersectWith(set2);
        Console.WriteLine(set1.Count);
    }
}


# java
import java.util.HashSet;
import java.util.List;
import java.util.Scanner;

class MainThird {
  public static void main(String[] args) {
    Scanner sc = new Scanner(System.in);
    HashSet<String> s2 = new HashSet<>(List.of(sc.nextLine().split(" ")));
    HashSet<String> s1 = new HashSet<>(List.of(sc.nextLine().split(" ")));
    s1.retainAll(s2);
    System.out.println(s1.size());

  }
}


# C++
#include <iostream>
#include <string>
#include <set>
#include <algorithm>
#include <sstream>

int main() {
    // put your code here
    std::string strFir;
    std::string strSec;
    
    //Считываем строки
    std::getline(std::cin, strFir);
    std::getline(std::cin, strSec);
    
    std::stringstream issFir (strFir);
    std::stringstream issSec (strSec);
   
    //Переводим в set
    int number;
    std::set <int> setFir;
    std::set <int> setSec;
    while(issFir >> number)
        setFir.insert(number);
        
    while(issSec >> number)
        setSec.insert(number);
    
    std::set <int> insertV;
    
    std::set_intersection(setFir.begin(), setFir.end(), setSec.begin(), setSec.end(), std::inserter(insertV, insertV.begin()));
    
    std::cout << insertV.size() << std::endl;
    return 0;
}


