Встречалось ли число раньше

Во входной строке записана последовательность чисел через пробел. Для каждого числа выведите слово YES (в отдельной строке), если это число ранее встречалось в последовательности или NO, если не встречалось.

Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Sample Input:
1 2 3 2 3 4

Sample Output:
NO
NO
NO
YES
YES
NO

Напишите программу. Тестируется через stdin → stdout
Верно решили 432 учащихся
Из всех попыток 86% верных


# ruby
s1 = gets.split().map{|j| j.to_i }
s2 = []

s1.each do |i|
    if s2.include?(i)
        print "YES\n"
    else
        print "NO\n"
        s2.push(i)
    end
end 


# python
(lambda m: ((s := set()), [(print(['NO', 'YES'][i in s]), s.add(i)) for i in m]))(input().split())


# JS
let arr = require('fs').readFileSync(0, 'utf8').split(' ');

const tmp = new Set();
for (let item of arr) {
    console.log(tmp.has(item) ? 'YES' : 'NO');
    tmp.add(item);
    }


# C#
using System;
using System.Collections.Generic;

public class MainClass
{
    public static void Main()
    {
        string[] str=Console.ReadLine().Split();
        var list=new List<string>();
        foreach(string i in str)
        {
        if(list.Contains(i))
        Console.WriteLine("YES");
        else {Console. WriteLine("NO");}
        list.Add(i);  
        }                             
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v=new Scanner(System.in);
String [] sv=v.nextLine().split(" ");
int[] vv=new int[sv.length];        
for(int i=0;i<sv.length;i++){
vv[i]=Integer.parseInt(sv[i]);}
for(int i=0,chet=0;i<vv.length;i++){
  for(int j=0;j<i;j++){
    if(i!=j&&vv[i]==vv[j]){System.out.println("YES");chet=1;break;}}    
if(chet==0){System.out.println("NO");}
chet=0;}      
    }
}


# C++
#include <iostream>
#include <set>
using namespace std;

int main() {
    int n, ln, res=1;
    set <int> s;
    
    while (cin >> n)
    {
        ln = s.size();
        s.insert(n);
        if (ln!=s.size()) cout << "NO" << endl;
        else cout << "YES" << endl;
    }

    return 0;
}


