IP-адрес

Для того чтобы выходить в Интернет, каждому компьютеру присваивается так называемый IP-адрес. Он состоит из четырех целых чисел в диапазоне от 0 до 255, разделенных точками. В следующих трех строках показаны три правильных IP-адреса:

127.0.0.0
192.168.0.01
255.00.255.255
Напишите программу, которая определяет, является ли заданная строка правильным IP-адресом.

Входные данные
На вход программе подается строка длиной не более 15 символов, которая включает цифры и ровно три точки.

Выходные данные
Если строка является правильным IP-адресом, необходимо вывести 1, иначе 0.

ВАЖНОЕ ПРИМЕЧАНИЕ.
Есть тонкости связанные с незначащими нулями в IP-адресах. Чтобы не уходить совсем уж в дебри этих тонкостей, для задачи правильным может считаться адрес, в котором есть ведущие нули, но при этом в каждом числе не более трех цифр. То есть адрес 10.01.100.001 - корректный. А адрес - 01.0001.100.001 - уже нет.

Sample Input:
127.0.0.1

Sample Output:
1
Напишите программу. Тестируется через stdin → stdout
Верно решил 341 учащийся
Из всех попыток 25% верных


# ruby
a = gets.chomp.split('.')
#puts a
b = 0 #ip right
if a.size == 4
    a.each do |i| 
        if i.size>3 or i.size<1 or i.to_i > 255
            b = 1
        end    
    end
else
    b = 1
end 
print (b == 0 ? 1 : 0)


# python
ip = input().split('.')
print(int(len(ip) == 4 and all(ip) and all(map(lambda s: 0 <= int(s) <= 255 and len(s) < 4, ip))))


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        const bytes = data.toString().split('.');
        console.log(+!bytes.some(x => x.length > 3 || +x > 255 || !x.length));
    }
});


# C#
using System;

class Program
 {
    static void Main() 
    {
     string input = Console.ReadLine();
     if (input.Length <= 15 && input.Split('.').Length == 4 && System.Text.RegularExpressions.Regex.IsMatch(input, @"^[0-9.]+$")) 
     {
       string[] parts = input.Split('.');
       
     foreach (string part in parts) 
       {
        if (part.Length>3||!int.TryParse(part, out int num) || num < 0 || num > 255) 
         {
            Console.WriteLine("0");
            return;
         }
       }
           Console.WriteLine("1");
        }
         else 
            Console.WriteLine("0");   
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        String [] ip = new Scanner(System.in).nextLine().split("\\.");
        
        int isIpOk = 1;
        for (String partIp : ip) { 
            if (ip.length != 4 || partIp.equals("") || partIp.length() > 3) {
                isIpOk = 0;
                break;
            }
            if (Integer.parseInt(partIp) > 255) isIpOk = 0;    
        }
        
        System.out.print(isIpOk);
    }
}


# C
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define BUFF_SIZE 16

bool checkIP(char* const str) {
  char tmp[4][4] = {0};
  if (sscanf(str, "%3[0-9] %*1[.] %3[0-9] %*1[.] %3[0-9] %*1[.] %3[0-9]",
             tmp[0], tmp[1], tmp[2], tmp[3]) != 4)
    return false;
  for (size_t i = 0; i < 4; i++) {
    if (!tmp[i][0]) return false;
    if (strtoul(tmp[i], 0, 10) > 255) return false;
  }
  return true;
}

int main(void) {
  char str[BUFF_SIZE];
  if (scanf("%s", str) != 1) return EXIT_FAILURE;
  printf("%u\n", checkIP(str));
  return EXIT_SUCCESS;
}


# C++
//Failed test #13 of 17. Wrong answer
#include <iostream>
#include <string>

void err();

int main() {
    // put your code here
    std::string str;
    //Считываем строку
    std:getline(std::cin, str);
    
    //Проходим по строке
    for(int i = 0, count = 0; i < str.length(); ++i){
        std::string number;
        
        //Ищем точки в строке
        int pos = str.find(".", i);
        
        //Если достигли конца строки
        if(pos == std::string::npos){
            //Если точек больше или меньше 3 то ошибка
            if(count != 3) err();
            
            pos = str.length();
        } else {
            ++count;
        }
        
        //Копируем число в отдельную строкку
        for(; i < pos; ++i){
            number += str[i];
        }
        
        int num = 0;
        
        //Пробуем перевести строку числа в int
        try{
            num = stoi(number);
        } catch(std::invalid_argument& e){
            err();
        }
        
        if(num < 0 || num > 255){
            err();
        }
    }
    
    std::cout << "1" << std::endl;
    return 0;
}

void err(){
    
            std::cout << "0" << std::endl;
            exit(0);
}



