Капитан Флинт

Капитан Флинт зарыл клад на Острове сокровищ. Он оставил описание, как найти клад. Описание состоит из строк вида: "North 5", где  слово – одно из "North", "South", "East", "West", – задает направление движения, а  число – количество шагов, которое необходимо пройти в этом направлении.

Напишите программу, которая по описанию пути к кладу определяет точные координаты клада, считая, что начало координат находится в начале пути, ось OX направлена на восток, ось OY – на север.

Входные данные
На вход подается последовательность строк указанного формата. Гарантируется, что числа не превосходят 
1
0
8
10 
8
 .

Выходные данные
Необходимо вывести  координаты клада – два целых числа через пробел. Гарантируется, что эти числа не превосходят 
1
0
8
10 
8
 .

Sample Input:
South 19

Sample Output:
0 -19

Напишите программу. Тестируется через stdin → stdout
Верно решили 354 учащихся
Из всех попыток 30% верных


# ruby
a_str = $stdin.read.split("\n")
x,y = 0,0

a_str.each do |i| 
    a = i.split()    
    if a[0] == "North"
        y += a[1].to_i 
    elsif a[0] == "South"
        y -= a[1].to_i 
    elsif a[0] == "East"
        x += a[1].to_i         
    else      
        x -= a[1].to_i 
    end
end    
print ("#{x} #{y}")


# python
x = y = 0
for i in open(0).readlines():
    com, cor = i.split()
    if com == "North": y += int(cor)
    elif com == "South": y -= int(cor)
    elif com == "East": x += int(cor)
    elif com == "West": x -= int(cor)
print(x, y)


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        const strs = data.toString().split('\n');
        let [x, y] = [0, 0];
        const steps = {
            North : v => y += +v,
            South : v => y -=  v,
            East  : v => x += +v,
            West  : v => x -=  v
        };
        for (const str of strs) {
            const [dir, val] = str.split(' ');
            steps[dir](val);
        }
        console.log(x, y);
    }
});


# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
     int x=0, y=0;
     string d;
     bool flag=true;
     while (flag)
     {
       d=Console.ReadLine();
       
       if (String.IsNullOrEmpty(d))
       flag=false;
       
       else
         {
           string[]s=d.Split(' ');
           int num=int.Parse(s[1]);
           switch (s[0])
           {
            case "North":
            y+=num;
            break;
            case "South":
            y-=num;
            break;
            case "East":
            x+=num;
            break;
            case "West":
            x-=num;
            break;       
           }
        }
     }
      Console.WriteLine($"{x} {y}");   
  }
}


# java
import java.util.*;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int x = 0, y = 0;

        while (scanner.hasNext()) {
            String direction = scanner.next();
            int steps = scanner.nextInt();
            switch (direction) {
                case "North" -> y += steps;
                case "South" -> y -= steps;
                case "East" -> x += steps;
                case "West" -> x -= steps;
            }
        }
        
        System.out.println(x + " " + y);
    }
}


# C
#include <stdio.h>
#include <stdlib.h>

int main() {
  int x = 0;
  int y = 0;
  char direction[6];
  int distance;
  while (scanf("%5s %d", direction, &distance) == 2) {
    switch (direction[0]) {
      case 'N':
        y += distance;
        break;
      case 'S':
        y -= distance;
        break;
      case 'E':
        x += distance;
        break;
      case 'W':
        x -= distance;
        break;
      default:
        return EXIT_FAILURE;
    }
  }
  printf("%d %d\n", x, y);
  return EXIT_SUCCESS;
}


# C++
#include <iostream>

int main() {
    int OX = 0, OY = 0, n;
    std::string s;
    while (std::cin >> s >> n) {
        if (s == "North") OY += n;
        else if (s == "South") OY -= n;
        else if (s == "East") OX += n;
        else if (s == "West") OX -= n;
    }
    std::cout << OX << " " << OY << "\n";
    return 0;
}



