Количество слов

Дана строка, содержащая пробелы. Найдите, сколько в ней слов (слово – это последовательность непробельных символов, слова разделены одним пробелом, первый и последний символ строки – не пробел).

Входные данные
На вход подается несколько строк.

Выходные данные
Необходимо вывести  количество слов в первой из введенных строк.

Sample Input:
In the town where I was born

Sample Output:
7

Напишите программу. Тестируется через stdin → stdout
Верно решили 760 учащихся
Из всех попыток 77% верных



# put your ruby code here       
puts gets.strip.split(' ').size


# put your python code here
print(len(input().split()))


# JS
const data = require('fs').readFileSync(0, 'utf8')

console.log(data.split(/\n/)[0].split(/\s/).length)


# C#
using System;
using System.Linq;

public class MainClass
{
    public static void Main()
    {
        var num = Console.ReadLine().Split(' ').ToArray();
        Console.WriteLine(num.Length);
    }
}


# java
class Main {
    public static void main(String[] args) {
        System.out.print(new java.util.Scanner(System.in).nextLine().split(" ").length);
    }
}


# C
#include <stdio.h>
#include <stdlib.h>
#define BUFF_SIZE 256

int main() {
  char str[BUFF_SIZE];
  unsigned result = 0;
  fgets(str, BUFF_SIZE, stdin);
  for (size_t i = 0; i < BUFF_SIZE; ++i) {
    if (str[i] == '\0') break;
    if (str[i] == ' ') result++;
  }
  printf("%u\n", ++result);
  return EXIT_SUCCESS;
}


# C++
#include <iostream>
#include <cstring>

int main() {
    std::string s;
    std::getline(std::cin, s);
    int words = 1;
    for (auto el : s) words += (el == ' ');
    std::cout << words << "\n";
    return 0;
}



