Поиск подстроки

Даны две строки. Определите, является ли первая строка подстрокой второй строки.

Входные данные
На вход подается 2 строки длины не более 10000, состоящие только из маленьких букв латинского алфавита.

Выходные данные
Необходимо вывести  слово yes, если первая строка является подстрокой второй строки, или слово no в противном случае.

Sample Input:
abac
ababacaba

Sample Output:
yes

Напишите программу. Тестируется через stdin → stdout
Верно решили 654 учащихся
Из всех попыток 73% верных


# ruby
s1 = gets.chomp
s2 = gets.chomp

if s2.include?(s1)
    puts 'yes'
else    
    puts 'no'    
end   


# python
print('yes' if input() in input() else 'no')


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let [substr, str] = d.toString().split('\n');
    let result = 'no';
    if (str.includes(substr)) result = 'yes';
    
    console.log(result);
  });


# C#
using System;

public class MainClass
{
    public static void Main()
    {
  Input (out string s1);
  Input (out string s2);
  Console.WriteLine((s2.IndexOf(s1)!=-1)?"yes":"no");
    }
    static void Input(out string x)
    {
        x=Console.ReadLine();
    }         
 }


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        String str1 = sc.next();
        System.out.print(sc.next().indexOf(str1) == -1 ? "no" : "yes");
        sc.close();
    }
}


# C
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define BUFF_SIZE 10001

int main() {
  char str1[BUFF_SIZE];
  char str2[BUFF_SIZE];
  scanf("%s %s", str1, str2);
  size_t len1 = strlen(str1);
  size_t len2 = strlen(str2);
  if (len1 > len2) return EXIT_FAILURE;
  for (size_t i = 0; i <= len2 - len1; ++i) {
    if (!strncmp(str2+i, str1, len1)) {
      puts("yes");
      return EXIT_SUCCESS;
    }
  }
  puts("no");
  return EXIT_SUCCESS;
}


# C++
#include <iostream>

int main() {
    std::string s1, s2;
    std::cin >> s1 >> s2;
    std::cout << (s2.find(s1) == std::string::npos ? "no" : "yes") << "\n";
    return 0;
}





