Является ли строка палиндромом?

Дана строка, состоящая из строчных латинских букв и пробелов. Проверьте, является ли она палиндромом без учета пробелов (например, "аргентина манит негра").

Входные данные
На вход подается 1 строка длины не более 100, содержащая пробелы. Подряд может идти произвольное число пробелов.

Выходные данные
Необходимо вывести yes, если данная строка является палиндромом, и no в противном случае.

Sample Input:
ab a

Sample Output:
yes

Напишите программу. Тестируется через stdin → stdout
Верно решили 600 учащихся
Из всех попыток 73% верных


# ruby
s = gets.split.join('')

if s == s.reverse
    puts 'yes'
else
    puts 'no'  
end 


# python
s = input().replace(' ', '')
print('yes' if s == s[::-1] else 'no')


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        const str = data.toString().replace(/ /g, '');
        console.log(str == [...str].reverse().join('') ? 'yes' : 'no');
    }
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
     string newstr="";
     string word = Console.ReadLine();
     
     for (int i=0; i<word.Length;i++)
     {
        if(word[i]!=' ')
        newstr+=word[i];
     }
     
     word=newstr;
     int a=0;
     
     for (int i=0;i<word.Length;i++)
     {
     if (word[i]==word[word.Length-(1+i)])
        a++;
     else
        a--;
     }   Console.WriteLine((a==word.Length)?"yes":"no");
   }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        String strIn = new Scanner(System.in).nextLine().replace(" ","");
        String strRev = new StringBuilder(strIn).reverse().toString();
        System.out.print(strIn.equals(strRev) ? "yes" : "no");
    }
}


# C
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define BUFF_SIZE 128

int main() {
  char str[BUFF_SIZE];
  char rev[BUFF_SIZE];
  size_t len = 0;
  while (len < BUFF_SIZE) {
    char tmp = fgetc(stdin);
    if (tmp == EOF) break;
    if (tmp != ' ' && tmp != '\n') {
      str[len] = tmp;
      len++;
    }
  }
  str[len] = '\0';
  for (int j = 0, i = len - 1; i >= 0; ++j, --i) {
    rev[j] = str[i];
  }
  rev[len] = '\0';
  printf("%s\n", strcmp(str, rev) ? "no" : "yes");
  return EXIT_SUCCESS;
}


# C++
#include <iostream>

bool is_palindrom(std::string s) {
    for (int i = 0; i < s.size() / 2; i++) {
        if (s[i] != s[s.size() - 1 - i]) {
            return false;
        }
    }
    return true;
}

int main() {
    std::string s;
    std::getline(std::cin, s);
    while (s.find(" ") != -1) {
        s.erase(s.find(" "), 1);
    }
    std::cout << (is_palindrom(s) ? "yes" : "no") << "\n";
    return 0;
}


