Перевести символ в верхний регистр

Необходимо перевести поданный символ в верхний регистр.

Входные данные
Задан один символ c.

Выходные данные
Если символ является строчной буквой латинского алфавита (то есть буквой от a до z), выведите вместо него аналогичную заглавную букву, иначе выведите тот же самый символ (такая операция называется "перевод в верхний регистр").

Sample Input:
e

Sample Output:
E

Напишите программу. Тестируется через stdin → stdout
Верно решили 679 учащихся
Из всех попыток 35% верных


# ruby
def islatin? (s)
    d = s.ord
    (d >= 65 and d <= 122)
end        

c = gets.chomp
if islatin?(c)
    puts c.capitalize
else
    puts c    
end    

# python
from string import ascii_lowercase

s = input()
print(s.upper() if s in ascii_lowercase else s)


# JS
// put your javascript (node.js) code here
const prompt = (function() {
  const lines = require('fs').readFileSync(0, 'utf8').split('\n');
  return function() {
    if (lines.length > 0)
      return lines.shift()
    const error = Error('EOF when reading a line');
    error.name = 'EOFError';
    throw error;
  }
})();

let str = prompt();
console.log(/[a-z]/.test(str) ? str.toUpperCase() : str);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
    var symbol=Console.ReadLine();
    string check="абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
    bool rus=false;
    for (int i=0;i<check.Length;i++)
     {
      if (char.Parse(symbol)==check[i])
      rus=true;
      }     Console.WriteLine(rus?symbol:symbol.ToUpper()); 
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        String a = new Scanner(System.in).next();
            System.out.println((a.charAt(0)<1040 || a.charAt(0) > 1103) ?  a.toUpperCase():a);
    }
}

# C 
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <wchar.h>
#include <wctype.h>
#include <locale.h>

int main() {
  setlocale(0, "");
  wchar_t c;
  if (scanf("%lc", &c) != 1) return EXIT_FAILURE;
  printf("%lc\n", isalpha(c) ? toupper(c) : c);
  return EXIT_SUCCESS;
}


# C++
#include <iostream>

int main() {
    setlocale(LC_ALL, "Russian");
    std::string c;
    std::cin >> c;
    if ('a' <= c[0] && c[0] <= 'z') std::cout << char(c[0] - 32) << "\n";
    else std::cout << c << "\n";
    return 0;
}




