Проверить, является ли символ цифрой

На вход подается единственный символ. Необходимо определить, является ли данный символ цифрой или нет.

Входные данные
Задан единственный символ c.

Выходные данные
Необходимо вывести  строку yes, если символ является цифрой, и строку no в противном случае.

Sample Input:
с

Sample Output:
no

Напишите программу. Тестируется через stdin → stdout
Верно решили 557 учащихся
Из всех попыток 68% верных


# ruby
c = gets.chomp
#c = 'c'
d = c.ord
#puts d.to_s.size
#puts d
puts ((d >= 48 and d < 58) ? 'yes' : 'no')


# python
print('yes' if input().isdigit() else 'no')


# JS
const readline = require('readline');
const rl = readline.createInterface({
    input: process.stdin,
    output: process.stdout
});
rl.on('line', (str) => {
    console.log(isNaN(str)? 'no':'yes')

});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
 var c=char.Parse(Console.ReadLine());
 Console.WriteLine((Char.IsDigit(c))?"yes":"no");
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        try{
            Integer.parseInt(new Scanner(System.in).next());
            System.out.println("yes");}
        catch(NumberFormatException e){
            System.out.println("no");}
   
    }
}


# C
#include <stdio.h>

int main() {
    int c;
    printf("%s", scanf("%1d", &c) == 1 ? "yes" : "no");
    return 0;
}


# C++
#include <iostream>

int main() {
    char c;
    std::cin >> c;
    std::cout << ('0' <= c && c <= '9' ? "yes" : "no") << "\n";
    return 0;
}






