Мороженое

В кафе мороженое продают по три шарика и по пять шариков. Можно ли купить ровно k шариков мороженого?

Входные данные
Вводится число k (целое, положительное)

Выходные данные
Программа должна вывести слово YES, если при таких условиях можно набрать ровно k шариков (не больше и не меньше), в противном случае - вывести NO.

Sample Input:
8

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 645 учащихся
Из всех попыток 17% верных


# ruby
#0 3 5 6 8 9  11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30
k = gets.to_i
a = [0,3,5,6,8,9]
puts a.include?(k) || k>10 ? "YES" : "NO"


# python
k = int(input())
ls = [1, 2, 4, 7]
if k not in ls:
    print ('YES')
else:
    print ('NO')


# JS
let [k] = require("fs")
  .readFileSync(0, "utf8")
  .split("\n")
  .map(Number);

if (k >= 3 && k !== 4 && k !== 7) {
    console.log("YES");
} else {
    console.log("NO");
}


# C#
using System;

public class MainClass
{
    public static void Main()
    {
       long k = Convert.ToInt64(Console.ReadLine());
       if (k!=1 && k!=2 && k!=4 && k!=7) Console.WriteLine("YES");
       else Console.WriteLine("NO");
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        long k = new Scanner(System.in).nextLong();
        long ice5Balls = k / 5 + 1;
        while (--ice5Balls >= 0 & (k - ice5Balls * 5) % 3 != 0);
        System.out.print(ice5Balls >= 0 ? "YES" : "NO");
    }
}


# C
#include <stdio.h>
char f(unsigned long long k) { return k%3 && k%5 ? k>2 && f(k-3) || k>4 && f(k-5) : 1; }
int main() {
    for (unsigned long long k; scanf("%llu",&k)==1; puts(f(k) ? "YES" : "NO"));
    return 0;
}


# C++
#include <iostream>
#include <iostream>


int main() {
    int k;
    std::cin >> k;  
    
//0 3 5 6 8 9  11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30    
    if ((k == 0 ) ||
        (k == 3) ||
        (k == 5 ) ||
        (k == 6 ) ||
        (k == 8 ) ||
        (k == 9 ) ||        
        (k > 10 )) {
        std::cout << "YES\n";
    } else {
        std::cout << "NO\n";
    }
    return 0;
}







