Количество равных из трех

Входные данные
Даны три целых числа, записанных в отдельных строках. Определите, сколько среди них совпадающих.

Выходные данные
Программа должна вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадают) или 0 (если все числа различны).

Sample Input:
4
3
4

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 779 учащихся
Из всех попыток 65% верных


# ruby
a,b,c = gets.to_i,gets.to_i,gets.to_i
n = 0
n=n+1 if a==b
n=n+1 if a==c
n=n+1 if b==c
puts n==1 ? 2 : n


# python
a,b,c=sorted(int(input())for _ in '...')
print([0,2,3][(a==b)+(b==c)])


# JS 
let [a, b, c] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
console.log((a == b && b == c) ? 3 : (a == b || a == c || b == c) ? 2 : 0);


# C#
using System;
using System.Linq;
using System.Collections.Generic;


public class MainClass
{
    public static void Main()
    {
        int [] num = new int [3];
        for (int i=0; i<num.Length;i++)
        num[i]=int.Parse(Console.ReadLine());
        int count = 0;
        if (num[0]==num[1]&&num[0]==num[2])
        count+=3;
        else if (num[0]==num[1]||num[0]==num[2]||num[1]==num[2])
        count+=2;
        else
        count=0;
        Console.WriteLine(count);
    }
}

# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int a = sc.nextInt();
        int b = sc.nextInt();
        int c = sc.nextInt();
        sc.close();
        
        System.out.print(a == b && a == c ? 3 :
                         a != b && a != c && b !=c ? 0 : 2);
    }
}



# C
#include <stdio.h>
int main() {
    for (int a,b,c; scanf("%d%d%d",&a,&b,&c)==3; )
        puts((char *[]){"0","2","3"}[((a==b)+(b==c)+(c==a)+1)/2]);
    return 0;
}


# C++
#include <iostream>
#include <string>

//сумма любых двух сторон всегда больше третьей стороны, 
//а разность любых двух сторон всегда меньше третьей стороны.
int main() {
    int a, b, c, n=0;
    std::cin >> a >> b >> c;
    std::string output;   
    
    if (a==b) {n=n+1;}
    if (a==c) {n=n+1;}               
    if (b==c) {n=n+1;}    
    
    if (n==1)
    {
        output = "2\n";
    }
    else
    {
        output = std::to_string(n) + "\n";
    }       
        
    std::cout << output;
    return 0;
}





