Существует ли треугольник?

Входные данные
Даны три натуральных числа a, b, c, записанные в отдельных строках. Определите, существует ли невырожденный треугольник с такими сторонами.

Выходные данные
Если треугольник существует, выведите строку YES, иначе выведите строку NO.

Sample Input:
3
4
5

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 739 учащихся
Из всех попыток 59% верных


#сумма любых двух сторон всегда больше третьей стороны, 
#а разность любых двух сторон всегда меньше третьей стороны.
    
# ruby
a,b,c = gets.to_i,gets.to_i,gets.to_i
#puts x1,y1,x2,y2
if a+b>c && b+c>a && a+c>b
    puts "YES"   
elsif (a-b).abs<c && (b-c).abs<a && (a-c).abs<b
    puts "YES" 
else puts "NO" 
end 


# python
a, b, c = int(input()), int(input()), int(input())
print('YES' if a < b + c and b < a + c and c < a + b else 'NO')


# JS
// put your javascript (node.js) code here
let [a, b, c] = require("fs")
  .readFileSync(0, "utf8")
  .split("\n")
  .map(Number);

const res = (a+b>c && b+c>a && a+c>b) ? "YES" : (((a-b).abs<c && (b-c).abs<a && (a-c).abs<b) ? "YES" : "NO");
console.log(res);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
       Input(out int a);
       Input(out int b);
       Input(out int c);
       bool triangle = a<b+c && b<a+c && c<b+a;
  Console.WriteLine(triangle? "YES":"NO");
    }
    public static void Input(out int a)
    {
      a = int.Parse(Console.ReadLine());
    }
}


# java
import java.util.*;
class Main {
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        int a = scan.nextInt();
        int b = scan.nextInt();
        int c = scan.nextInt();
        scan.close();
        int isTrue = 0;
        if (a + b > c) isTrue += 1;
        if (b + c > a) isTrue += 1;
        if (c + a > b) isTrue += 1;
        System.out.println(isTrue == 3 ? "YES" : "NO");
        
    }
}


# C
#include <stdio.h>

int main()
{
    int a, b, c;
    scanf("%d%d%d", &a, &b, &c);
    printf("%s", a + b > c && a + c > b && b + c > a ? "YES" : "NO");
    return 0;
}


# C++
#include <iostream>
#include <string>

//сумма любых двух сторон всегда больше третьей стороны, 
//а разность любых двух сторон всегда меньше третьей стороны.
int main() {
    int a, b, c;
    std::cin >> a >> b >> c;
    std::string output;
       
    if (a+b>c && b+c>a && a+c>b)
    {
        output = "YES\n";
    }
    else if (abs(a-b)<c && abs(b-c)<a && abs(a-c)<b) 
    {
        output = "YES\n";
    }     
    else
    {
        output = "NO\n";
    }    
        
    std::cout << output;
    return 0;
}





