Упорядочить три числа

Дано три числа, записанных в отдельных строках. Упорядочите их в порядке неубывания. Программа должна считывать три числа a, b, c, затем программа должна менять их значения так, чтобы стали выполнены условия a <= b <= c, затем программа выводит тройку a, b, c.

Входные данные
Вводятся три числа, каждое записано в отдельной строке.

Выходные данные
Выведите ответ на задачу.

Sample Input:
1
2
1

Sample Output:
1 1 2

Напишите программу. Тестируется через stdin → stdout
Верно решили 680 учащихся
Из всех попыток 69% верных

# ruby
a,b,c = gets.to_f, gets.to_f, gets.to_f
if a>b then a,b=b,a end
if b>c then b,c=c,b end    
if a>b then a,b=b,a end     
    
if a==a.to_i then a = a.to_i end  
if b==b.to_i then b = b.to_i end
if c==c.to_i then c = c.to_i end 
    
print "#{a} #{b} #{c}"


# python
a, b, c = (int(input()) for _ in range(3))
if a > b: a, b = b, a
if a > c: a, c = c, a
if b > c: b, c = c, b
print(a, b, c)
# print(*sorted(int(input()) for _ in range(3)))



# JS
let [a, b, c] = require('fs').readFileSync(0, 'utf8').split("\n").map(Number);

[a, b] = [[a, b], [b, a]][+(a>b)];
[b, c] = [[b, c], [c, b]][+(b>c)];
[a, b] = [[a, b], [b, a]][+(a>b)];

console.log(a, b, c);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        Input(out int a);
        Input(out int b);
        Input(out int c);
 Console.WriteLine((a>=b&&a>=c)?((b>=c)?$"{c} {b} {a}":$"{b} {c} {a}"):(a>=c)?$"{c} {a} {b}":$"{a} {c} {b}");
    }
    static void Input (out int x)
    {
        x=int.Parse(Console.ReadLine());
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        int a = in.nextInt(), b= in.nextInt(), c= in.nextInt();
        in.close();
        int  max=Math.max(a,Math.max(b,c));
        int min=Math.min(a,Math.min(b,c));
        int midl =a+b+c-max-min;
        System.out.println(min+" "+midl+" "+max);
    }
}



# C
#include <stdio.h>
#define SWAP(T, a, b) ({T t = a; a = b; b = t;})

int main() {
    int a, b, c;
    scanf("%d %d %d", &a, &b, &c);
    
    if (a > b) SWAP(int, a, b);
    if (b > c) SWAP(int, b, c);
    if (a > b) SWAP(int, a, b);
    
    printf("%d %d %d", a, b, c);
    return 0;
}


# C++
#include <iostream>

int main() {
    int a, b, c;
    std::cin >> a >> b >> c;
    //сортировка пузырьком
    if (a > b) std::swap(a, b);
    if (a > c) std::swap(a, c);
    if (b > c) std::swap(b, c);
    std::cout << a << " " << b << " " << c << "\n";
    return 0;
}





