Утренняя пробежка

В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 10% от предыдущего значения. По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.

Входные данные
Программа получает на вход действительные числа x и y

Выходные данные
Программа должна вывести одно натуральное число.

Sample Input:
10
20

Sample Output:
9

Напишите программу. Тестируется через stdin → stdout
Верно решили 728 учащихся
Из всех попыток 72% верных


# put your ruby code here
x,y = gets.to_i, gets.to_i
#y = 16
k = 1

while x<=y
    x += x * 0.1
    k += 1
end 

puts k


# put your python code here
x, y, day = int(input()), int(input()), 1
while x < y:
    x *= 1.1
    day += 1
print(day)


# JS
let [x, y] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);

let i = 1;
while (x < y) {
  x = x * 1.1;
  i++;
}

console.log(i);


# C#
using System;

var x = double.Parse(Console.ReadLine());
var y = double.Parse(Console.ReadLine());
var result = 1;
while (x < y)
{
    x += x * 0.1;
    result++;
}
Console.Write(result);


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner scan=new Scanner(System.in);
        double x=scan.nextDouble();
        double y=scan.nextDouble();
        int i=1;
        while(x<=y){
            x = 1.1*x;
            i+=1;
        }
        System.out.print(i);
    }
}


# C
#include <stdio.h>
int main() {
    float x,y,i=1;
    scanf("%f%f",&x,&y);
    while (x<y) (x*=1.1, ++i);
    printf("%.0f\n",i);
    return 0;
}


# C++
#include <iostream>

int main() {
    double x, y, i = 1;
    std::cin >> x >> y;
    while (x < y) {
        x += x / 10;
        i++;
    }
    std::cout << i << "\n";
    return 0;
}



