Список квадратов

Выведите все точные квадраты натуральных чисел, не превосходящие данного числа N.

Входные данные
Задано единственное целое число N

Выходные данные
Необходимо вывести  все точные квадраты натуральных чисел, не превосходящие данного числа N.

Sample Input:
15

Sample Output:
1
4
9

Напишите программу. Тестируется через stdin → stdout
Верно решил 641 учащийся
Из всех попыток 50% верных



# ruby
n = gets.to_i
m=[]
cnt=1
loop do
    sqr = cnt.pow(2)
    
    if sqr<=n
        puts sqr
    else
        break
    end
    cnt += 1
end  


# python
n, x = int(input()), 1
while x ** 2 <= n:
    print(x ** 2)
    x += 1


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let n = +d;
    let result = 1;
    
    while ( result**2 <= n) {
        console.log( result**2 );
        result++;
    }

  });


# C#
using System;

var x = int.Parse(Console.ReadLine());
int i = 0;
while (i <= x)
{
    i++;
    if (i * i <= x) Console.WriteLine(i * i);
}

# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner scan=new Scanner(System.in);
        int n=scan.nextInt();
        int x = 1;
        int y = 1;
        while(y<=n){
            System.out.println(y);
            x++;
            y = x*x;
        }
    }
}


# C
#include <stdio.h>
int main() {
    int n=(scanf("%d",&n),n+1), x=1, q;
    while (q=x*x, q<n) (printf("%d\n",q), ++x);
    return 0;
}



# C++
#include <iostream>

bool is_square(int n) {
    for (int i = 1; i <= n; i++) {
        if (i * i == n) return true;
    }
    return false;
}

int main() {
    int n;
    std::cin >> n;
    for (int i = 1; i <= n; i++) {
        if (is_square(i)) std::cout << i << "\n";
    }
    return 0;
}




