Точная степень двойки

Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, или слово NO в противном случае.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Sample Input:
4

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 702 учащихся
Из всех попыток 51% верных



# ruby
n = gets.to_i
osn = 2
b = 0

while osn<=n
    if osn == n 
        b = 1
        break
    end    
    osn *=2
end

puts b == 1 || n == 1 ? 'YES' : 'NO'


# python
n = int(input())
while n > 1:
    if not n % 2: n /= 2
    else: break
print('YES' if n == 1 else 'NO')


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let n = +d;
    let result = 'NO';
    let temp = 1;
     
    while ( temp < n) {
        temp = temp*2;
    }
    
    if (temp === n) result = 'YES';

    console.log( result );

  });


# C#
using System;

var x = int.Parse(Console.ReadLine());
int i = 1;
var res = "NO";
while (i <= x)
{
    if (i == x) res = "YES";
    i *= 2;
}
Console.Write(res);


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner scan=new Scanner(System.in);
        int n=scan.nextInt();
        if (n==1){
            System.out.print("YES");
            return;
        }
        int x = 1;
        int i=0;
        while(x<=n){
            x = 2*x;
            if (x==n){
                System.out.print("YES");
                return;
            }
            i+=1;
        }
        System.out.print("NO");
    }
}


# C
#include <stdio.h>
int main() {
    int x;
    scanf("%d",&x);
    while (x%2==0) x/=2;
    puts(x==1 ? "YES" : "NO");
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, p = 1;
    std::cin >> n;
    while (p < n) p *= 2;
    std::cout << (p == n ? "YES" : "NO") << "\n";
    return 0;
}


