Банковские проценты

Вклад в банке составляет x рублей. Ежегодно он увеличивается на p процентов, после чего дробная часть копеек отбрасывается. Каждый год сумма вклада становится больше. Определите, через сколько лет вклад составит не менее y рублей.

Входные данные
Программа получает на вход три натуральных числа: x, p, y.

Выходные данные
Программа должна вывести одно целое число.

Sample Input:
100
10
200

Sample Output:
8

Напишите программу. Тестируется через stdin → stdout
Верно решили 702 учащихся
Из всех попыток 67% верных


# ruby 
x,p,y = gets.to_i, gets.to_i, gets.to_i
#x,p,y = 100, 10, 200
k = 0

while x<y 
    x += (x*p)/100 
    k += 1
end 

#puts x,p,y
puts k



# python
x, p, y = [int(input()) for i in range(3)]
i = 0
while x<=y:
    x = x*(p/100+1)
    i+=1
print(i)  


# JS
// put your javascript (node.js) code here
var [x, p, y] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
var k = 0;

while (x < y) {
  x += (x * p)/100;
  k++;
}

console.log(k);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        double x=int.Parse(Console. ReadLine());
        int p=int.Parse(Console. ReadLine());
        int y=int.Parse(Console. ReadLine());
        int years=0;
        while(x<y)
        {
         x+=x*p/100;         
         ++years;                     
        }
        Console.WriteLine(years);
    }
}


# java
import java.util.Scanner;
import java.util.stream.DoubleStream;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int deposit = scanner.nextInt();
        double percent = scanner.nextInt() / 100.0;
        int goal = scanner.nextInt();
        long years = DoubleStream.iterate(deposit, d -> d < goal, d -> d * (1 + percent)).count();
        System.out.println(years);
    }
}


# C
#include <stdio.h>
int main() {
    float x,p,y,i=0;
    scanf("%f%f%f",&x,&p,&y);
    while (x<y) (x*=(100+p)/100, ++i);
    printf("%.0f\n",i);
    return 0;
}


# C++
#include <iostream>

int main() {
    int x, p, y, i = 0;
    std::cin >> x >> p >> y;
    while (x < y) {
        x += x / 100.0 * p;
        i++;
    }
    std::cout << i << "\n";
    return 0;
}



