Исполнитель Раздвоитель

Исполнитель Раздвоитель преобразует натуральные числа. У него есть две команды: “Вычесть 1” и “Разделить на 2”, первая команда уменьшает число на 1, вторая команда уменьшает число в два раза, если оно чётное, иначе происходит ошибка.

Входные данные
Дано: два натуральных числа A и B (A>B).

Выходные данные
Напишите алгоритм для Раздвоителя, который преобразует число A в число B и при этом содержит минимальное число команд. Команды алгоритма нужно выводить по одной в строке, первая команда обозначается, как -1, вторая команда как :2.

Sample Input:
179
20

Sample Output:
-1
:2
-1
:2
:2
-1
-1

Напишите программу. Тестируется через stdin → stdout
Верно решили 586 учащихся
Из всех попыток 62% верных


# ruby
a, b = gets.to_i, gets.to_i
while a > b
    if a % 2 == 0 and a >= 2 * b
        puts ':2'
        a /= 2        
    else
        puts '-1'
        a -= 1
    end
end

# put your python code here
a, b = int(input()), int(input())
f1 = 1
f2 = 0
f = 0
cnt = 1
#n = 6
    
while a > b:
    if (a%2 != 0) or (a/2<b):
        a -= 1
        print ("-1")
    else:
        a /= 2
        print (":2")


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let [a, b] = d.toString().split('\n');
    a = +a;
    b = +b;
    let result = '';
    
    while ( a > b) {
        if (a%2 === 0 && a/2>b) {
            console.log(':2');
            a = a / 2;
        } else {
            console.log('-1');
            a--;
        }
    }

  })


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        Input (out int a);
        Input(out int b);
        while (a!=b)
        {
            if(a/2>=b&&a%2==0)
            {
                Console.WriteLine(":2");
                a/=2;
            }
            else
            {
                Console.WriteLine("-1");
                a-=1;
            }
        }
    }
    static void Input (out int x)
    {
        x=int.Parse(Console.ReadLine());
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int a = sc.nextInt();
        int b = sc.nextInt();
        sc.close();
        
        while (a != b) {
            if (a%2 == 0 && a/2 >= b) {
                a /= 2; 
                System.out.println(":2");
            }
            else {
                a--;
                System.out.println("-1");
            }          
        }
    }
}


# C
#include <stdio.h>
int main() {
    int a,b,x=(scanf("%d%d",&a,&b),a);    
    while (x>b) x%2 || x%2==0 && x/2<b ? (--x, puts("-1")) : (x/=2, puts(":2"));
    return 0;
}



# C++
#include <iostream>

int main() {
    int a, b;
    std::cin >> a >> b;
    while (a != b) {
        if (a % 2 == 0 && a / 2 >= b) {
            std::cout << ":2\n";
            a /= 2;
        } else {
            std::cout << "-1\n";
            a -= 1;
        }
    }
    return 0;
}
