Список степеней двойки

По данному числу N распечатайте все целые степени двойки, не превосходящие N, в порядке возрастания.

Операцией возведения в степень пользоваться нельзя!

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу.

Sample Input:
50

Sample Output:
1 2 4 8 16 32

Напишите программу. Тестируется через stdin → stdout
Верно решили 711 учащихся
Из всех попыток 44% верных


# ruby
n = gets.to_i
step = 1
while step<=n
    print "#{step} "
    step *=2
end    


# python
n, p = int(input()), 0.5
while (p := int(p * 2)) <= n: print(p, end=' ')


# JS
var stdin = process.openStdin();

stdin.addListener("data", function(d) {
    let n = +d;
    let result = '';
    let temp = 1;
     
    while ( temp <= n) {
       result = result + temp + ' ';
       temp = temp*2;
    }

    console.log( result );

  });


# C#
using System;

var x = int.Parse(Console.ReadLine());
int i = 1;
while (i <= x)
{
    Console.Write(i + " ");
    i *= 2;
}



# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner scan=new Scanner(System.in);
        int n=scan.nextInt();
        if (n!=0){
            System.out.print(1);
            System.out.print(' ');
        }
        int x = 1;
        int i=0;
        while(true){
            x = 2*x;
            if (x<=n){
                System.out.print(x);
                System.out.print(' ');
            }else{
                break;
            }
            i+=1;
        }
    }
}


# C
#include <stdio.h>
int main() {
    int x=(scanf("%d",&x),x+1), i=1, r=1;    
    while (r<x) (printf("%d ",r), r=1<<i, ++i);
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, p = 1;
    std::cin >> n;
    while (p <= n) {
        std::cout << p << " ";
        p *= 2;
    }
    return 0;
}




