Ладья

Требуется определить, бьет ли ладья, стоящая на клетке с указанными координатами (номер строки и номер столбца), фигуру, стоящую на другой указанной клетке.

Входные данные
Вводятся четыре числа: координаты ладьи (два числа) и координаты другой фигуры (два числа), каждое число вводится в отдельной строке. Координаты - целые числа в интервале от 1 до 8.

Выходные данные
Требуется вывести слово YES, если ладья сможет побить фигуру за 1 ход и NO - в противном случае.

Sample Input:
1
1
2
2

Sample Output:
NO

Напишите программу. Тестируется через stdin → stdout
Верно решили 1 047 учащихся
Из всех попыток 70% верных


# ruby
x1,y1,x2,y2 = gets.to_i,gets.to_i,gets.to_i,gets.to_i  
puts x1==x2 || y1==y2 ? "YES" : "NO"


# python
l = [int(input()) for _ in range(4)]
print('YES' if l[0] == l[2] or l[1] == l[3] else 'NO')


# JS
let [x1, y1, x2, y2] = require('fs').readFileSync(0, 'utf8').split('\n');
console.log((x1 == x2 || y1 == y2) ? 'YES' : 'NO');


# C#
using System;
using static System.Console;

public class MainClass
{
    public static void Main()
    {
        var x = new int[4];
        
        for (int i = 0; i < x.Length; i++)
            x[i] = Int32.Parse(ReadLine());
        
        bool res = x[0] == x[2] || x[1] == x[3];
        WriteLine(res ? "YES" : "NO");
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int x1 = sc.nextInt();
        int y1 = sc.nextInt();
        int x2 = sc.nextInt();
        int y2 = sc.nextInt();
        
        System.out.print((x1 - x2) * (y1 - y2) == 0 ? "YES" : "NO");
    }
}


# C
#include <stdio.h>

int main() {
    int x1, y1, x2, y2;
    scanf("%d %d %d %d", &x1, &y1, &x2, &y2);
    puts(x1 == x2 || y1 == y2 ? "YES" : "NO");
    return 0;
}


# C++
#include <iostream>

int main() {
    int x1,y1,x2,y2;
    std::cin >> x1 >> y1 >> x2 >> y2;
    std::cout << ( ((x1==x2) || (y1==y2)) ? "YES" : "NO" ) << "\n";
    return 0;
}







