Фишки

В каждую крайнюю клетку квадратной доски поставили по фишке. Могло ли оказаться, что выставлено ровно k фишек? (Например, если доска 2x2, то выставлено 4 фишки, а если 6x6 - то 20).

Входные данные
Вводится одно натуральное число k, не превосходящее 30000

Выходные данные
Программа должна вывести слово YES, если существует такой размер доски, на который будет выставлено ровно (не больше, и не меньше) k фишек, в противном случае - вывести слово NO.

Sample Input:
20

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 785 учащихся
Из всех попыток 49% верных


# ruby
k = gets.to_i
puts k%4==0 || k==1 ? 'YES' : 'NO'


# python
n = int(input())
print('YES' if n == 1 or n  % 4 == 0 else 'NO')


# JS
process.stdin.setEncoding('utf8');
process.stdin.on('readable', () => main(process.stdin.read()));

function main(input) {
  if (!input) return;
  const n = parseInt(input.trim(), 10);
  // n = (x - 1) * 4
  // x = n / 4 + 1
  const result = n % 4 === 0 || n === 1;
  console.log(result ? 'YES' : 'NO');
}


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int x = int.Parse(Console.ReadLine());
        
        Console.WriteLine(x % 4 == 0 || x == 1 ? "YES" : "NO");
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        int k = new Scanner(System.in).nextInt();
        System.out.print( k % 4 == 0 || k == 1 ? "YES" : "NO");
    }
}


# C
#include <stdio.h>

int main(void)
{
    int k;
    scanf("%d", &k);
    if (k == 1 || k % 4 == 0)
    {
        printf("%s\n", "YES");
    }
    else
    {
        printf("%s\n", "NO");
    }
    
    return 0;
}


# C++
#include <iostream>

int main() {
    int k;
    std::cin >> k;
    std::cout << ( ((k%4==0) || (k==1)) ? "YES" : "NO" ) << "\n";
    return 0;
}




