Тестирующая система

В условии одной из задач на неком сайте написано: “Если данное четырехзначное число является симметричным, выведите 1, иначе выведите любое другое целое число”. Для проверки задачи используются заранее подготовленные примеры и правильные ответы на них.

Школьнику кажется, что он решил эту задачу, но тестирующая система почему-то не принимает его решение. Школьник думает, что это происходит оттого, что он выводит не то любое другое число, которое записано в правильных ответах.

Напишите программу, которая по ответу, записанному в тестирующей системе, и по ответу школьника определяет, верно ли школьник решил задачу.

Входные данные
Программа получает на вход два числа: ответ, записанный в тестирующей системе, и ответ школьника.

Выходные данные
Программа должна вывести YES, если школьник дал верный ответ, и NO в противном случае.

Sample Input 1:
11
-1

Sample Output 1:
YES

Sample Input 2:
1111
1

Sample Output 2:
NO

Напишите программу. Тестируется через stdin → stdout
Верно решили 852 учащихся
Из всех попыток 33% верных


# ruby
t,s  = gets.to_i, gets.to_i
puts s==1 && t==1 ? "YES" : s==1 && t!=1 ? "NO" : s!=1 && t!=1 ? "YES" : "NO"


# python
test_sys, otvet = int(input()), int(input())
print("YES" if (test_sys == 1 and otvet == 1) or (test_sys != 1 and otvet != 1) else "NO")


# JS
let [n, m] = require("fs").readFileSync(0, "utf8").split("\n").map(Number);
function testingSystem(n, m) {
  if (n === 1 && m === 1) {
    return "YES";
  } else if (m !== 1) {
    return "YES";
  }
  return "NO";
}
console.log(testingSystem(n, m));


# C#
using System;
public class MainClass
{
    public static void Main()
    {
        int iAI = int.Parse(Console.ReadLine());
        int boy = int.Parse(Console.ReadLine());
        if((iAI == 1 && boy == 1) || (iAI != 1 && boy != 1))
            Console.WriteLine("YES");
        else
            Console.WriteLine("NO");
    }
}


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int a = scanner.nextInt();
        int b = scanner.nextInt();
        System.out.println((a==1)==(b==1)? "YES":"NO");
    }
}


# C
#include <stdio.h>

int main() {
    int a, b; scanf("%d %d", &a, &b);
    puts(!--a ^ !--b ? "NO" : "YES");
    return 0;
}


# C++
#include <iostream>

int main() {
    int t, s;
    std::cin >> t >> s;
    std::cout << ( (s==1 && t==1) ? "YES" : ((s==1 && t!=1) ? "NO" : ((s!=1 && t!=1) ? "YES" : "NO")) ) << "\n";
    return 0;
}





