Король

Поле шахматной доски определяется парой чисел (a, b), каждое от 1 до 8, первое число задает номер столбца, второе – номер строки. Заданы две клетки. Определите, может ли шахматный король попасть с первой клетки на вторую за один ход.

Входные данные
Даны 4 целых числа от 1 до 8 каждое, первые два задают начальную клетку, вторые два задают конечную клетку. Начальная и конечная клетки не совпадают. Числа записаны в отдельных строках.

Выходные данные
Программа должна вывести YES, если из первой клетки ходом короля можно попасть во вторую, или NO в противном случае.

Sample Input:
4
4
5
5

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 828 учащихся
Из всех попыток 43% верных


# ruby
x1,y1,x2,y2 = gets.to_i,gets.to_i,gets.to_i,gets.to_i
puts (x1 - x2).abs <= 1 && (y1 - y2).abs <= 1 ? "YES" : "NO"

# python
x, y, x1, y1 = (int(input()) for _ in range(4))

print('YES' if (abs(x - x1) == 1 or abs(x - x1) == 0) and (abs(y - y1) == 0 or abs(y - y1) == 1) else 'NO')


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        let input_array = data.toString().split("\n");
        let [a, b, c, d] = input_array.map(element => parseInt(element));
        console.log(main(a, b, c, d));
    }
});

function main(a, b, c, d) {
    return (Math.abs(a - c) <= 1 && Math.abs(d - b) <= 1) ? "YES" : "NO"
}


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int x1 = int.Parse(Console.ReadLine());
        int y1 = int.Parse(Console.ReadLine());
        int x2 = int.Parse(Console.ReadLine());
        int y2 = int.Parse(Console.ReadLine());
        if(Math.Abs(x1 - x2) <= 1 && Math.Abs(y1 - y2) <= 1)
            Console.WriteLine("YES");
        else
            Console.WriteLine("NO");
    }
}


# java
import java.util.*;
import java.lang.*;
class Main {
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        int x1 = scan.nextInt();
        int y1 = scan.nextInt();
        int x2 = scan.nextInt();
        int y2 = scan.nextInt();
        scan.close();
        System.out.println((Math.abs(x1 - x2) * Math.abs(y1 - y2)) == 1 || (Math.abs(x1 - x2) == 1 && y1 == y2) || (x1 == x2 && Math.abs(y1 - y2) == 1) ? "YES" : "NO");
        
    }
}


# C
#include <stdio.h>
#include <stdlib.h>

int main() {
    int x, y, X, Y;
    scanf("%d %d %d %d", &x, &y, &X, &Y);
    
    int res = abs(x - X) <= 1 &&
              abs(y - Y) <= 1;
    
    return puts(res ? "YES" : "NO") && 0;
}


# C++
#include <iostream>

int main() {
    int x1,y1,x2,y2;
    std::cin >> x1 >> y1 >> x2 >> y2;
    std::cout << ( ((abs(x1 - x2) <= 1) && (abs(y1 - y2) <= 1)) ? "YES" : "NO" ) << "\n";
    return 0;
}



