Слон

Требуется определить, бьет ли слон, стоящий на клетке с указанными координатами (номер строки и номер столбца), фигуру, стоящую на другой указанной клетке.

Входные данные
Вводятся четыре числа: координаты слона и координаты другой фигуры. Координаты - целые числа в интервале от 1 до 8.

Выходные данные
Требуется вывести слово YES, если слон способен побить фигуру за 1 ход, в противном случае вывести слово NO

Sample Input:
1
1
5
5

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 923 учащихся
Из всех попыток 46% верных


# ruby
x1,y1,x2,y2 = gets.to_i,gets.to_i,gets.to_i,gets.to_i 
#x1,y1,x2,y2 = 2,2,1,1
puts (x1-x2).abs == (y1-y2).abs ? "YES" : "NO"


# python
a1, b1, a2, b2 = [int(input()) for i in range(4)]
if a1+b1==a2+b2 or a1-b1==a2-b2:
    print('YES')
else:
    print('NO')


# JS
process.stdin.on('readable', () => {
    let data = process.stdin.read();
    if (data) {
        const [ax, ay, bx, by] = data.toString().split('\n');
        console.log((Math.abs(ax - bx) === Math.abs(ay - by)) ? 'YES' : 'NO');
    }
});


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int x1 = int.Parse(Console.ReadLine());
        int y1 = int.Parse(Console.ReadLine());
        int x2 = int.Parse(Console.ReadLine());
        int y2 = int.Parse(Console.ReadLine());
        if(Math.Pow((x1 - x2), 2) == Math.Pow((y1 - y2), 2))
            Console.WriteLine("YES");
        else
            Console.WriteLine("NO");
    }
}


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int x1 = sc.nextInt(); // координата x слона
        int y1 = sc.nextInt(); // координата y слона
        int x2 = sc.nextInt(); // координата x другой фигуры
        int y2 = sc.nextInt(); // координата y другой фигуры
        
        // проверяем, находится ли другая фигура на диагонали с нашим слоном
        if (Math.abs(x1 - x2) == Math.abs(y1 - y2)) {
            System.out.println("YES");
        } else {
            System.out.println("NO");
        }
    }
}


# C
#include <stdio.h>
#include <stdlib.h>

int main() {
    int x, y, X, Y;
    scanf("%d %d %d %d", &x, &y, &X, &Y);
    
    int res = (abs(x - X) == abs(y - Y));
    puts(res ? "YES" : "NO");
    return 0;
}


# C++
#include <iostream>

int main() {
    int x1,y1,x2,y2;
    std::cin >> x1 >> y1 >> x2 >> y2;
    std::cout << ( (abs(x1-x2) == abs(y1-y2)) ? "YES" : "NO" ) << "\n";
    return 0;
}
