Сдача

Товар стоит a руб. b коп. За него заплатили c руб. d коп. Сколько сдачи требуется получить?

Входные данные
Вводятся 4 числа: a, b, c и d.

Выходные данные
Необходимо вывести 2 числа: e и f, число рублей и копеек, соответственно. В случае, если денег для покупки недостаточно, вывести «Денег недостаточно».

Sample Input:
5
5
6
5

Sample Output:
1 0

Напишите программу. Тестируется через stdin → stdout
Верно решили 670 учащихся
Из всех попыток 34% верных


# ruby
a, b, c, d = gets.to_i, gets.to_i, gets.to_i, gets.to_i
ab = a*100 + b
cd = c*100 + d 
ef = cd - ab
e = ef/100
f = ef - e*100
#a, b = 0, 1
 
puts ef<0 ? 'Денег недостаточно' : "#{e} #{f}"


# python
a, b, c, d = [int(input()) for i in range(4)]
x = a*100+b
y = c*100+d
z = y - x
e = z//100
f = z%100
if e<0:
    print('Денег недостаточно')
else:
    print(e, f)
    

# JS
let [a, b, c, d] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);
let change = (c * 100 + d) - (a * 100 + b);
let e = Math.floor(change / 100);
let f = change - e * 100;
console.log(change < 0 ? 'Денег недостаточно' : `${e} ${f}`);


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int a = Convert.ToInt32(Console.ReadLine());
       int b = Convert.ToInt32(Console.ReadLine());
        int c = Convert.ToInt32(Console.ReadLine());
       int d = Convert.ToInt32(Console.ReadLine());
        int ab = a*100+b;
        int cd = c*100 +d;
        if (cd<ab) Console.WriteLine("Денег недостаточно");
        else Console.WriteLine((cd-ab)/100+" "+(cd-ab)%100);
        
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int a = sc.nextInt();
        int b = sc.nextInt();
        int c = sc.nextInt();
        int d = sc.nextInt();
        
        int price = a * 100 + b;
        int balance = c * 100 + d;
        int amount = balance - price;
        
        System.out.println(amount < 0 ? "Денег недостаточно" : amount / 100 + " " + amount % 100);
    }
}


# C
#include <stdio.h>
int main() {
    for (int a,b,c,d; scanf("%d%d%d%d",&a,&b,&c,&d)==4; )
        d=100*(c-a)+d-b, d<0 ? puts("Денег недостаточно") : printf("%d %d\n",d/100,d%100);
    return 0;
}


# C++
#include <iostream>
#include <string>

int main() {
    int a, b, c, d, e, f, ab, cd, ef;
    std::cin >> a >> b >> c >> d;
    std::string output;
    
    ab = a*100 + b;
    cd = c*100 + d; 
    ef = cd - ab;
    e = ef/100;
    f = ef - e*100;    
    //a, b = 0, 1 
    
    if (ef<0)
    {
        output = "Денег недостаточно\n";
    }
    else
    {
        output = std::to_string(e) + " " + std::to_string(f);
    }

    std::cout << output;
    return 0;
}






