Шоколадка

Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

Входные данные
Вводятся 3 числа: n, m и k; k не равно n × m. Гарантируется, что количество долек в шоколадке не превосходит 30000.

Выходные данные
Программа должна вывести слово YES, если возможно отломить указанное число долек, в противном случае вывести слово NO.

Sample Input:
3
2
4

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 783 учащихся
Из всех попыток 40% верных


# ruby
n,m,k = gets.to_i,gets.to_i,gets.to_i
#n,m,k = 1,2,10
puts (k%n==0 || k%m==0) && n*m>k  ? "YES" : "NO"


# python
n, m, k = [int(input()) for i in range(3)]
if (k%m==0 or k%n==0) and k<n*m:
    print('YES')
else:
    print('NO')


# JS
var stdin = process.openStdin();
stdin.addListener("data", function(data) {
    let d = data.toString().split('\n');        
    console.log((+d[2]% +d[0] === 0 || +d[2]% +d[1] === 0)?'YES':'NO');
  });


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        int m = int.Parse(Console.ReadLine());
        int k = int.Parse(Console.ReadLine());
        if((n * m > k) && (k % n == 0 || k % m == 0))
            Console.WriteLine("YES");
        else
            Console.WriteLine("NO");
    }
}


# java
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        int n = scan.nextInt();
        int m = scan.nextInt();
        int k = scan.nextInt();
        if ((k%n==0 || k%m==0) && m*n>=k ) {
            System.out.println("YES");
        }
        else {
            System.out.println("NO");
        }
    }
}


# C
#include <stdio.h> 

int main() {
    int n, m, k;
    scanf("%d %d %d", &n, &m, &k);
    
    int res = n * m >= k && !(k % n && k % m);
        
    puts(res ? "YES" : "NO");
    return 0;
}


# C++
#include <iostream>

int main() {
    int n, m, k;
    std::cin >> n >> m >> k;
    std::cout << ( (((k%n==0) || (k%m==0)) && (n*m>k))  ? "YES" : "NO" ) << "\n";
    return 0;
}


