Високосный год

Требуется определить, является ли данный год високосным. (Напомним, что год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.)

Входные данные
Вводится единственное число - номер года (целое, положительное, не превышает 30000).

Выходные данные
Требуется вывести слово YES, если год является високосным и NO - в противном случае.

Sample Input:
2000

Sample Output:
YES

Напишите программу. Тестируется через stdin → stdout
Верно решили 1 368 учащихся
Из всех попыток 45% верных


# ruby
x = gets.to_i
puts x%400==0 ? "YES" : x%4==0 && x%100!=0 ? "YES" : "NO"


# python
x = int(input())
if (x%4==0 and x%100!=0) or x%400==0:
    print('YES')
else:
    print('NO')


# JS
let y = Number(require('fs').readFileSync(0, 'utf8'));
console.log(!(y % 4) && (y % 100) || !(y % 400) ? 'YES' : 'NO');


# C#
using System;

public class MainClass
{
    public static void Main()
    {
        int x = int.Parse(Console.ReadLine());
        
        Console.WriteLine(((x % 4 == 0) && (x % 100 != 0) || (x % 400 == 0)) ? "YES" : "NO");
    }
}


# java   
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        
        int y = sc.nextInt();
        
        System.out.print((y%400==0) || (y%4==0 && y%100!=0) ? "YES" : "NO");
    }
}


# C
#include <stdio.h>

int main() {
    int year; scanf("%d", &year);
    
    char* answer[] = {"NO", "YES"};
    
    int is_leap = !(year % 400) || 
        year % 100 && !(year % 4);
        
    puts(answer[is_leap]);
    return 0;
}   


# C++
#include <iostream>

int main() {
    int x;
    std::cin >> x;
    std::cout << ( ((x%400)==0) ? "YES" : ((((x%4)==0) && ((x%100)!=0)) ? "YES" : "NO") ) << "\n";
    return 0;
}