Наивный НОД

Найдите НОД (наибольший общий делитель) двух чисел.

Входные данные
Вводятся два натуральных числа, не превосходящих 10000, разделенные пробелом.

Выходные данные
Выведите одно число - их наибольший общий делитель.

Sample Input:
2 4

Sample Output:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 122 учащихся
Из всех попыток 78% верных


# put your ruby code here
m,n = gets.split.map(&:to_i)
m_a, n_a, a = [], [], []

1.upto(m) do |i|  
    if m % i==0 
        m_a.push(i)
    end
end

1.upto(n) do |i|  
    if n % i==0 
        n_a.push(i)
    end
end

n_a.each do |i| 
    if m_a.include?(i)
        a.push(i) 
    end 
end 

p a[-1]


# pyhon
a, b = map(int, input().split())

while b:
    a, b = b, a%b
    pass
print(a)


# JS
const nod = (x, y) => {
    if (y > x)
        return nod(y, x);
    if (!y)
        return x;
    return nod(y, x % y);
}

let [m, n] = require('fs').readFileSync(0, 'utf8').split(' ').map(Number);

console.log(nod(m, n));


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int n=myscan.nextInt(),m=myscan.nextInt();
        for(int i=n;i>0;i--)
            if(n%i==0&&m%i==0){System.out.print(i);break;}
    }
}


# C++
#include <iostream>
int gcd(int a,int b) {
  return b?gcd(b,a%b):a;
}
int main() {
    int a,b;
    std::cin>>a>>b;
    std::cout<<gcd(a,b);
    return 0;
}

