Алгоритм Евклида

По данным натуральным числам n и m найдите их наибольший общий делитель.

Входные данные
Программа получает на вход 2 натуральных числа m и n. Числа m и n не превосходят 109.

Выходные данные
Программа должна вывести наибольший общий делитель двух данных чисел.

Sample Input 1:
6
5

Sample Output 1:
1

Sample Input 2:
12
14

Sample Output 2:
2

Напишите программу. Тестируется через stdin → stdout
Верно решили 237 учащихся
Из всех попыток 74% верных


# ruby
def nod(a,b)
    while a != 0 and b != 0 do
        if a > b
            a = a % b
        else
            b = b % a
        end
    end
    return a+b
end  

a,b  = gets.to_i, gets.to_i 
puts nod(a,b)


# JS
const nod = (x, y) => {
    if (y > x)
        return nod(y, x);
    if (!y)
        return x;
    return nod(y, x % y);
}

let [m, n] = require('fs').readFileSync(0, 'utf8').split('\n').map(Number);

console.log(nod(m, n));


# java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int x = input.nextInt();
        int y = input.nextInt();

        int greatestCommonDivisor = gcd(x, y);
        System.out.println(greatestCommonDivisor);
    }

    private static int gcd(int a, int b) {
        while (a != b) {
            if (a > b) a = a - b;
            else b = b - a;
        }
        return a;
    }
}


# C++
#include <iostream>

using namespace std;

int main()
{
    int a, b, nod, x;
    cin >> a >> b;
    if(a < b)
        x = a;
    else
        x = b;
    for(int i = 1; i <= x; i++)
        if(a % i == 0 && b % i == 0)
            nod = i;
    cout << nod;
    return 0;
}