Теорема Лагранжа
Теорема Лагранжа утверждает, что любое натуральное число можно представить в виде суммы четырех точных квадратов. По данному числу n найдите такое представление: напечатайте от 1 до 4 натуральных чисел, квадраты которых дают в сумме данное число.

Входные данные
Программа получает на вход одно натуральное число n < 10000.

Выходные данные
Программа должна вывести от 1 до 4 натуральных чисел, квадраты которых дают в сумме данное число.

Sample Input 1:
3

Sample Output 1:
1 1 1

Sample Input 2:
7

Sample Output 2:
2 1 1 1

Напишите программу. Тестируется через stdin → stdout
Верно решили 104 учащихся
Из всех попыток 23% верных


# ruby
def lagrange(x, pow, q)
    b = (x**(1.to_f/pow)).to_i
    if (x - b ** pow) == 0 then return b.to_s end    
    if q == 1 then return 0 end    

    while (lagrange(x - b ** pow, pow, q - 1) == 0)
        b -= 1
        if b <= 0 then return 0 end
    end
        
    return b.to_s + ' ' + lagrange(x - b ** pow, pow, q - 1)   
end          

n  = gets.to_i      
print lagrange(n, 2, 4)


# python
def lagrang(n):
    res_dict = {i ** 2 + j ** 2: [i, j] for i in range(int(n ** 0.5) + 1) for j in range(i, int(n ** 0.5) + 1)}
    for i in res_dict:
        if n - i in res_dict:
            return list(filter(lambda x: x, res_dict[i] + res_dict[n - i]))

print(*lagrang(int(input())))


# java
import java.util.Scanner;
class Main {
    public static void lag(int n,int ms[],int t){
              int l=n,s=0;
    for(int i=l-t;i>=1&&s<=3;){
            int k=(int)Math.sqrt(i);
            if(k*k==i){l-=k*k;i=l;ms[s]=k;s++;}
            else i--;}
       if(l==0){
           for(int i=0;i<4&&ms[i]!=0;i++)
            System.out.print(i<3?ms[i]+" ":ms[i]);
           return;}
        else {t+=ms[0]*2-1;ms=new int[4];lag(n,ms,t);}}
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int n=myscan.nextInt(),mas[]=new int[4];
       lag(n,mas,0);
    }
}


# C++
#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    for (int i=1; i<=n; i++)
        for (int j=0; j<=i; j++)
            for (int k=0; k<=i; k++)
                for (int l=0; l<=i; l++)
                    if (i*i + j*j + k*k + l*l == n)
                    {
                        cout << i;
                        if (j!=0) cout << " " << j;
                        if (k!=0) cout << " " << k;
                        if (l!=0) cout << " " << l;
                        return 0;
                    }
}

