Дружественные числа

Два различных натуральных числа n и m называются дружественными, если сумма делителей числа n (включая 1, но исключая само n) равна числу m и наоборот. Например, 220 и 284 – дружественные числа. По данному числу k выведите все пары дружественных чисел, каждое из которых не превосходит k.

Входные данные
Программа получает на вход одно натуральное число k, не превосходящее 105.

Выходные данные
Программа должна вывести  все пары дружественных чисел, каждое из которых не превосходит k. Пары необходимо выводить по одной в строке, разделяя пробелами. Каждая пара должна быть выведена только один раз (перестановка чисел новую пару не дает). В парах выводим сначала меньшее число, потом большее.

Если таких пар нет - выводить ничего не нужно.

Sample Input:
300
Sample Output:
220 284

Напишите программу. Тестируется через stdin → stdout
Верно решили 93 учащихся
Из всех попыток 43% верных


# ruby 
def getSum(value)
    res = 1 + (((value.to_f**0.5).to_i)**2 != value ? 0 : (value.to_f**0.5).to_i)
    2.upto((value.to_f**0.5).to_i-1) do |i|
        if value % i == 0
            res += i + value / i
        end    
    end    
    return res
end  

n = gets.to_i

10.upto(n) do |i|
    sum1 = getSum(i)
    sum2 = getSum(sum1)
    if sum2 == i and sum2 < sum1 and sum1 < n
        print "#{i} #{sum1}\n"
    end 
end



# python
def divisors_sum(num: int) -> int:
    'Sum of the proper divisors of num'
    sqrt_n = int(num ** .5)
    res = - num + sum(i + num // i for i in range(1, sqrt_n + 1) if not num % i)
    if sqrt_n * sqrt_n == num:
        res -= sqrt_n
    return res

K = int(input())
amicables = []

for n in range(2, K):
    if n in amicables:
        continue
    m = divisors_sum(n)
    if n < m <= K and n == divisors_sum(m):
        amicables.extend((n, m))

[print(amicables[i], amicables[i+1]) for i in range(0, len(amicables), 2)]


# java
import java.util.Scanner;
import java.util.List;
import java.util.ArrayList;
class Main {
    public static void friend(int k){
        ArrayList mylist=new ArrayList();
        for(int i=k;i>1;i--){
            int n=0,m=0;
            for(int j=i-1;j>0;j--){
                if(i%j==0)n+=j;}
        for(int l=n-1;l>0;l--){
            if(n%l==0)m+=l;}
            if(m==i&&n!=i&&mylist.contains(i)==false&&mylist.contains(n)==false&&i<=k&&n<=k){
           mylist.add((int)Math.max(i,n));mylist.add((int)Math.min(i,n));}}
            if(mylist!=null){
            for(int g=mylist.size()-1;g>=1;g--)
            System.out.println(mylist.get(g)+" "+mylist.get(--g));}}
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int k=myscan.nextInt();    
    friend(k);   
    }
}


# C++
#include <iostream>
using namespace std;

int sum_of_dividers(int n){
int result=0;
for (int i=1;i<n;i++)
    if(n%i==0)
        result+=i;
return result;
}

int main() {

int n;
cin>>n;

for(int i=1;i<n;i++){
    int s1=sum_of_dividers(i);
    int s2=sum_of_dividers(s1);
    if(i==s2&&i!=s1&&i<s1&&s1<=n)
        cout<<i<<" "<<s1<<endl;
    }
  return 0;
}

