Разрезание на квадраты

Полоска бумаги имеет размеры A × B. Каждый раз от нее отрезается квадрат максимального размера до тех пор, пока не получится квадрат. Сколько квадратов получится?

Входные данные
Программе даны числа A и B (1 ≤ A, B ≤ 109).

Выходные данные
Требуется вывести количество квадратов.

Sample Input 1:
15 3

Sample Output 1:
5

Sample Input 2:
12 8

Sample Output 2:
3

Sample Input 3:
5 5

Sample Output 3:
1

Напишите программу. Тестируется через stdin → stdout
Верно решили 95 учащихся
Из всех попыток 49% верных


# ruby
a, b = gets.split.map(&:to_i)
k = 1
while a != b do
  k += 1
  if a > b
    a -= b
  else
    b -= a
  end
end
puts k


# python
f = lambda a, b: int(a == b) or a//b + (a%b and f(b, a%b))
print(f(*map(int, input().split())))


# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
int a=v.nextInt(),b=v.nextInt(),chet=0;
for(;a>0||b>0;){
    if(a>b){a=a-b;chet++;}
    else if(b>a){b=b-a;chet++;}
    else{chet++;break;}    
}
System.out.println(chet);        
    }
}