Гипотеза Гольдбаха

Гипотеза Гольдбаха (не доказанная до сих пор) утверждает, что любое четное число (кроме 2) можно представить в виде суммы двух простых чисел.

Входные данные
Программа получает на вход одно натуральное четное число n (3 < n < 2*105).

Выходные данные
Программа должна вывести два числа, разделенные пробелом (если числа не равны, сначала выводим меньшее, потом большее). Если есть несколько пар простых чисел, то вывести надо ту, у которой наименьшее число.

Числа должны быть простыми и давать в сумме n.

Sample Input 1:
4

Sample Output 1:
2 2


Sample Input 2:
6
Sample Output 2:
3 3

Напишите программу. Тестируется через stdin → stdout
Верно решили 102 учащихся
Из всех попыток 49% верных


# ruby
def goldbach(n)
    def is_prime(n)
        if n < 4 then return n > 1 end
        k = 2
        while k*k <= n do
            if n%k == 0 then return false end 
            k += 1
        end        
        return true
    end        
    if n%2>0 then return [] end
    2.upto(n-1) do |i|
        if is_prime(i) == true and is_prime(n-i) == true then return [i, n-i] end
    end        
    return []
end        

n = gets.to_i
print goldbach(n).join(" ")


# python
def goldbach(n):
    #==========================================================================
    def is_prime(n):
        if n < 4:
            return n > 1
        k = 2
        while k*k <= n:
            if n%k == 0:
                return False
            k += 1
        return True
    # =========================================================================
    if n%2:
        return []
    for x in range( 2, n ):
        if is_prime(x) and is_prime(n-x):
            return x, n-x
    return []
# =============================================================================
#n = int( input( 'n = ' ) )
n=6
print( goldbach(n) )


# java
import java.util.Scanner;
import java.util.ArrayList;
class Main {
    public static void main(String[] args) {
Scanner v = new Scanner(System.in);
int n =v.nextInt(),x1=0,x2=0;boolean ff=false;
ArrayList <Integer> vasList=new ArrayList();        
for(int i=n,br=0;i>0;i--){
    for(int j=i,chet=0;j>0;j--){
        if(i%j==0){chet++;}
        if(j-1==0&&chet==2){vasList.add(i);}
    }
}                            
for(int i=0;i<vasList.size();i++){
    x1=vasList.get(i);
    for(int j=0;j<vasList.size();j++){
        x2=vasList.get(j);
        if(x1+x2==n){ff=true;break;}
    }
if(ff){break;}
}        
System.out.println(x1>x2?x2+" "+x1:x1+" "+x2);        
    }
}



# C++
#include <iostream>
using namespace std;

bool pro(int n)
{
    for (int i=2; i<n; i++)
        if (n%i==0) return 0;
    return 1;
}

int main() {
    int n;
    cin >> n;
    for (int i=2; i<n-1; i++)
        if (pro(i) and pro(n-i)) {cout << i << " " << n-i << endl; return 0;}

    return 0;
}



