Сообразим на троих!

К Василию приехали два его друга с отличной новостью: они выиграли в лотерею N рублей. Поскольку лотерейный билет был получен на сдачу во время общей закупки в магазине, то его принадлежность определить не удалось. Было решено разделить выигрыш поровну. Василий хотел бы узнать, возможно ли честно разделить выигрыш?

Входные данные
На единственной строке записано натуральное число N, количество знаков которого не превышает 255.

Выходные данные
Требуется вывести "YES"  – если введенное число делится на 3, "NO"  – если не делится.

Sample Input 1:
1234567890987654321

Sample Output 1:
YES

Sample Input 2:
25

Sample Output 2:
NO

Напишите программу. Тестируется через stdin → stdout
Верно решили 130 учащихся
Из всех попыток 82% верных


# ruby
a = gets.split("").map{|j| j.to_i}
print a.sum%3==0 ? "YES" : "NO"


# python
print('NO' if int(input()) % 3 else 'YES')


# JS
let arr = require('fs').readFileSync(0, 'utf8').split('').map(Number);
const sum = arr.reduce((accumulator, currentValue) => accumulator + currentValue);
console.log(sum % 3 ? 'NO' : 'YES');

# java
import java.util.Scanner;
class Main {
    public static void main(String[] args) {
String []n=new Scanner(System.in).nextLine().split("");int chet=0;
for(int i=0;i<n.length;i++){
chet+=Integer.parseInt(n[i]);}     
System.out.println(chet%3==0?"YES":"NO");
    }
}





