Сумма двух кубов

Представьте данное число n в виде суммы двух кубов.

Входные данные
Программа получает на вход одно натуральное число n (n <= 1028).

Выходные данные
Программа должна вывести 2 целых положительных числа, сумма кубов которых равна n (выводить в порядке возрастания). Если это невозможно, выведите строку impossible.

Sample Input 1:
2

Sample Output 1:
1 1

Sample Input 2:
3

Sample Output 2:
impossible

Напишите программу. Тестируется через stdin → stdout
Верно решили 118 учащихся
Из всех попыток 27% верных

# ruby
def sum_of_cubes(n) 
    c = (n.to_f ** (1.to_f / 3)).to_i  # Кубический корень из n, округленный вниз 
    0.upto(c) do |a| 
        a.upto(c) do |b|  # Начинаем с a, чтобы избежать дублирования пар 
            if (a ** 3 + b ** 3 == n) and a>0 and b>0 then return a, b end
        end
    end        
    return ["impossible"]
end        


# Пример использования функции 
n  = gets.to_i    
result = sum_of_cubes(n)     
print result.join(" ")

# python
def sk(n):
    for k1 in range(1, round((n//2)**(1/3))+1):
        k2 = round((n-k1**3)**(1/3))
        if k1**3 + k2**3 == n: return f'{k1} {k2}'
    return 'impossible'

print(sk(int(input())))


# JS
const n = +require('fs').readFileSync(0, 'utf8');

let flag = false;
let res = 'impossible';
for (let i = 1; i < Math.cbrt(n); i++) {
    for (let j = i; j < Math.cbrt(n); j++)
        if (Math.pow(i, 3) + Math.pow(j, 3) == n) {
            res = `${i} ${j}`; 
            flag = true;
            break;
        }
    if (flag)
        break;
}

console.log(res);


# java
import java.util.Scanner;
class Main {
    public static void kub(int n){
    for(int i=1,t=0;i<=10;i++,t++){
        for(int j=11;j>t;j--){
            if(i*i*i+j*j*j==n){System.out.print((int)Math.min(i,j)+" "+(int)Math.max(i,j));return;}
            if(i==10&&j==t+1)System.out.print("impossible");
                }}
            return;}
    public static void main(String[] args) {
    Scanner myscan=new Scanner(System.in);
        int n=myscan.nextInt();
       kub(n);
    }
}


